iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
//////////////////////////////////////////////////////////////////////////////////////
// File: MKM34Z128LL5.h
// Purpose: Define the peripheral registers.
// This file has been automatically generated from the APIF knowledgebase
//
// Revisions:
// - rev. 1.0 (2011-06-01)
//     Initial public version.
// - rev. 1.1 (2012-03-13)
//     Bit/group constants related to 32-bit registers typecasted to uint32_t.
//
//////////////////////////////////////////////////////////////////////////////////////
#include <stdint.h>
//
//////////////////////////////////////////////////////////////////////////////////////
// Generic Bit Definitions Used Elsewhere in this File
//
// Peripheral Base Address Defines in Alphabetical Order
//
#define  ADC_BASE_PTR                ((uint8_t *) (0x4002B000u))

#define  AFE_BASE_PTR                ((uint8_t *) (0x40030000u))

#define  AIPS_BASE_PTR               ((uint8_t *) (0x40000000u))

#define  CMP_BASE_PTR                ((uint8_t *) (0x40072000u))

#define  CRC_BASE_PTR                ((uint8_t *) (0x40034000u))

#define  DMAMUX0_BASE_PTR            ((uint8_t *) (0x40021000u))

#define  DMAMUX1_BASE_PTR            ((uint8_t *) (0x40022000u))

#define  DMAMUX2_BASE_PTR            ((uint8_t *) (0x40023000u))

#define  DMAMUX3_BASE_PTR            ((uint8_t *) (0x40024000u))

#define  EWM_BASE_PTR                ((uint8_t *) (0x40061000u))

#define  FTFA_BASE_PTR               ((uint8_t *) (0x40020000u))

#define  GPIO_BASE_PTR               ((uint8_t *) (0x400FF000u))

#define  I2C0_BASE_PTR               ((uint8_t *) (0x40067000u))

#define  I2C1_BASE_PTR               ((uint8_t *) (0x40068000u))

#define  LCD_BASE_PTR                ((uint8_t *) (0x40043000u))

#define  LLWU_BASE_PTR               ((uint8_t *) (0x4007C000u))

#define  LPTMR_BASE_PTR              ((uint32_t *) (0x4003C000u))

#define  MCG_BASE_PTR                ((uint8_t *) (0x40064000u))

#define  MCM_BASE_PTR                ((uint8_t *) (0xF0003000u))

#define  MPU_BASE_PTR                ((uint8_t *) (0x4000A000u))

#define  MTB_BASE_PTR                ((uint8_t *) (0xF0000000u))

#define  MTBDWT_BASE_PTR             ((uint8_t *) (0xF0001000u))

#define  OSC_BASE_PTR                ((uint8_t *) (0x40066000u))

#define  PIT0_BASE_PTR               ((uint32_t *) (0x4002D000u))

#define  PIT1_BASE_PTR               ((uint32_t *) (0x4002E000u))

#define  PMC_BASE_PTR                ((uint8_t *) (0x4007D000u))

#define  RCM_BASE_PTR                ((uint8_t *) (0x4007B000u))

#define  RNG_BASE_PTR                ((uint8_t *) (0x40029000u))

#define  ROM_BASE_PTR                ((uint8_t *) (0xF0002000u))

#define  RTC_BASE_PTR                ((uint8_t *) (0x40050000u))

#define  SIM_BASE_PTR                ((uint8_t *) (0x4003F000u))

#define  SMC_BASE_PTR                ((uint8_t *) (0x4007E000u))

#define  SPI0_BASE_PTR               ((uint8_t *) (0x40075000u))

#define  SPI1_BASE_PTR               ((uint8_t *) (0x40076000u))

#define  TMR0_BASE_PTR               ((uint16_t *) (0x40057000u))

#define  TMR1_BASE_PTR               ((uint16_t *) (0x40058000u))

#define  TMR2_BASE_PTR               ((uint16_t *) (0x40059000u))

#define  TMR3_BASE_PTR               ((uint16_t *) (0x4005A000u))

#define  UART0_BASE_PTR              ((uint8_t *) (0x4006A000u))

#define  UART1_BASE_PTR              ((uint8_t *) (0x4006B000u))

#define  UART2_BASE_PTR              ((uint8_t *) (0x4006C000u))

#define  UART3_BASE_PTR              ((uint8_t *) (0x4006D000u))

#define  VREF_BASE_PTR               ((uint8_t *) (0x4006F000u))

#define  WDOG_BASE_PTR               ((uint8_t *) (0x40053000u))

#define  XBAR_BASE_PTR               ((uint16_t *) (0x40055000u))


//////////////////////////////////////////////////////////////////////////////////////
// The following section defines the IO register locations.
//////////////////////////////////////////////////////////////////////////////////////

#define  ADC_SC1A                    (*(uint32_t *) (0x4002B000))

#define  ADC_SC1B                    (*(uint32_t *) (0x4002B004))

#define  ADC_CFG1                    (*(uint32_t *) (0x4002B008))

#define  ADC_CFG2                    (*(uint32_t *) (0x4002B00C))

#define  ADC_RA                      (*(uint32_t *) (0x4002B010))

#define  ADC_RB                      (*(uint32_t *) (0x4002B014))

#define  ADC_CV1                     (*(uint32_t *) (0x4002B018))

#define  ADC_CV2                     (*(uint32_t *) (0x4002B01C))

#define  ADC_SC2                     (*(uint32_t *) (0x4002B020))

#define  ADC_SC3                     (*(uint32_t *) (0x4002B024))

#define  ADC_OFS                     (*(uint32_t *) (0x4002B028))

#define  ADC_PG                      (*(uint32_t *) (0x4002B02C))

#define  ADC_MG                      (*(uint32_t *) (0x4002B030))

#define  ADC_CLPD                    (*(uint32_t *) (0x4002B034))

#define  ADC_CLPS                    (*(uint32_t *) (0x4002B038))

#define  ADC_CLP4                    (*(uint32_t *) (0x4002B03C))

#define  ADC_CLP3                    (*(uint32_t *) (0x4002B040))

#define  ADC_CLP2                    (*(uint32_t *) (0x4002B044))

#define  ADC_CLP1                    (*(uint32_t *) (0x4002B048))

#define  ADC_CLP0                    (*(uint32_t *) (0x4002B04C))

#define  ADC_PGA                     (*(uint32_t *) (0x4002B050))

#define  ADC_CLMD                    (*(uint32_t *) (0x4002B054))

#define  ADC_CLMS                    (*(uint32_t *) (0x4002B058))

#define  ADC_CLM4                    (*(uint32_t *) (0x4002B05C))

#define  ADC_CLM3                    (*(uint32_t *) (0x4002B060))

#define  ADC_CLM2                    (*(uint32_t *) (0x4002B064))

#define  ADC_CLM1                    (*(uint32_t *) (0x4002B068))

#define  ADC_CLM0                    (*(uint32_t *) (0x4002B06C))

#define  AFE_CH1_CFR                 (*(uint32_t *) (0x40030000))

#define  AFE_CH2_CFR                 (*(uint32_t *) (0x40030004))

#define  AFE_CH3_CFR                 (*(uint32_t *) (0x40030008))

#define  AFE_CH4_CFR                 (*(uint32_t *) (0x4003000C))

#define  AFE_CR                      (*(uint32_t *) (0x40030018))

#define  AFE_CKR                     (*(uint32_t *) (0x4003001C))

