iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  AFE_DI                      (*(uint32_t *) (0x40030020))

#define  AFE_CH1_DR                  (*(uint32_t *) (0x4003002C))

#define  AFE_CH2_DR                  (*(uint32_t *) (0x40030030))

#define  AFE_CH3_DR                  (*(uint32_t *) (0x40030034))

#define  AFE_CH4_DR                  (*(uint32_t *) (0x40030038))

#define  AFE_CH1_RR                  (*(uint32_t *) (0x40030044))

#define  AFE_CH2_RR                  (*(uint32_t *) (0x40030048))

#define  AFE_CH3_RR                  (*(uint32_t *) (0x4003004C))

#define  AFE_CH4_RR                  (*(uint32_t *) (0x40030050))

#define  AFE_SR                      (*(uint32_t *) (0x4003005C))

#define  AFE_TR                      (*(uint32_t *) (0x40030060))

#define  AIPS_MPRA                   (*(uint32_t *) (0x40000000))

#define  AIPS_PACRA                  (*(uint32_t *) (0x40000020))

#define  AIPS_PACRB                  (*(uint32_t *) (0x40000024))

#define  AIPS_PACRC                  (*(uint32_t *) (0x40000028))

#define  AIPS_PACRD                  (*(uint32_t *) (0x4000002C))

#define  AIPS_PACRE                  (*(uint32_t *) (0x40000040))

#define  AIPS_PACRF                  (*(uint32_t *) (0x40000044))

#define  AIPS_PACRG                  (*(uint32_t *) (0x40000048))

#define  AIPS_PACRH                  (*(uint32_t *) (0x4000004C))

#define  AIPS_PACRI                  (*(uint32_t *) (0x40000050))

#define  AIPS_PACRJ                  (*(uint32_t *) (0x40000054))

#define  AIPS_PACRK                  (*(uint32_t *) (0x40000058))

#define  AIPS_PACRL                  (*(uint32_t *) (0x4000005C))

#define  AIPS_PACRM                  (*(uint32_t *) (0x40000060))

#define  AIPS_PACRN                  (*(uint32_t *) (0x40000064))

#define  AIPS_PACRO                  (*(uint32_t *) (0x40000068))

#define  AIPS_PACRP                  (*(uint32_t *) (0x4000006C))

#define  AIPS_PACRU                  (*(uint32_t *) (0x40000080))

#define  CMP_CR0                     (*(uint8_t *) (0x40072000))

#define  CMP_CR1                     (*(uint8_t *) (0x40072001))

#define  CMP_FPR                     (*(uint8_t *) (0x40072002))

#define  CMP_SCR                     (*(uint8_t *) (0x40072003))

#define  CMP_DACCR                   (*(uint8_t *) (0x40072004))

#define  CMP_MUXCR                   (*(uint8_t *) (0x40072005))

#define  CRC_CRC                     (*(uint32_t *) (0x40034000))

#define  CRC_GPOLY                   (*(uint32_t *) (0x40034004))

#define  CRC_CTRL                    (*(uint32_t *) (0x40034008))

#define  DMAMUX0_CHCFG0              (*(uint8_t *) (0x40021000))

#define  DMAMUX0_CHCFG1              (*(uint8_t *) (0x40021001))

#define  DMAMUX0_CHCFG2              (*(uint8_t *) (0x40021002))

#define  DMAMUX0_CHCFG3              (*(uint8_t *) (0x40021003))

#define  DMAMUX1_CHCFG0              (*(uint8_t *) (0x40022000))

#define  DMAMUX1_CHCFG1              (*(uint8_t *) (0x40022001))

#define  DMAMUX1_CHCFG2              (*(uint8_t *) (0x40022002))

#define  DMAMUX1_CHCFG3              (*(uint8_t *) (0x40022003))

#define  DMAMUX2_CHCFG0              (*(uint8_t *) (0x40023000))

#define  DMAMUX2_CHCFG1              (*(uint8_t *) (0x40023001))

#define  DMAMUX2_CHCFG2              (*(uint8_t *) (0x40023002))

#define  DMAMUX2_CHCFG3              (*(uint8_t *) (0x40023003))

#define  DMAMUX3_CHCFG0              (*(uint8_t *) (0x40024000))

#define  DMAMUX3_CHCFG1              (*(uint8_t *) (0x40024001))

#define  DMAMUX3_CHCFG2              (*(uint8_t *) (0x40024002))

#define  DMAMUX3_CHCFG3              (*(uint8_t *) (0x40024003))

#define  EWM_CTRL                    (*(uint8_t *) (0x40061000))

#define  EWM_SERV                    (*(uint8_t *) (0x40061001))

#define  EWM_CMPL                    (*(uint8_t *) (0x40061002))

#define  EWM_CMPH                    (*(uint8_t *) (0x40061003))

#define  FTFA_FSTAT                  (*(uint8_t *) (0x40020000))

#define  FTFA_FCNFG                  (*(uint8_t *) (0x40020001))

#define  FTFA_FSEC                   (*(uint8_t *) (0x40020002))

#define  FTFA_FOPT                   (*(uint8_t *) (0x40020003))

#define  FTFA_FCCOB3                 (*(uint8_t *) (0x40020004))

#define  FTFA_FCCOB2                 (*(uint8_t *) (0x40020005))

#define  FTFA_FCCOB1                 (*(uint8_t *) (0x40020006))

#define  FTFA_FCCOB0                 (*(uint8_t *) (0x40020007))

#define  FTFA_FCCOB7                 (*(uint8_t *) (0x40020008))

#define  FTFA_FCCOB6                 (*(uint8_t *) (0x40020009))

#define  FTFA_FCCOB5                 (*(uint8_t *) (0x4002000A))

#define  FTFA_FCCOB4                 (*(uint8_t *) (0x4002000B))

#define  FTFA_FCCOBB                 (*(uint8_t *) (0x4002000C))

#define  FTFA_FCCOBA                 (*(uint8_t *) (0x4002000D))

#define  FTFA_FCCOB9                 (*(uint8_t *) (0x4002000E))

#define  FTFA_FCCOB8                 (*(uint8_t *) (0x4002000F))

#define  FTFA_FPROT3                 (*(uint8_t *) (0x40020010))

#define  FTFA_FPROT2                 (*(uint8_t *) (0x40020011))

#define  FTFA_FPROT1                 (*(uint8_t *) (0x40020012))

#define  FTFA_FPROT0                 (*(uint8_t *) (0x40020013))

#define  GPIO_PDOR                   (*(uint32_t *) (0x400FF000))

#define  GPIO_PSOR                   (*(uint32_t *) (0x400FF004))

#define  GPIO_PCOR                   (*(uint32_t *) (0x400FF008))

#define  GPIO_PTOR                   (*(uint32_t *) (0x400FF00C))

#define  GPIO_PDIR                   (*(uint32_t *) (0x400FF010))

#define  I2C0_A1                     (*(uint8_t *) (0x40067000))

#define  I2C0_F                      (*(uint8_t *) (0x40067001))

#define  I2C0_C1                     (*(uint8_t *) (0x40067002))

#define  I2C0_S                      (*(uint8_t *) (0x40067003))

#define  I2C0_D                      (*(uint8_t *) (0x40067004))

#define  I2C0_C2                     (*(uint8_t *) (0x40067005))

#define  I2C0_FLT                    (*(uint8_t *) (0x40067006))

#define  I2C0_RA                     (*(uint8_t *) (0x40067007))

#define  I2C0_SMB                    (*(uint8_t *) (0x40067008))

#define  I2C0_A2                     (*(uint8_t *) (0x40067009))

