iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  I2C0_SLTH                   (*(uint8_t *) (0x4006700A))

#define  I2C0_SLTL                   (*(uint8_t *) (0x4006700B))

#define  I2C1_A1                     (*(uint8_t *) (0x40068000))

#define  I2C1_F                      (*(uint8_t *) (0x40068001))

#define  I2C1_C1                     (*(uint8_t *) (0x40068002))

#define  I2C1_S                      (*(uint8_t *) (0x40068003))

#define  I2C1_D                      (*(uint8_t *) (0x40068004))

#define  I2C1_C2                     (*(uint8_t *) (0x40068005))

#define  I2C1_FLT                    (*(uint8_t *) (0x40068006))

#define  I2C1_RA                     (*(uint8_t *) (0x40068007))

#define  I2C1_SMB                    (*(uint8_t *) (0x40068008))

#define  I2C1_A2                     (*(uint8_t *) (0x40068009))

#define  I2C1_SLTH                   (*(uint8_t *) (0x4006800A))

#define  I2C1_SLTL                   (*(uint8_t *) (0x4006800B))

#define  LCD_GCR                     (*(uint32_t *) (0x40043000))

#define  LCD_AR                      (*(uint32_t *) (0x40043004))

#define  LCD_FDCR                    (*(uint32_t *) (0x40043008))

#define  LCD_FDSR                    (*(uint32_t *) (0x4004300C))

#define  LCD_PENL                    (*(uint32_t *) (0x40043010))

#define  LCD_PENH                    (*(uint32_t *) (0x40043014))

#define  LCD_BPENL                   (*(uint32_t *) (0x40043018))

#define  LCD_BPENH                   (*(uint32_t *) (0x4004301C))

#define  LCD_WF3TO0                  (*(uint32_t *) (0x40043020))

#define  LCD_WF7TO4                  (*(uint32_t *) (0x40043024))

#define  LCD_WF11TO8                 (*(uint32_t *) (0x40043028))

#define  LCD_WF15TO12                (*(uint32_t *) (0x4004302C))

#define  LCD_WF19TO16                (*(uint32_t *) (0x40043030))

#define  LCD_WF23TO20                (*(uint32_t *) (0x40043034))

#define  LCD_WF27TO24                (*(uint32_t *) (0x40043038))

#define  LCD_WF31TO28                (*(uint32_t *) (0x4004303C))

#define  LCD_WF35TO32                (*(uint32_t *) (0x40043040))

#define  LCD_WF39TO36                (*(uint32_t *) (0x40043044))

#define  LCD_WF43TO40                (*(uint32_t *) (0x40043048))

#define  LCD_WF47TO44                (*(uint32_t *) (0x4004304C))

#define  LCD_WF51TO48                (*(uint32_t *) (0x40043050))

#define  LCD_WF55TO52                (*(uint32_t *) (0x40043054))

#define  LCD_WF59TO56                (*(uint32_t *) (0x40043058))

#define  LCD_WF63TO60                (*(uint32_t *) (0x4004305C))

#define  LLWU_PE1                    (*(uint8_t *) (0x4007C000))

#define  LLWU_PE2                    (*(uint8_t *) (0x4007C001))

#define  LLWU_PE3                    (*(uint8_t *) (0x4007C002))

#define  LLWU_PE4                    (*(uint8_t *) (0x4007C003))

#define  LLWU_ME                     (*(uint8_t *) (0x4007C004))

#define  LLWU_F1                     (*(uint8_t *) (0x4007C005))

#define  LLWU_F2                     (*(uint8_t *) (0x4007C006))

#define  LLWU_F3                     (*(uint8_t *) (0x4007C007))

#define  LLWU_FILT1                  (*(uint8_t *) (0x4007C008))

#define  LLWU_FILT2                  (*(uint8_t *) (0x4007C009))

#define  LPTMR_CSR                   (*(uint32_t *) (0x4003C000))

#define  LPTMR_PSR                   (*(uint32_t *) (0x4003C004))

#define  LPTMR_CMR                   (*(uint32_t *) (0x4003C008))

#define  LPTMR_CNR                   (*(uint32_t *) (0x4003C00C))

#define  MCG_C1                      (*(uint8_t *) (0x40064000))

#define  MCG_C2                      (*(uint8_t *) (0x40064001))

#define  MCG_C3                      (*(uint8_t *) (0x40064002))

#define  MCG_C4                      (*(uint8_t *) (0x40064003))

#define  MCG_C5                      (*(uint8_t *) (0x40064004))

#define  MCG_C6                      (*(uint8_t *) (0x40064005))

#define  MCG_S                       (*(uint8_t *) (0x40064006))

#define  MCG_SC                      (*(uint8_t *) (0x40064008))

#define  MCG_ATCVH                   (*(uint8_t *) (0x4006400A))

#define  MCG_ATCVL                   (*(uint8_t *) (0x4006400B))

#define  MCG_C7                      (*(uint8_t *) (0x4006400C))

#define  MCG_C8                      (*(uint8_t *) (0x4006400D))

#define  MCG_C10                     (*(uint8_t *) (0x4006400F))

#define  MCM_CR                      (*(uint32_t *) (0xF000300C))

#define  MCM_PID                     (*(uint32_t *) (0xF0003030))

#define  MPU_CESR                    (*(uint32_t *) (0x4000A000))

#define  MPU_EAR0                    (*(uint32_t *) (0x4000A010))

#define  MPU_EDR0                    (*(uint32_t *) (0x4000A014))

#define  MPU_EAR1                    (*(uint32_t *) (0x4000A018))

#define  MPU_EDR1                    (*(uint32_t *) (0x4000A01C))

#define  MPU_RGD0_WORD0              (*(uint32_t *) (0x4000A400))

#define  MPU_RGD0_WORD1              (*(uint32_t *) (0x4000A404))

#define  MPU_RGD0_WORD2              (*(uint32_t *) (0x4000A408))

#define  MPU_RGD0_WORD3              (*(uint32_t *) (0x4000A40C))

#define  MPU_RGD1_WORD0              (*(uint32_t *) (0x4000A410))

#define  MPU_RGD1_WORD1              (*(uint32_t *) (0x4000A414))

#define  MPU_RGD1_WORD2              (*(uint32_t *) (0x4000A418))

#define  MPU_RGD1_WORD3              (*(uint32_t *) (0x4000A41C))

#define  MPU_RGD2_WORD0              (*(uint32_t *) (0x4000A420))

#define  MPU_RGD2_WORD1              (*(uint32_t *) (0x4000A424))

#define  MPU_RGD2_WORD2              (*(uint32_t *) (0x4000A428))

#define  MPU_RGD2_WORD3              (*(uint32_t *) (0x4000A42C))

#define  MPU_RGD3_WORD0              (*(uint32_t *) (0x4000A430))

#define  MPU_RGD3_WORD1              (*(uint32_t *) (0x4000A434))

#define  MPU_RGD3_WORD2              (*(uint32_t *) (0x4000A438))

#define  MPU_RGD3_WORD3              (*(uint32_t *) (0x4000A43C))

#define  MPU_RGD4_WORD0              (*(uint32_t *) (0x4000A440))

#define  MPU_RGD4_WORD1              (*(uint32_t *) (0x4000A444))

#define  MPU_RGD4_WORD2              (*(uint32_t *) (0x4000A448))

