iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  MPU_RGD4_WORD3              (*(uint32_t *) (0x4000A44C))

#define  MPU_RGD5_WORD0              (*(uint32_t *) (0x4000A450))

#define  MPU_RGD5_WORD1              (*(uint32_t *) (0x4000A454))

#define  MPU_RGD5_WORD2              (*(uint32_t *) (0x4000A458))

#define  MPU_RGD5_WORD3              (*(uint32_t *) (0x4000A45C))

#define  MPU_RGD6_WORD0              (*(uint32_t *) (0x4000A460))

#define  MPU_RGD6_WORD1              (*(uint32_t *) (0x4000A464))

#define  MPU_RGD6_WORD2              (*(uint32_t *) (0x4000A468))

#define  MPU_RGD6_WORD3              (*(uint32_t *) (0x4000A46C))

#define  MPU_RGD7_WORD0              (*(uint32_t *) (0x4000A470))

#define  MPU_RGD7_WORD1              (*(uint32_t *) (0x4000A474))

#define  MPU_RGD7_WORD2              (*(uint32_t *) (0x4000A478))

#define  MPU_RGD7_WORD3              (*(uint32_t *) (0x4000A47C))

#define  MPU_RGDAAC0                 (*(uint32_t *) (0x4000A800))

#define  MPU_RGDAAC1                 (*(uint32_t *) (0x4000A804))

#define  MPU_RGDAAC2                 (*(uint32_t *) (0x4000A808))

#define  MPU_RGDAAC3                 (*(uint32_t *) (0x4000A80C))

#define  MPU_RGDAAC4                 (*(uint32_t *) (0x4000A810))

#define  MPU_RGDAAC5                 (*(uint32_t *) (0x4000A814))

#define  MPU_RGDAAC6                 (*(uint32_t *) (0x4000A818))

#define  MPU_RGDAAC7                 (*(uint32_t *) (0x4000A81C))

#define  MTB_POSITION                (*(uint32_t *) (0xF0000000))

#define  MTB_MASTER                  (*(uint32_t *) (0xF0000004))

#define  MTB_FLOW                    (*(uint32_t *) (0xF0000008))

#define  MTB_BASE                    (*(uint32_t *) (0xF000000C))

#define  MTB_MODECTRL                (*(uint32_t *) (0xF0000F00))

#define  MTB_TAGSET                  (*(uint32_t *) (0xF0000FA0))

#define  MTB_TAGCLEAR                (*(uint32_t *) (0xF0000FA4))

#define  MTB_LOCKACCESS              (*(uint32_t *) (0xF0000FB0))

#define  MTB_LOCKSTAT                (*(uint32_t *) (0xF0000FB4))

#define  MTB_AUTHSTAT                (*(uint32_t *) (0xF0000FB8))

#define  MTB_DEVICEARCH              (*(uint32_t *) (0xF0000FBC))

#define  MTB_DEVICECFG               (*(uint32_t *) (0xF0000FC8))

#define  MTB_DEVICETYPID             (*(uint32_t *) (0xF0000FCC))

#define  MTB_PERIPHID4               (*(uint32_t *) (0xF0000FD0))

#define  MTB_PERIPHID5               (*(uint32_t *) (0xF0000FD4))

#define  MTB_PERIPHID6               (*(uint32_t *) (0xF0000FD8))

#define  MTB_PERIPHID7               (*(uint32_t *) (0xF0000FDC))

#define  MTB_PERIPHID0               (*(uint32_t *) (0xF0000FE0))

#define  MTB_PERIPHID1               (*(uint32_t *) (0xF0000FE4))

#define  MTB_PERIPHID2               (*(uint32_t *) (0xF0000FE8))

#define  MTB_PERIPHID3               (*(uint32_t *) (0xF0000FEC))

#define  MTB_COMPID0                 (*(uint32_t *) (0xF0000FF0))

#define  MTB_COMPID1                 (*(uint32_t *) (0xF0000FF4))

#define  MTB_COMPID2                 (*(uint32_t *) (0xF0000FF8))

#define  MTB_COMPID3                 (*(uint32_t *) (0xF0000FFC))

#define  MTBDWT_CTRL                 (*(uint32_t *) (0xF0002000))

#define  MTBDWT_COMP0                (*(uint32_t *) (0xF0002020))

#define  MTBDWT_MASK0                (*(uint32_t *) (0xF0002024))

#define  MTBDWT_COMP1                (*(uint32_t *) (0xF000202A))

#define  MTBDWT_MASK1                (*(uint32_t *) (0xF000202E))

#define  MTBDWT_FCT1                 (*(uint32_t *) (0xF0002038))

#define  MTBDWT_TBCTRL               (*(uint32_t *) (0xF0002200))

#define  MTBDWT_DEVICECFG            (*(uint32_t *) (0xF0002FC8))

#define  MTBDWT_DEVICETYPID          (*(uint32_t *) (0xF0002FCC))

#define  MTBDWT_PERIPHID4            (*(uint32_t *) (0xF0002FD0))

#define  MTBDWT_PERIPHID5            (*(uint32_t *) (0xF0002FD4))

#define  MTBDWT_PERIPHID6            (*(uint32_t *) (0xF0002FD8))

#define  MTBDWT_PERIPHID7            (*(uint32_t *) (0xF0002FDC))

#define  MTBDWT_PERIPHID0            (*(uint32_t *) (0xF0002FE0))

#define  MTBDWT_PERIPHID1            (*(uint32_t *) (0xF0002FE4))

#define  MTBDWT_PERIPHID2            (*(uint32_t *) (0xF0002FE8))

#define  MTBDWT_PERIPHID3            (*(uint32_t *) (0xF0002FEC))

#define  MTBDWT_COMPID0              (*(uint32_t *) (0xF0002FF0))

#define  MTBDWT_COMPID1              (*(uint32_t *) (0xF0002FF4))

#define  MTBDWT_COMPID2              (*(uint32_t *) (0xF0002FF8))

#define  MTBDWT_COMPID3              (*(uint32_t *) (0xF0002FFC))

#define  OSC_CR                      (*(uint8_t *) (0x40066000))

#define  PIT0_MCR                    (*(uint32_t *) (0x4002D000))

#define  PIT0_LDVAL0                 (*(uint32_t *) (0x4002D100))

#define  PIT0_CVAL0                  (*(uint32_t *) (0x4002D104))

#define  PIT0_TCTRL0                 (*(uint32_t *) (0x4002D108))

#define  PIT0_TFLG0                  (*(uint32_t *) (0x4002D10C))

#define  PIT0_LDVAL1                 (*(uint32_t *) (0x4002D110))

#define  PIT0_CVAL1                  (*(uint32_t *) (0x4002D114))

#define  PIT0_TCTRL1                 (*(uint32_t *) (0x4002D118))

#define  PIT0_TFLG1                  (*(uint32_t *) (0x4002D11C))

#define  PIT0_LDVAL2                 (*(uint32_t *) (0x4002D120))

#define  PIT0_CVAL2                  (*(uint32_t *) (0x4002D124))

#define  PIT0_TCTRL2                 (*(uint32_t *) (0x4002D128))

#define  PIT0_TFLG2                  (*(uint32_t *) (0x4002D12C))

#define  PIT0_LDVAL3                 (*(uint32_t *) (0x4002D130))

#define  PIT0_CVAL3                  (*(uint32_t *) (0x4002D134))

#define  PIT0_TCTRL3                 (*(uint32_t *) (0x4002D138))

#define  PIT0_TFLG3                  (*(uint32_t *) (0x4002D13C))

#define  PIT1_MCR                    (*(uint32_t *) (0x4002E000))

#define  PIT1_LDVAL0                 (*(uint32_t *) (0x4002E100))

#define  PIT1_CVAL0                  (*(uint32_t *) (0x4002E104))

#define  PIT1_TCTRL0                 (*(uint32_t *) (0x4002E108))

#define  PIT1_TFLG0                  (*(uint32_t *) (0x4002E10C))

