iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  PIT1_LDVAL1                 (*(uint32_t *) (0x4002E110))

#define  PIT1_CVAL1                  (*(uint32_t *) (0x4002E114))

#define  PIT1_TCTRL1                 (*(uint32_t *) (0x4002E118))

#define  PIT1_TFLG1                  (*(uint32_t *) (0x4002E11C))

#define  PIT1_LDVAL2                 (*(uint32_t *) (0x4002E120))

#define  PIT1_CVAL2                  (*(uint32_t *) (0x4002E124))

#define  PIT1_TCTRL2                 (*(uint32_t *) (0x4002E128))

#define  PIT1_TFLG2                  (*(uint32_t *) (0x4002E12C))

#define  PIT1_LDVAL3                 (*(uint32_t *) (0x4002E130))

#define  PIT1_CVAL3                  (*(uint32_t *) (0x4002E134))

#define  PIT1_TCTRL3                 (*(uint32_t *) (0x4002E138))

#define  PIT1_TFLG3                  (*(uint32_t *) (0x4002E13C))

#define  PMC_LVDSC1                  (*(uint8_t *) (0x4007D000))

#define  PMC_LVDSC2                  (*(uint8_t *) (0x4007D001))

#define  PMC_REGSC                   (*(uint8_t *) (0x4007D002))

#define  RCM_SRS0                    (*(uint8_t *) (0x4007B000))

#define  RCM_SRS1                    (*(uint8_t *) (0x4007B001))

#define  RCM_RPFC                    (*(uint8_t *) (0x4007B004))

#define  RCM_RPFW                    (*(uint8_t *) (0x4007B005))

#define  RNG_CR                      (*(uint32_t *) (0x40029000))

#define  RNG_SR                      (*(uint32_t *) (0x40029004))

#define  RNG_ER                      (*(uint32_t *) (0x40029008))

#define  RNG_OR                      (*(uint32_t *) (0x4002900C))

#define  ROM_ENTRY0                  (*(uint32_t *) (0xF0002000))

#define  ROM_ENTRY1                  (*(uint32_t *) (0xF0002004))

#define  ROM_ENTRY2                  (*(uint32_t *) (0xF0002008))

#define  ROM_TABLEMARK               (*(uint32_t *) (0xF000200C))

#define  ROM_PERIPHID4               (*(uint32_t *) (0xF0002FCC))

#define  ROM_SYSACCESS               (*(uint32_t *) (0xF0002FCC))

#define  ROM_PERIPHID5               (*(uint32_t *) (0xF0002FD0))

#define  ROM_PERIPHID6               (*(uint32_t *) (0xF0002FD4))

#define  ROM_PERIPHID7               (*(uint32_t *) (0xF0002FD8))

#define  ROM_PERIPHID0               (*(uint32_t *) (0xF0002FDC))

#define  ROM_PERIPHID1               (*(uint32_t *) (0xF0002FE0))

#define  ROM_PERIPHID2               (*(uint32_t *) (0xF0002FE4))

#define  ROM_PERIPHID3               (*(uint32_t *) (0xF0002FE8))

#define  ROM_COMPID0                 (*(uint32_t *) (0xF0002FF0))

#define  ROM_COMPID1                 (*(uint32_t *) (0xF0002FF4))

#define  ROM_COMPID2                 (*(uint32_t *) (0xF0002FF8))

#define  ROM_COMPID3                 (*(uint32_t *) (0xF0002FFC))

#define  RTC_YEARMON                 (*(uint16_t *) (0x40050000))

#define  RTC_DAYS                    (*(uint16_t *) (0x40050002))

#define  RTC_HOURMIN                 (*(uint16_t *) (0x40050004))

#define  RTC_SECONDS                 (*(uint16_t *) (0x40050006))

#define  RTC_ALM_YEARMON             (*(uint16_t *) (0x40050008))

#define  RTC_ALM_DAYS                (*(uint16_t *) (0x4005000A))

#define  RTC_ALM_HOURMIN             (*(uint16_t *) (0x4005000C))

#define  RTC_ALM_SECONDS             (*(uint16_t *) (0x4005000E))

#define  RTC_CTRL                    (*(uint16_t *) (0x40050010))

#define  RTC_STATUS                  (*(uint16_t *) (0x40050012))

#define  RTC_ISR                     (*(uint16_t *) (0x40050014))

#define  RTC_IER                     (*(uint16_t *) (0x40050016))

#define  RTC_GP_DATA_REG             (*(uint16_t *) (0x40050020))

#define  RTC_DST_HOUR                (*(uint16_t *) (0x40050022))

#define  RTC_DST_MONTH               (*(uint16_t *) (0x40050024))

#define  RTC_DST_DAY                 (*(uint16_t *) (0x40050026))

#define  RTC_COMPEN                  (*(uint16_t *) (0x40050028))

#define  RTC_TAMPER_DIRECTIONAL      (*(uint16_t *) (0x4005002C))

#define  RTC_TAMPER_INT              (*(uint16_t *) (0x4005002E))

#define  RTC_TTSR_YEAR               (*(uint16_t *) (0x40050030))

#define  RTC_FILTER01_CFG            (*(uint16_t *) (0x40050034))

#define  RTC_FILTER23_CFG            (*(uint16_t *) (0x40050036))

#define  RTC_TAMPER_QUEUE            (*(uint16_t *) (0x40050040))

#define  SIM_SOPT1                   (*(uint32_t *) (0x4003F000))

#define  SIM_SOPT1_CFG               (*(uint32_t *) (0x4003F004))

#define  SIM_CTRL_REG                (*(uint32_t *) (0x40040004))

#define  SIM_SOPT3                   (*(uint32_t *) (0x40040008))

#define  SIM_SDID                    (*(uint32_t *) (0x40040024))

#define  SIM_SCGC4                   (*(uint32_t *) (0x40040034))

#define  SIM_SCGC5                   (*(uint32_t *) (0x40040038))

#define  SIM_SCGC6                   (*(uint32_t *) (0x4004003C))

#define  SIM_SCGC7                   (*(uint32_t *) (0x40040040))

#define  SIM_CLKDIV1                 (*(uint32_t *) (0x40040044))

#define  SIM_FCFG1                   (*(uint32_t *) (0x4004004C))

#define  SIM_FCFG2                   (*(uint32_t *) (0x40040050))

#define  SIM_UID0                    (*(uint32_t *) (0x40040054))

#define  SIM_UID1                    (*(uint32_t *) (0x40040058))

#define  SIM_UID2                    (*(uint32_t *) (0x4004005C))

#define  SIM_UID3                    (*(uint32_t *) (0x40040060))

#define  SIM_MISC_CTL                (*(uint32_t *) (0x4004006C))

#define  SIM_ADC_COMP0               (*(uint32_t *) (0x400400C8))

#define  SIM_ADC_COMP1               (*(uint32_t *) (0x400400CC))

#define  SMC_PMPROT                  (*(uint8_t *) (0x4007E000))

#define  SMC_PMCTRL                  (*(uint8_t *) (0x4007E001))

#define  SMC_STOPCTRL                (*(uint8_t *) (0x4007E002))

#define  SMC_PMSTAT                  (*(uint8_t *) (0x4007E003))

#define  SPI0_C1                     (*(uint8_t *) (0x40075000))

#define  SPI0_C2                     (*(uint8_t *) (0x40075001))

#define  SPI0_BR                     (*(uint8_t *) (0x40075002))

#define  SPI0_S                      (*(uint8_t *) (0x40075003))

#define  SPI0_DH                     (*(uint8_t *) (0x40075004))

#define  SPI0_DL                     (*(uint8_t *) (0x40075005))

#define  SPI0_MH                     (*(uint8_t *) (0x40075006))

#define  SPI0_ML                     (*(uint8_t *) (0x40075007))

