iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  SPI0_C3                     (*(uint8_t *) (0x40075008))

#define  SPI0_CI                     (*(uint8_t *) (0x40075009))

#define  SPI1_C1                     (*(uint8_t *) (0x40076000))

#define  SPI1_C2                     (*(uint8_t *) (0x40076001))

#define  SPI1_BR                     (*(uint8_t *) (0x40076002))

#define  SPI1_S                      (*(uint8_t *) (0x40076003))

#define  SPI1_DH                     (*(uint8_t *) (0x40076004))

#define  SPI1_DL                     (*(uint8_t *) (0x40076005))

#define  SPI1_MH                     (*(uint8_t *) (0x40076006))

#define  SPI1_ML                     (*(uint8_t *) (0x40076007))

#define  SPI1_C3                     (*(uint8_t *) (0x40076008))

#define  SPI1_CI                     (*(uint8_t *) (0x40076009))

#define  TMR0_0_COMP1                (*(uint16_t *) (0x40057000))

#define  TMR0_0_COMP2                (*(uint16_t *) (0x40057001))

#define  TMR0_0_CAPT                 (*(uint16_t *) (0x40057002))

#define  TMR0_0_LOAD                 (*(uint16_t *) (0x40057003))

#define  TMR0_0_HOLD                 (*(uint16_t *) (0x40057004))

#define  TMR0_0_CNTR                 (*(uint16_t *) (0x40057005))

#define  TMR0_0_CTRL                 (*(uint16_t *) (0x40057006))

#define  TMR0_0_SCTRL                (*(uint16_t *) (0x40057007))

#define  TMR0_0_CMPLD1               (*(uint16_t *) (0x40057008))

#define  TMR0_0_CMPLD2               (*(uint16_t *) (0x40057009))

#define  TMR0_0_CSCTRL               (*(uint16_t *) (0x4005700A))

#define  TMR0_0_FILT                 (*(uint16_t *) (0x4005700B))

#define  TMR0_0_DMA                  (*(uint16_t *) (0x4005700C))

#define  TMR0_0_ENBL                 (*(uint16_t *) (0x4005700F))

#define  TMR0_1_COMP1                (*(uint16_t *) (0x40057010))

#define  TMR0_1_COMP2                (*(uint16_t *) (0x40057011))

#define  TMR0_1_CAPT                 (*(uint16_t *) (0x40057012))

#define  TMR0_1_LOAD                 (*(uint16_t *) (0x40057013))

#define  TMR0_1_HOLD                 (*(uint16_t *) (0x40057014))

#define  TMR0_1_CNTR                 (*(uint16_t *) (0x40057015))

#define  TMR0_1_CTRL                 (*(uint16_t *) (0x40057016))

#define  TMR0_1_SCTRL                (*(uint16_t *) (0x40057017))

#define  TMR0_1_CMPLD1               (*(uint16_t *) (0x40057018))

#define  TMR0_1_CMPLD2               (*(uint16_t *) (0x40057019))

#define  TMR0_1_CSCTRL               (*(uint16_t *) (0x4005701A))

#define  TMR0_1_FILT                 (*(uint16_t *) (0x4005701B))

#define  TMR0_1_DMA                  (*(uint16_t *) (0x4005701C))

#define  TMR0_2_COMP1                (*(uint16_t *) (0x40057020))

#define  TMR0_2_COMP2                (*(uint16_t *) (0x40057021))

#define  TMR0_2_CAPT                 (*(uint16_t *) (0x40057022))

#define  TMR0_2_LOAD                 (*(uint16_t *) (0x40057023))

#define  TMR0_2_HOLD                 (*(uint16_t *) (0x40057024))

#define  TMR0_2_CNTR                 (*(uint16_t *) (0x40057025))

#define  TMR0_2_CTRL                 (*(uint16_t *) (0x40057026))

#define  TMR0_2_SCTRL                (*(uint16_t *) (0x40057027))

#define  TMR0_2_CMPLD1               (*(uint16_t *) (0x40057028))

#define  TMR0_2_CMPLD2               (*(uint16_t *) (0x40057029))

#define  TMR0_2_CSCTRL               (*(uint16_t *) (0x4005702A))

#define  TMR0_2_FILT                 (*(uint16_t *) (0x4005702B))

#define  TMR0_2_DMA                  (*(uint16_t *) (0x4005702C))

#define  TMR0_3_COMP1                (*(uint16_t *) (0x40057030))

#define  TMR0_3_COMP2                (*(uint16_t *) (0x40057031))

#define  TMR0_3_CAPT                 (*(uint16_t *) (0x40057032))

#define  TMR0_3_LOAD                 (*(uint16_t *) (0x40057033))

#define  TMR0_3_HOLD                 (*(uint16_t *) (0x40057034))

#define  TMR0_3_CNTR                 (*(uint16_t *) (0x40057035))

#define  TMR0_3_CTRL                 (*(uint16_t *) (0x40057036))

#define  TMR0_3_SCTRL                (*(uint16_t *) (0x40057037))

#define  TMR0_3_CMPLD1               (*(uint16_t *) (0x40057038))

#define  TMR0_3_CMPLD2               (*(uint16_t *) (0x40057039))

#define  TMR0_3_CSCTRL               (*(uint16_t *) (0x4005703A))

#define  TMR0_3_FILT                 (*(uint16_t *) (0x4005703B))

#define  TMR0_3_DMA                  (*(uint16_t *) (0x4005703C))

#define  TMR1_0_COMP1                (*(uint16_t *) (0x40058000))

#define  TMR1_0_COMP2                (*(uint16_t *) (0x40058001))

#define  TMR1_0_CAPT                 (*(uint16_t *) (0x40058002))

#define  TMR1_0_LOAD                 (*(uint16_t *) (0x40058003))

#define  TMR1_0_HOLD                 (*(uint16_t *) (0x40058004))

#define  TMR1_0_CNTR                 (*(uint16_t *) (0x40058005))

#define  TMR1_0_CTRL                 (*(uint16_t *) (0x40058006))

#define  TMR1_0_SCTRL                (*(uint16_t *) (0x40058007))

#define  TMR1_0_CMPLD1               (*(uint16_t *) (0x40058008))

#define  TMR1_0_CMPLD2               (*(uint16_t *) (0x40058009))

#define  TMR1_0_CSCTRL               (*(uint16_t *) (0x4005800A))

#define  TMR1_0_FILT                 (*(uint16_t *) (0x4005800B))

#define  TMR1_0_DMA                  (*(uint16_t *) (0x4005800C))

#define  TMR1_0_ENBL                 (*(uint16_t *) (0x4005800F))

#define  TMR1_1_COMP1                (*(uint16_t *) (0x40058010))

#define  TMR1_1_COMP2                (*(uint16_t *) (0x40058011))

#define  TMR1_1_CAPT                 (*(uint16_t *) (0x40058012))

#define  TMR1_1_LOAD                 (*(uint16_t *) (0x40058013))

#define  TMR1_1_HOLD                 (*(uint16_t *) (0x40058014))

#define  TMR1_1_CNTR                 (*(uint16_t *) (0x40058015))

#define  TMR1_1_CTRL                 (*(uint16_t *) (0x40058016))

#define  TMR1_1_SCTRL                (*(uint16_t *) (0x40058017))

#define  TMR1_1_CMPLD1               (*(uint16_t *) (0x40058018))

#define  TMR1_1_CMPLD2               (*(uint16_t *) (0x40058019))

#define  TMR1_1_CSCTRL               (*(uint16_t *) (0x4005801A))

#define  TMR1_1_FILT                 (*(uint16_t *) (0x4005801B))

#define  TMR1_1_DMA                  (*(uint16_t *) (0x4005801C))

#define  TMR1_2_COMP1                (*(uint16_t *) (0x40058020))

#define  TMR1_2_COMP2                (*(uint16_t *) (0x40058021))

#define  TMR1_2_CAPT                 (*(uint16_t *) (0x40058022))

#define  TMR1_2_LOAD                 (*(uint16_t *) (0x40058023))

#define  TMR1_2_HOLD                 (*(uint16_t *) (0x40058024))

