iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  TMR1_2_CNTR                 (*(uint16_t *) (0x40058025))

#define  TMR1_2_CTRL                 (*(uint16_t *) (0x40058026))

#define  TMR1_2_SCTRL                (*(uint16_t *) (0x40058027))

#define  TMR1_2_CMPLD1               (*(uint16_t *) (0x40058028))

#define  TMR1_2_CMPLD2               (*(uint16_t *) (0x40058029))

#define  TMR1_2_CSCTRL               (*(uint16_t *) (0x4005802A))

#define  TMR1_2_FILT                 (*(uint16_t *) (0x4005802B))

#define  TMR1_2_DMA                  (*(uint16_t *) (0x4005802C))

#define  TMR1_3_COMP1                (*(uint16_t *) (0x40058030))

#define  TMR1_3_COMP2                (*(uint16_t *) (0x40058031))

#define  TMR1_3_CAPT                 (*(uint16_t *) (0x40058032))

#define  TMR1_3_LOAD                 (*(uint16_t *) (0x40058033))

#define  TMR1_3_HOLD                 (*(uint16_t *) (0x40058034))

#define  TMR1_3_CNTR                 (*(uint16_t *) (0x40058035))

#define  TMR1_3_CTRL                 (*(uint16_t *) (0x40058036))

#define  TMR1_3_SCTRL                (*(uint16_t *) (0x40058037))

#define  TMR1_3_CMPLD1               (*(uint16_t *) (0x40058038))

#define  TMR1_3_CMPLD2               (*(uint16_t *) (0x40058039))

#define  TMR1_3_CSCTRL               (*(uint16_t *) (0x4005803A))

#define  TMR1_3_FILT                 (*(uint16_t *) (0x4005803B))

#define  TMR1_3_DMA                  (*(uint16_t *) (0x4005803C))

#define  TMR2_0_COMP1                (*(uint16_t *) (0x40059000))

#define  TMR2_0_COMP2                (*(uint16_t *) (0x40059001))

#define  TMR2_0_CAPT                 (*(uint16_t *) (0x40059002))

#define  TMR2_0_LOAD                 (*(uint16_t *) (0x40059003))

#define  TMR2_0_HOLD                 (*(uint16_t *) (0x40059004))

#define  TMR2_0_CNTR                 (*(uint16_t *) (0x40059005))

#define  TMR2_0_CTRL                 (*(uint16_t *) (0x40059006))

#define  TMR2_0_SCTRL                (*(uint16_t *) (0x40059007))

#define  TMR2_0_CMPLD1               (*(uint16_t *) (0x40059008))

#define  TMR2_0_CMPLD2               (*(uint16_t *) (0x40059009))

#define  TMR2_0_CSCTRL               (*(uint16_t *) (0x4005900A))

#define  TMR2_0_FILT                 (*(uint16_t *) (0x4005900B))

#define  TMR2_0_DMA                  (*(uint16_t *) (0x4005900C))

#define  TMR2_0_ENBL                 (*(uint16_t *) (0x4005900F))

#define  TMR2_1_COMP1                (*(uint16_t *) (0x40059010))

#define  TMR2_1_COMP2                (*(uint16_t *) (0x40059011))

#define  TMR2_1_CAPT                 (*(uint16_t *) (0x40059012))

#define  TMR2_1_LOAD                 (*(uint16_t *) (0x40059013))

#define  TMR2_1_HOLD                 (*(uint16_t *) (0x40059014))

#define  TMR2_1_CNTR                 (*(uint16_t *) (0x40059015))

#define  TMR2_1_CTRL                 (*(uint16_t *) (0x40059016))

#define  TMR2_1_SCTRL                (*(uint16_t *) (0x40059017))

#define  TMR2_1_CMPLD1               (*(uint16_t *) (0x40059018))

#define  TMR2_1_CMPLD2               (*(uint16_t *) (0x40059019))

#define  TMR2_1_CSCTRL               (*(uint16_t *) (0x4005901A))

#define  TMR2_1_FILT                 (*(uint16_t *) (0x4005901B))

#define  TMR2_1_DMA                  (*(uint16_t *) (0x4005901C))

#define  TMR2_2_COMP1                (*(uint16_t *) (0x40059020))

#define  TMR2_2_COMP2                (*(uint16_t *) (0x40059021))

#define  TMR2_2_CAPT                 (*(uint16_t *) (0x40059022))

#define  TMR2_2_LOAD                 (*(uint16_t *) (0x40059023))

#define  TMR2_2_HOLD                 (*(uint16_t *) (0x40059024))

#define  TMR2_2_CNTR                 (*(uint16_t *) (0x40059025))

#define  TMR2_2_CTRL                 (*(uint16_t *) (0x40059026))

#define  TMR2_2_SCTRL                (*(uint16_t *) (0x40059027))

#define  TMR2_2_CMPLD1               (*(uint16_t *) (0x40059028))

#define  TMR2_2_CMPLD2               (*(uint16_t *) (0x40059029))

#define  TMR2_2_CSCTRL               (*(uint16_t *) (0x4005902A))

#define  TMR2_2_FILT                 (*(uint16_t *) (0x4005902B))

#define  TMR2_2_DMA                  (*(uint16_t *) (0x4005902C))

#define  TMR2_3_COMP1                (*(uint16_t *) (0x40059030))

#define  TMR2_3_COMP2                (*(uint16_t *) (0x40059031))

#define  TMR2_3_CAPT                 (*(uint16_t *) (0x40059032))

#define  TMR2_3_LOAD                 (*(uint16_t *) (0x40059033))

#define  TMR2_3_HOLD                 (*(uint16_t *) (0x40059034))

#define  TMR2_3_CNTR                 (*(uint16_t *) (0x40059035))

#define  TMR2_3_CTRL                 (*(uint16_t *) (0x40059036))

#define  TMR2_3_SCTRL                (*(uint16_t *) (0x40059037))

#define  TMR2_3_CMPLD1               (*(uint16_t *) (0x40059038))

#define  TMR2_3_CMPLD2               (*(uint16_t *) (0x40059039))

#define  TMR2_3_CSCTRL               (*(uint16_t *) (0x4005903A))

#define  TMR2_3_FILT                 (*(uint16_t *) (0x4005903B))

#define  TMR2_3_DMA                  (*(uint16_t *) (0x4005903C))

#define  TMR3_0_COMP1                (*(uint16_t *) (0x4005A000))

#define  TMR3_0_COMP2                (*(uint16_t *) (0x4005A001))

#define  TMR3_0_CAPT                 (*(uint16_t *) (0x4005A002))

#define  TMR3_0_LOAD                 (*(uint16_t *) (0x4005A003))

#define  TMR3_0_HOLD                 (*(uint16_t *) (0x4005A004))

#define  TMR3_0_CNTR                 (*(uint16_t *) (0x4005A005))

#define  TMR3_0_CTRL                 (*(uint16_t *) (0x4005A006))

#define  TMR3_0_SCTRL                (*(uint16_t *) (0x4005A007))

#define  TMR3_0_CMPLD1               (*(uint16_t *) (0x4005A008))

#define  TMR3_0_CMPLD2               (*(uint16_t *) (0x4005A009))

#define  TMR3_0_CSCTRL               (*(uint16_t *) (0x4005A00A))

#define  TMR3_0_FILT                 (*(uint16_t *) (0x4005A00B))

#define  TMR3_0_DMA                  (*(uint16_t *) (0x4005A00C))

#define  TMR3_0_ENBL                 (*(uint16_t *) (0x4005A00F))

#define  TMR3_1_COMP1                (*(uint16_t *) (0x4005A010))

#define  TMR3_1_COMP2                (*(uint16_t *) (0x4005A011))

#define  TMR3_1_CAPT                 (*(uint16_t *) (0x4005A012))

