iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  TMR3_1_LOAD                 (*(uint16_t *) (0x4005A013))

#define  TMR3_1_HOLD                 (*(uint16_t *) (0x4005A014))

#define  TMR3_1_CNTR                 (*(uint16_t *) (0x4005A015))

#define  TMR3_1_CTRL                 (*(uint16_t *) (0x4005A016))

#define  TMR3_1_SCTRL                (*(uint16_t *) (0x4005A017))

#define  TMR3_1_CMPLD1               (*(uint16_t *) (0x4005A018))

#define  TMR3_1_CMPLD2               (*(uint16_t *) (0x4005A019))

#define  TMR3_1_CSCTRL               (*(uint16_t *) (0x4005A01A))

#define  TMR3_1_FILT                 (*(uint16_t *) (0x4005A01B))

#define  TMR3_1_DMA                  (*(uint16_t *) (0x4005A01C))

#define  TMR3_2_COMP1                (*(uint16_t *) (0x4005A020))

#define  TMR3_2_COMP2                (*(uint16_t *) (0x4005A021))

#define  TMR3_2_CAPT                 (*(uint16_t *) (0x4005A022))

#define  TMR3_2_LOAD                 (*(uint16_t *) (0x4005A023))

#define  TMR3_2_HOLD                 (*(uint16_t *) (0x4005A024))

#define  TMR3_2_CNTR                 (*(uint16_t *) (0x4005A025))

#define  TMR3_2_CTRL                 (*(uint16_t *) (0x4005A026))

#define  TMR3_2_SCTRL                (*(uint16_t *) (0x4005A027))

#define  TMR3_2_CMPLD1               (*(uint16_t *) (0x4005A028))

#define  TMR3_2_CMPLD2               (*(uint16_t *) (0x4005A029))

#define  TMR3_2_CSCTRL               (*(uint16_t *) (0x4005A02A))

#define  TMR3_2_FILT                 (*(uint16_t *) (0x4005A02B))

#define  TMR3_2_DMA                  (*(uint16_t *) (0x4005A02C))

#define  TMR3_3_COMP1                (*(uint16_t *) (0x4005A030))

#define  TMR3_3_COMP2                (*(uint16_t *) (0x4005A031))

#define  TMR3_3_CAPT                 (*(uint16_t *) (0x4005A032))

#define  TMR3_3_LOAD                 (*(uint16_t *) (0x4005A033))

#define  TMR3_3_HOLD                 (*(uint16_t *) (0x4005A034))

#define  TMR3_3_CNTR                 (*(uint16_t *) (0x4005A035))

#define  TMR3_3_CTRL                 (*(uint16_t *) (0x4005A036))

#define  TMR3_3_SCTRL                (*(uint16_t *) (0x4005A037))

#define  TMR3_3_CMPLD1               (*(uint16_t *) (0x4005A038))

#define  TMR3_3_CMPLD2               (*(uint16_t *) (0x4005A039))

#define  TMR3_3_CSCTRL               (*(uint16_t *) (0x4005A03A))

#define  TMR3_3_FILT                 (*(uint16_t *) (0x4005A03B))

#define  TMR3_3_DMA                  (*(uint16_t *) (0x4005A03C))

#define  UART0_BDH                   (*(uint8_t *) (0x4006A000))

#define  UART0_BDL                   (*(uint8_t *) (0x4006A001))

#define  UART0_C1                    (*(uint8_t *) (0x4006A002))

#define  UART0_C2                    (*(uint8_t *) (0x4006A003))

#define  UART0_S1                    (*(uint8_t *) (0x4006A004))

#define  UART0_S2                    (*(uint8_t *) (0x4006A005))

#define  UART0_C3                    (*(uint8_t *) (0x4006A006))

#define  UART0_D                     (*(uint8_t *) (0x4006A007))

#define  UART0_MA1                   (*(uint8_t *) (0x4006A008))

#define  UART0_MA2                   (*(uint8_t *) (0x4006A009))

#define  UART0_C4                    (*(uint8_t *) (0x4006A00A))

#define  UART0_C5                    (*(uint8_t *) (0x4006A00B))

#define  UART0_IR                    (*(uint8_t *) (0x4006A00E))

#define  UART0_C7816                 (*(uint8_t *) (0x4006A018))

#define  UART0_IE7816                (*(uint8_t *) (0x4006A019))

#define  UART0_IS7816                (*(uint8_t *) (0x4006A01A))

#define  UART0_WP7816T0              (*(uint8_t *) (0x4006A01B))

#define  UART0_WP7816T1              (*(uint8_t *) (0x4006A01B))

#define  UART0_WN7816                (*(uint8_t *) (0x4006A01C))

#define  UART0_WF7816                (*(uint8_t *) (0x4006A01D))

#define  UART0_ET7816                (*(uint8_t *) (0x4006A01E))

#define  UART0_TL7816                (*(uint8_t *) (0x4006A01F))

#define  UART0_WB                    (*(uint8_t *) (0x4006A02A))

#define  UART1_BDH                   (*(uint8_t *) (0x4006B000))

#define  UART1_BDL                   (*(uint8_t *) (0x4006B001))

#define  UART1_C1                    (*(uint8_t *) (0x4006B002))

#define  UART1_C2                    (*(uint8_t *) (0x4006B003))

#define  UART1_S1                    (*(uint8_t *) (0x4006B004))

#define  UART1_S2                    (*(uint8_t *) (0x4006B005))

#define  UART1_C3                    (*(uint8_t *) (0x4006B006))

#define  UART1_D                     (*(uint8_t *) (0x4006B007))

#define  UART1_MA1                   (*(uint8_t *) (0x4006B008))

#define  UART1_MA2                   (*(uint8_t *) (0x4006B009))

#define  UART1_C4                    (*(uint8_t *) (0x4006B00A))

#define  UART1_C5                    (*(uint8_t *) (0x4006B00B))

#define  UART1_IR                    (*(uint8_t *) (0x4006B00E))

#define  UART1_C7816                 (*(uint8_t *) (0x4006B018))

#define  UART1_IE7816                (*(uint8_t *) (0x4006B019))

#define  UART1_IS7816                (*(uint8_t *) (0x4006B01A))

#define  UART1_WP7816T0              (*(uint8_t *) (0x4006B01B))

#define  UART1_WP7816T1              (*(uint8_t *) (0x4006B01B))

#define  UART1_WN7816                (*(uint8_t *) (0x4006B01C))

#define  UART1_WF7816                (*(uint8_t *) (0x4006B01D))

#define  UART1_ET7816                (*(uint8_t *) (0x4006B01E))

#define  UART1_TL7816                (*(uint8_t *) (0x4006B01F))

#define  UART1_WB                    (*(uint8_t *) (0x4006B02A))

#define  UART2_BDH                   (*(uint8_t *) (0x4006C000))

#define  UART2_BDL                   (*(uint8_t *) (0x4006C001))

#define  UART2_C1                    (*(uint8_t *) (0x4006C002))

#define  UART2_C2                    (*(uint8_t *) (0x4006C003))

#define  UART2_S1                    (*(uint8_t *) (0x4006C004))

#define  UART2_S2                    (*(uint8_t *) (0x4006C005))

#define  UART2_C3                    (*(uint8_t *) (0x4006C006))

#define  UART2_D                     (*(uint8_t *) (0x4006C007))

#define  UART2_MA1                   (*(uint8_t *) (0x4006C008))

