iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  UART2_MA2                   (*(uint8_t *) (0x4006C009))

#define  UART2_C4                    (*(uint8_t *) (0x4006C00A))

#define  UART2_C5                    (*(uint8_t *) (0x4006C00B))

#define  UART2_IR                    (*(uint8_t *) (0x4006C00E))

#define  UART2_C7816                 (*(uint8_t *) (0x4006C018))

#define  UART2_IE7816                (*(uint8_t *) (0x4006C019))

#define  UART2_IS7816                (*(uint8_t *) (0x4006C01A))

#define  UART2_WP7816T0              (*(uint8_t *) (0x4006C01B))

#define  UART2_WP7816T1              (*(uint8_t *) (0x4006C01B))

#define  UART2_WN7816                (*(uint8_t *) (0x4006C01C))

#define  UART2_WF7816                (*(uint8_t *) (0x4006C01D))

#define  UART2_ET7816                (*(uint8_t *) (0x4006C01E))

#define  UART2_TL7816                (*(uint8_t *) (0x4006C01F))

#define  UART2_WB                    (*(uint8_t *) (0x4006C02A))

#define  UART3_BDH                   (*(uint8_t *) (0x4006D000))

#define  UART3_BDL                   (*(uint8_t *) (0x4006D001))

#define  UART3_C1                    (*(uint8_t *) (0x4006D002))

#define  UART3_C2                    (*(uint8_t *) (0x4006D003))

#define  UART3_S1                    (*(uint8_t *) (0x4006D004))

#define  UART3_S2                    (*(uint8_t *) (0x4006D005))

#define  UART3_C3                    (*(uint8_t *) (0x4006D006))

#define  UART3_D                     (*(uint8_t *) (0x4006D007))

#define  UART3_MA1                   (*(uint8_t *) (0x4006D008))

#define  UART3_MA2                   (*(uint8_t *) (0x4006D009))

#define  UART3_C4                    (*(uint8_t *) (0x4006D00A))

#define  UART3_C5                    (*(uint8_t *) (0x4006D00B))

#define  UART3_IR                    (*(uint8_t *) (0x4006D00E))

#define  UART3_C7816                 (*(uint8_t *) (0x4006D018))

#define  UART3_IE7816                (*(uint8_t *) (0x4006D019))

#define  UART3_IS7816                (*(uint8_t *) (0x4006D01A))

#define  UART3_WP7816T0              (*(uint8_t *) (0x4006D01B))

#define  UART3_WP7816T1              (*(uint8_t *) (0x4006D01B))

#define  UART3_WN7816                (*(uint8_t *) (0x4006D01C))

#define  UART3_WF7816                (*(uint8_t *) (0x4006D01D))

#define  UART3_ET7816                (*(uint8_t *) (0x4006D01E))

#define  UART3_TL7816                (*(uint8_t *) (0x4006D01F))

#define  UART3_WB                    (*(uint8_t *) (0x4006D02A))

#define  VREF_VREFH_TRM              (*(uint8_t *) (0x4006F000))

#define  VREF_VREFH_SC               (*(uint8_t *) (0x4006F001))

#define  VREF_VREFL_TRM              (*(uint8_t *) (0x4006F005))

#define  WDOG_STCTRLH                (*(uint16_t *) (0x40053000))

#define  WDOG_STCTRLL                (*(uint16_t *) (0x40053002))

#define  WDOG_TOVALH                 (*(uint16_t *) (0x40053004))

#define  WDOG_WINH                   (*(uint16_t *) (0x40053008))

#define  WDOG_WINL                   (*(uint16_t *) (0x4005300A))

#define  WDOG_REFRESH                (*(uint16_t *) (0x4005300C))

#define  WDOG_UNLOCK                 (*(uint16_t *) (0x4005300E))

#define  WDOG_TMROUTH                (*(uint16_t *) (0x40053010))

#define  WDOG_TMROUTL                (*(uint16_t *) (0x40053012))

#define  WDOG_RSTCNT                 (*(uint16_t *) (0x40053014))

#define  WDOG_PRESC                  (*(uint16_t *) (0x40053016))

#define  XBAR_SEL0                   (*(uint16_t *) (0x40055000))

#define  XBAR_SEL1                   (*(uint16_t *) (0x40055001))

#define  XBAR_SEL2                   (*(uint16_t *) (0x40055002))

#define  XBAR_SEL3                   (*(uint16_t *) (0x40055003))

#define  XBAR_SEL4                   (*(uint16_t *) (0x40055004))

#define  XBAR_SEL5                   (*(uint16_t *) (0x40055005))

#define  XBAR_SEL6                   (*(uint16_t *) (0x40055006))

#define  XBAR_SEL7                   (*(uint16_t *) (0x40055007))

#define  XBAR_SEL8                   (*(uint16_t *) (0x40055008))

#define  XBAR_SEL9                   (*(uint16_t *) (0x40055009))

#define  XBAR_SEL10                  (*(uint16_t *) (0x4005500A))

#define  XBAR_SEL11                  (*(uint16_t *) (0x4005500B))

#define  XBAR_SEL12                  (*(uint16_t *) (0x4005500C))

#define  XBAR_CTRL0                  (*(uint16_t *) (0x4005500D))

//////////////////////////////////////////////////////////////////////////////////////
// The following section defines the IO register bitfield locations and includes some commentary on the meaning of some settings.
//////////////////////////////////////////////////////////////////////////////////////

#define  ADC_SC1A_ADCH_MASK          0x5u
#define  ADC_SC1A_ADCH_SHIFT         0
#define  ADC_SC1A_ADCH(x)            (((uint32_t)(((uint32_t)(x))<<ADC_SC1A_ADCH_SHIFT))&ADC_SC1A_ADCH_MASK)
//   Input channel select
//     0b00000 ==> When DIFF=0, DADP0 is selected as input; when DIFF=1, DAD0 is selected as input.
//     0b00001 ==> When DIFF=0, DADP1 is selected as input; when DIFF=1, DAD1 is selected as input.
//     0b00010 ==> When DIFF=0, DADP2 is selected as input; when DIFF=1, DAD2 is selected as input.
//     0b00011 ==> When DIFF=0, DADP3 is selected as input; when DIFF=1, DAD3 is selected as input.
//     0b00100 ==> When DIFF=0, AD4 is selected as input; when DIFF=1, it is reserved.
//     0b00101 ==> When DIFF=0, AD5 is selected as input; when DIFF=1, it is reserved.
//     0b00110 ==> When DIFF=0, AD6 is selected as input; when DIFF=1, it is reserved.
//     0b00111 ==> When DIFF=0, AD7 is selected as input; when DIFF=1, it is reserved.
//     0b01000 ==> When DIFF=0, AD8 is selected as input; when DIFF=1, it is reserved.
//     0b01001 ==> When DIFF=0, AD9 is selected as input; when DIFF=1, it is reserved.
//     0b01010 ==> When DIFF=0, AD10 is selected as input; when DIFF=1, it is reserved.
//     0b01011 ==> When DIFF=0, AD11 is selected as input; when DIFF=1, it is reserved.
//     0b01100 ==> When DIFF=0, AD12 is selected as input; when DIFF=1, it is reserved.
//     0b01101 ==> When DIFF=0, AD13 is selected as input; when DIFF=1, it is reserved.
//     0b01110 ==> When DIFF=0, AD14 is selected as input; when DIFF=1, it is reserved.
//     0b01111 ==> When DIFF=0, AD15 is selected as input; when DIFF=1, it is reserved.
//     0b10000 ==> When DIFF=0, AD16 is selected as input; when DIFF=1, it is reserved.
//     0b10001 ==> When DIFF=0, AD17 is selected as input; when DIFF=1, it is reserved.
//     0b10010 ==> When DIFF=0, AD18 is selected as input; when DIFF=1, it is reserved.
//     0b10011 ==> When DIFF=0, AD19 is selected as input; when DIFF=1, it is reserved.
//     0b10100 ==> When DIFF=0, AD20 is selected as input; when DIFF=1, it is reserved.
//     0b10101 ==> When DIFF=0, AD21 is selected as input; when DIFF=1, it is reserved.
//     0b10110 ==> When DIFF=0, AD22 is selected as input; when DIFF=1, it is reserved.
//     0b10111 ==> When DIFF=0, AD23 is selected as input; when DIFF=1, it is reserved.
//     0b11000 ==> Reserved.
//     0b11001 ==> Reserved.
//     0b11010 ==> When DIFF=0, Temp Sensor (single-ended) is selected as input; when DIFF=1, Temp Sensor (differential) is selected as input.
//     0b11011 ==> When DIFF=0, (single-ended) is selected as input; when DIFF=1, (differential) is selected as input.
//     0b11100 ==> Reserved.
//     0b11101 ==> When DIFF=0,VREFSH is selected as input; when DIFF=1, -VREFSH (differential) is selected as input. Voltage reference selected is determined by SC2[REFSEL].
//     0b11110 ==> When DIFF=0,VREFSL is selected as input; when DIFF=1, it is reserved. Voltage reference selected is determined by SC2[REFSEL].
//     0b11111 ==> Module is disabled.

#define  ADC_SC1A_DIFF_MASK          0x20u
#define  ADC_SC1A_DIFF_SHIFT         5
//   Differential Mode Enable
//     0b0 ==> Single-ended conversions and input channels are selected.
//     0b1 ==> Differential conversions and input channels are selected.

#define  ADC_SC1A_AIEN_MASK          0x40u
#define  ADC_SC1A_AIEN_SHIFT         6
//   Interrupt Enable
//     0b0 ==> Conversion complete interrupt is disabled.
//     0b1 ==> Conversion complete interrupt is enabled.

#define  ADC_SC1A_COCO_MASK          0x80u
#define  ADC_SC1A_COCO_SHIFT         7
//   Conversion Complete Flag
//     0b0 ==> Conversion is not completed.
//     0b1 ==> Conversion is completed.

