iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  ADC_SC1B_ADCH_MASK          0x5u
#define  ADC_SC1B_ADCH_SHIFT         0
#define  ADC_SC1B_ADCH(x)            (((uint32_t)(((uint32_t)(x))<<ADC_SC1B_ADCH_SHIFT))&ADC_SC1B_ADCH_MASK)
//   Input channel select
//     0b00000 ==> When DIFF=0, DADP0 is selected as input; when DIFF=1, DAD0 is selected as input.
//     0b00001 ==> When DIFF=0, DADP1 is selected as input; when DIFF=1, DAD1 is selected as input.
//     0b00010 ==> When DIFF=0, DADP2 is selected as input; when DIFF=1, DAD2 is selected as input.
//     0b00011 ==> When DIFF=0, DADP3 is selected as input; when DIFF=1, DAD3 is selected as input.
//     0b00100 ==> When DIFF=0, AD4 is selected as input; when DIFF=1, it is reserved.
//     0b00101 ==> When DIFF=0, AD5 is selected as input; when DIFF=1, it is reserved.
//     0b00110 ==> When DIFF=0, AD6 is selected as input; when DIFF=1, it is reserved.
//     0b00111 ==> When DIFF=0, AD7 is selected as input; when DIFF=1, it is reserved.
//     0b01000 ==> When DIFF=0, AD8 is selected as input; when DIFF=1, it is reserved.
//     0b01001 ==> When DIFF=0, AD9 is selected as input; when DIFF=1, it is reserved.
//     0b01010 ==> When DIFF=0, AD10 is selected as input; when DIFF=1, it is reserved.
//     0b01011 ==> When DIFF=0, AD11 is selected as input; when DIFF=1, it is reserved.
//     0b01100 ==> When DIFF=0, AD12 is selected as input; when DIFF=1, it is reserved.
//     0b01101 ==> When DIFF=0, AD13 is selected as input; when DIFF=1, it is reserved.
//     0b01110 ==> When DIFF=0, AD14 is selected as input; when DIFF=1, it is reserved.
//     0b01111 ==> When DIFF=0, AD15 is selected as input; when DIFF=1, it is reserved.
//     0b10000 ==> When DIFF=0, AD16 is selected as input; when DIFF=1, it is reserved.
//     0b10001 ==> When DIFF=0, AD17 is selected as input; when DIFF=1, it is reserved.
//     0b10010 ==> When DIFF=0, AD18 is selected as input; when DIFF=1, it is reserved.
//     0b10011 ==> When DIFF=0, AD19 is selected as input; when DIFF=1, it is reserved.
//     0b10100 ==> When DIFF=0, AD20 is selected as input; when DIFF=1, it is reserved.
//     0b10101 ==> When DIFF=0, AD21 is selected as input; when DIFF=1, it is reserved.
//     0b10110 ==> When DIFF=0, AD22 is selected as input; when DIFF=1, it is reserved.
//     0b10111 ==> When DIFF=0, AD23 is selected as input; when DIFF=1, it is reserved.
//     0b11000 ==> Reserved.
//     0b11001 ==> Reserved.
//     0b11010 ==> When DIFF=0, Temp Sensor (single-ended) is selected as input; when DIFF=1, Temp Sensor (differential) is selected as input.
//     0b11011 ==> When DIFF=0, (single-ended) is selected as input; when DIFF=1, (differential) is selected as input.
//     0b11100 ==> Reserved.
//     0b11101 ==> When DIFF=0,VREFSH is selected as input; when DIFF=1, -VREFSH (differential) is selected as input. Voltage reference selected is determined by SC2[REFSEL].
//     0b11110 ==> When DIFF=0,VREFSL is selected as input; when DIFF=1, it is reserved. Voltage reference selected is determined by SC2[REFSEL].
//     0b11111 ==> Module is disabled.

#define  ADC_SC1B_DIFF_MASK          0x20u
#define  ADC_SC1B_DIFF_SHIFT         5
//   Differential Mode Enable
//     0b0 ==> Single-ended conversions and input channels are selected.
//     0b1 ==> Differential conversions and input channels are selected.

#define  ADC_SC1B_AIEN_MASK          0x40u
#define  ADC_SC1B_AIEN_SHIFT         6
//   Interrupt Enable
//     0b0 ==> Conversion complete interrupt is disabled.
//     0b1 ==> Conversion complete interrupt is enabled.

#define  ADC_SC1B_COCO_MASK          0x80u
#define  ADC_SC1B_COCO_SHIFT         7
//   Conversion Complete Flag
//     0b0 ==> Conversion is not completed.
//     0b1 ==> Conversion is completed.

#define  ADC_CFG1_ADICLK_MASK        0x2u
#define  ADC_CFG1_ADICLK_SHIFT       0
#define  ADC_CFG1_ADICLK(x)          (((uint32_t)(((uint32_t)(x))<<ADC_CFG1_ADICLK_SHIFT))&ADC_CFG1_ADICLK_MASK)
//   Input Clock Select
//     0b00 ==> Bus clock
//     0b01 ==> (Bus clock)/2
//     0b10 ==> Alternate clock (ALTCLK)
//     0b11 ==> Asynchronous clock (ADACK)

#define  ADC_CFG1_MODE_MASK          0x8u
#define  ADC_CFG1_MODE_SHIFT         2
#define  ADC_CFG1_MODE(x)            (((uint32_t)(((uint32_t)(x))<<ADC_CFG1_MODE_SHIFT))&ADC_CFG1_MODE_MASK)
//   Conversion mode selection
//     0b00 ==> When DIFF=0:It is single-ended 8-bit conversion; when DIFF=1, it is differential 9-bit conversion with 2's complement output.
//     0b01 ==> When DIFF=0:It is single-ended 12-bit conversion ; when DIFF=1, it is differential 13-bit conversion with 2's complement output.
//     0b10 ==> When DIFF=0:It is single-ended 10-bit conversion ; when DIFF=1, it is differential 11-bit conversion with 2's complement output.
//     0b11 ==> When DIFF=0:It is single-ended 16-bit conversion; when DIFF=1, it is differential 16-bit conversion with 2's complement output.

#define  ADC_CFG1_ADLSMP_MASK        0x10u
#define  ADC_CFG1_ADLSMP_SHIFT       4
//   Sample time configuration
//     0b0 ==> Short sample time.
//     0b1 ==> Long sample time.

#define  ADC_CFG1_ADIV_MASK          0x40u
#define  ADC_CFG1_ADIV_SHIFT         5
#define  ADC_CFG1_ADIV(x)            (((uint32_t)(((uint32_t)(x))<<ADC_CFG1_ADIV_SHIFT))&ADC_CFG1_ADIV_MASK)
//   Clock Divide Select
//     0b00 ==> The divide ratio is 1 and the clock rate is input clock.
//     0b01 ==> The divide ratio is 2 and the clock rate is (input clock)/2.
//     0b10 ==> The divide ratio is 4 and the clock rate is (input clock)/4.
//     0b11 ==> The divide ratio is 8 and the clock rate is (input clock)/8.

#define  ADC_CFG1_ADLPC_MASK         0x80u
#define  ADC_CFG1_ADLPC_SHIFT        7
//   Low-Power Configuration
//     0b0 ==> Normal power configuration.
//     0b1 ==> Low-power configuration. The power is reduced at the expense of maximum clock speed.

#define  ADC_CFG2_ADLSTS_MASK        0x2u
#define  ADC_CFG2_ADLSTS_SHIFT       0
#define  ADC_CFG2_ADLSTS(x)          (((uint32_t)(((uint32_t)(x))<<ADC_CFG2_ADLSTS_SHIFT))&ADC_CFG2_ADLSTS_MASK)
//   Long Sample Time Select
//     0b00 ==> Default longest sample time; 20 extra ADCK cycles; 24 ADCK cycles total.
//     0b01 ==> 12 extra ADCK cycles; 16 ADCK cycles total sample time.
//     0b10 ==> 6 extra ADCK cycles; 10 ADCK cycles total sample time.
//     0b11 ==> 2 extra ADCK cycles; 6 ADCK cycles total sample time.

#define  ADC_CFG2_ADHSC_MASK         0x4u
#define  ADC_CFG2_ADHSC_SHIFT        2
//   High-Speed Configuration
//     0b0 ==> Normal conversion sequence selected.
//     0b1 ==> High-speed conversion sequence selected with 2 additional ADCK cycles to total conversion time.

