iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  ADC_CLP0_CLP0_MASK          0x6u
#define  ADC_CLP0_CLP0_SHIFT         0
#define  ADC_CLP0_CLP0(x)            (((uint32_t)(((uint32_t)(x))<<ADC_CLP0_CLP0_SHIFT))&ADC_CLP0_CLP0_MASK)

#define  ADC_PGA_PGAG_MASK           0x40000u
#define  ADC_PGA_PGAG_SHIFT          16
#define  ADC_PGA_PGAG(x)             (((uint32_t)(((uint32_t)(x))<<ADC_PGA_PGAG_SHIFT))&ADC_PGA_PGAG_MASK)
//   PGA Gain Setting
//     0b0000 ==> 1
//     0b0001 ==> 2
//     0b0010 ==> 4
//     0b0011 ==> 8
//     0b0100 ==> 16
//     0b0101 ==> 32
//     0b0110 ==> 64
//     0b0111 ==> Reserved
//     0b1000 ==> Reserved
//     0b1001 ==> Reserved
//     0b1010 ==> Reserved
//     0b1011 ==> Reserved
//     0b1100 ==> Reserved
//     0b1101 ==> Reserved
//     0b1110 ==> Reserved
//     0b1111 ==> Reserved

#define  ADC_PGA_PGALPb_MASK         0x100000u
#define  ADC_PGA_PGALPb_SHIFT        20
//   PGA Low-Power Mode Control
//     0b0 ==> PGA runs in Low-Power mode.
//     0b1 ==> PGA runs in Normal Power mode.

#define  ADC_PGA_PGAEN_MASK          0x800000u
#define  ADC_PGA_PGAEN_SHIFT         23
//   PGA Enable
//     0b0 ==> PGA disabled.
//     0b1 ==> PGA enabled.

#define  ADC_CLMD_CLMD_MASK          0x6u
#define  ADC_CLMD_CLMD_SHIFT         0
#define  ADC_CLMD_CLMD(x)            (((uint32_t)(((uint32_t)(x))<<ADC_CLMD_CLMD_SHIFT))&ADC_CLMD_CLMD_MASK)

#define  ADC_CLMS_CLMS_MASK          0x6u
#define  ADC_CLMS_CLMS_SHIFT         0
#define  ADC_CLMS_CLMS(x)            (((uint32_t)(((uint32_t)(x))<<ADC_CLMS_CLMS_SHIFT))&ADC_CLMS_CLMS_MASK)

#define  ADC_CLM4_CLM4_MASK          0xAu
#define  ADC_CLM4_CLM4_SHIFT         0
#define  ADC_CLM4_CLM4(x)            (((uint32_t)(((uint32_t)(x))<<ADC_CLM4_CLM4_SHIFT))&ADC_CLM4_CLM4_MASK)

#define  ADC_CLM3_CLM3_MASK          0x9u
#define  ADC_CLM3_CLM3_SHIFT         0
#define  ADC_CLM3_CLM3(x)            (((uint32_t)(((uint32_t)(x))<<ADC_CLM3_CLM3_SHIFT))&ADC_CLM3_CLM3_MASK)

#define  ADC_CLM2_CLM2_MASK          0x8u
#define  ADC_CLM2_CLM2_SHIFT         0
#define  ADC_CLM2_CLM2(x)            (((uint32_t)(((uint32_t)(x))<<ADC_CLM2_CLM2_SHIFT))&ADC_CLM2_CLM2_MASK)

#define  ADC_CLM1_CLM1_MASK          0x7u
#define  ADC_CLM1_CLM1_SHIFT         0
#define  ADC_CLM1_CLM1(x)            (((uint32_t)(((uint32_t)(x))<<ADC_CLM1_CLM1_SHIFT))&ADC_CLM1_CLM1_MASK)

#define  ADC_CLM0_CLM0_MASK          0x6u
#define  ADC_CLM0_CLM0_SHIFT         0
#define  ADC_CLM0_CLM0(x)            (((uint32_t)(((uint32_t)(x))<<ADC_CLM0_CLM0_SHIFT))&ADC_CLM0_CLM0_MASK)

#define  AFE_CH1_CFR_HW_TRG_MASK     0x200u
#define  AFE_CH1_CFR_HW_TRG_SHIFT    9
//   Hardware Trigger Select
//     0b0 ==> = Software trigger select
//     0b1 ==> = Hardware trigger select

#define  AFE_CH1_CFR_DEC_CLK_INP_SEL_MASK 0x400u
#define  AFE_CH1_CFR_DEC_CLK_INP_SEL_SHIFT 10
//   Decimator Clock Input Select
//     0b0 ==> = On the chip modulator clock will be used
//     0b1 ==> = External clock will be used.

#define  AFE_CH1_CFR_DEC_CLK_EDGE_SEL_MASK 0x800u
#define  AFE_CH1_CFR_DEC_CLK_EDGE_SEL_SHIFT 11
//   Decimator Clock Edge Select
//     0b0 ==> = Posedge will be used.
//     0b1 ==> = Negedge will be used.

#define  AFE_CH1_CFR_CC_MASK         0x1000u
#define  AFE_CH1_CFR_CC_SHIFT        12
//   Continuous Conversion/Single Conversion Mode Select
//     0b0 ==> = One conversion following a triggering event
//     0b1 ==> = Continuous conversions following a triggering event.

#define  AFE_CH1_CFR_DEC_EN_MASK     0x2000u
#define  AFE_CH1_CFR_DEC_EN_SHIFT    13
//   Decimation Filter enable
//     0b0 ==> = Decimation filter is disabled.
//     0b1 ==> = Decimation filter is enabled.

#define  AFE_CH1_CFR_SD_MOD_EN_MASK  0x4000u
#define  AFE_CH1_CFR_SD_MOD_EN_SHIFT 14
//   Sigma Delta Modulator enable
//     0b0 ==> = SD ADC1 is disabled
//     0b1 ==> = SD ADC1 is enabled

#define  AFE_CH1_CFR_BYP_MODE_MASK   0x20000u
#define  AFE_CH1_CFR_BYP_MODE_SHIFT  17
//   AFE Channel1 bypass mode
//     0b0 ==> = Normal mode
//     0b1 ==> = Bypass mode where ADC and PGA of channel1 are disabled.

#define  AFE_CH1_CFR_PGA_GAIN_SEL_MASK 0x180000u
#define  AFE_CH1_CFR_PGA_GAIN_SEL_SHIFT 19
#define  AFE_CH1_CFR_PGA_GAIN_SEL(x) (((uint32_t)(((uint32_t)(x))<<AFE_CH1_CFR_PGA_GAIN_SEL_SHIFT))&AFE_CH1_CFR_PGA_GAIN_SEL_MASK)
//   PGA Gain Select
//     0b000 ==> = reserved
//     0b001 ==> = 1x (default)
//     0b010 ==> = 2x
//     0b011 ==> = 4x
//     0b100 ==> = 8x
//     0b101 ==> = 16x
//     0b110 ==> = 32x
//     0b111 ==> = reserved

#define  AFE_CH1_CFR_PGA_EN_MASK     0x1000000u
#define  AFE_CH1_CFR_PGA_EN_SHIFT    24
//   PGA enable
//     0b0 ==> = PGA disabled
//     0b1 ==> = PGA enabled

#define  AFE_CH1_CFR_DEC_OSR_MASK    0x60000000u
#define  AFE_CH1_CFR_DEC_OSR_SHIFT   29
#define  AFE_CH1_CFR_DEC_OSR(x)      (((uint32_t)(((uint32_t)(x))<<AFE_CH1_CFR_DEC_OSR_SHIFT))&AFE_CH1_CFR_DEC_OSR_MASK)
//   Decimator OverSampling Ratio select
//     0b000 ==> = 64
//     0b001 ==> = 128
//     0b010 ==> = 256
//     0b011 ==> = 512
//     0b100 ==> = 1024
//     0b101 ==> = 2048

#define  AFE_CH2_CFR_HW_TRG_MASK     0x200u
#define  AFE_CH2_CFR_HW_TRG_SHIFT    9
//   Hardware Trigger Select
//     0b0 ==> = Software trigger select
//     0b1 ==> = Hardware trigger select

#define  AFE_CH2_CFR_DEC_CLK_INP_SEL_MASK 0x400u
#define  AFE_CH2_CFR_DEC_CLK_INP_SEL_SHIFT 10
//   Decimator Clock Input Select
//     0b0 ==> = On the chip modulator clock will be used
//     0b1 ==> = External clock will be used.

#define  AFE_CH2_CFR_DEC_CLK_EDGE_SEL_MASK 0x800u
#define  AFE_CH2_CFR_DEC_CLK_EDGE_SEL_SHIFT 11
//   Decimator Clock Edge Select
//     0b0 ==> = Posedge will be used.
//     0b1 ==> = Negedge will be used.

#define  AFE_CH2_CFR_CC_MASK         0x1000u
#define  AFE_CH2_CFR_CC_SHIFT        12
//   Continuous Conversion/Single Conversion Mode Select
//     0b0 ==> = One conversion following a triggering event
//     0b1 ==> = Continuous conversions following a triggering event.

#define  AFE_CH2_CFR_DEC_EN_MASK     0x2000u
#define  AFE_CH2_CFR_DEC_EN_SHIFT    13
//   Decimation Filter enable
//     0b0 ==> = Decimation filter is disabled.
//     0b1 ==> = Decimation filter is enabled.

