iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  AFE_CH2_CFR_SD_MOD_EN_MASK  0x4000u
#define  AFE_CH2_CFR_SD_MOD_EN_SHIFT 14
//   Sigma Delta Modulator enable
//     0b0 ==> = SD ADC1 is disabled
//     0b1 ==> = SD ADC1 is enabled

#define  AFE_CH2_CFR_BYP_MODE_MASK   0x20000u
#define  AFE_CH2_CFR_BYP_MODE_SHIFT  17
//   AFE Channel1 bypass mode
//     0b0 ==> = Normal mode
//     0b1 ==> = Bypass mode where ADC and PGA of channel1 are disabled.

#define  AFE_CH2_CFR_PGA_GAIN_SEL_MASK 0x180000u
#define  AFE_CH2_CFR_PGA_GAIN_SEL_SHIFT 19
#define  AFE_CH2_CFR_PGA_GAIN_SEL(x) (((uint32_t)(((uint32_t)(x))<<AFE_CH2_CFR_PGA_GAIN_SEL_SHIFT))&AFE_CH2_CFR_PGA_GAIN_SEL_MASK)
//   PGA Gain Select
//     0b000 ==> = reserved
//     0b001 ==> = 1x (default)
//     0b010 ==> = 2x
//     0b011 ==> = 4x
//     0b100 ==> = 8x
//     0b101 ==> = 16x
//     0b110 ==> = 32x
//     0b111 ==> = reserved

#define  AFE_CH2_CFR_PGA_EN_MASK     0x1000000u
#define  AFE_CH2_CFR_PGA_EN_SHIFT    24
//   PGA enable
//     0b0 ==> = PGA disabled
//     0b1 ==> = PGA enabled

#define  AFE_CH2_CFR_DEC_OSR_MASK    0x60000000u
#define  AFE_CH2_CFR_DEC_OSR_SHIFT   29
#define  AFE_CH2_CFR_DEC_OSR(x)      (((uint32_t)(((uint32_t)(x))<<AFE_CH2_CFR_DEC_OSR_SHIFT))&AFE_CH2_CFR_DEC_OSR_MASK)
//   Decimator OverSampling Ratio select
//     0b000 ==> = 64
//     0b001 ==> = 128
//     0b010 ==> = 256
//     0b011 ==> = 512
//     0b100 ==> = 1024
//     0b101 ==> = 2048

#define  AFE_CH3_CFR_HW_TRG_MASK     0x200u
#define  AFE_CH3_CFR_HW_TRG_SHIFT    9
//   Hardware Trigger Select
//     0b0 ==> = Software trigger select
//     0b1 ==> = Hardware trigger select

#define  AFE_CH3_CFR_DEC_CLK_INP_SEL_MASK 0x400u
#define  AFE_CH3_CFR_DEC_CLK_INP_SEL_SHIFT 10
//   Decimator Clock Input Select
//     0b0 ==> = On the chip modulator clock will be used.
//     0b1 ==> = External clock will be used.

#define  AFE_CH3_CFR_DEC_CLK_EDGE_SEL_MASK 0x800u
#define  AFE_CH3_CFR_DEC_CLK_EDGE_SEL_SHIFT 11
//   Decimator Clock Edge Select
//     0b0 ==> = Posedge will be used.
//     0b1 ==> = Negedge will be used.

#define  AFE_CH3_CFR_CC_MASK         0x1000u
#define  AFE_CH3_CFR_CC_SHIFT        12
//   Continuous Conversion/Single Conversion Mode Select
//     0b0 ==> = One conversion following a triggering event
//     0b1 ==> = Continuous conversions following a triggering event.

#define  AFE_CH3_CFR_DEC_EN_MASK     0x2000u
#define  AFE_CH3_CFR_DEC_EN_SHIFT    13
//   Decimation Filter enable
//     0b0 ==> = Decimation filter is disabled.
//     0b1 ==> = Decimation filter is enabled.

#define  AFE_CH3_CFR_SD_MOD_EN_MASK  0x4000u
#define  AFE_CH3_CFR_SD_MOD_EN_SHIFT 14
//   Sigma Delta Modulator enable
//     0b0 ==> = SD ADC3 is disabled
//     0b1 ==> = SD ADC3 is enabled

#define  AFE_CH3_CFR_BYP_MODE_MASK   0x20000u
#define  AFE_CH3_CFR_BYP_MODE_SHIFT  17
//   AFE Channel3 bypass mode
//     0b0 ==> = Normal mode
//     0b1 ==> = Bypass mode where ADC and PGA of channel3 are disabled.

#define  AFE_CH3_CFR_DEC_OSR_MASK    0x60000000u
#define  AFE_CH3_CFR_DEC_OSR_SHIFT   29
#define  AFE_CH3_CFR_DEC_OSR(x)      (((uint32_t)(((uint32_t)(x))<<AFE_CH3_CFR_DEC_OSR_SHIFT))&AFE_CH3_CFR_DEC_OSR_MASK)
//   Decimator OverSampling Ratio select
//     0b000 ==> =64
//     0b001 ==> =128
//     0b010 ==> =256
//     0b011 ==> =512
//     0b100 ==> =1024
//     0b101 ==> =2048

#define  AFE_CH4_CFR_HW_TRG_MASK     0x200u
#define  AFE_CH4_CFR_HW_TRG_SHIFT    9
//   Hardware Trigger Select
//     0b0 ==> = Software trigger select
//     0b1 ==> = Hardware trigger select

#define  AFE_CH4_CFR_DEC_CLK_INP_SEL_MASK 0x400u
#define  AFE_CH4_CFR_DEC_CLK_INP_SEL_SHIFT 10
//   Decimator Clock Input Select
//     0b0 ==> = On the chip modulator clock will be used.
//     0b1 ==> = External clock will be used.

#define  AFE_CH4_CFR_DEC_CLK_EDGE_SEL_MASK 0x800u
#define  AFE_CH4_CFR_DEC_CLK_EDGE_SEL_SHIFT 11
//   Decimator Clock Edge Select
//     0b0 ==> = Posedge will be used.
//     0b1 ==> = Negedge will be used.

#define  AFE_CH4_CFR_CC_MASK         0x1000u
#define  AFE_CH4_CFR_CC_SHIFT        12
//   Continuous Conversion/Single Conversion Mode Select
//     0b0 ==> = One conversion following a triggering event
//     0b1 ==> = Continuous conversions following a triggering event.

#define  AFE_CH4_CFR_DEC_EN_MASK     0x2000u
#define  AFE_CH4_CFR_DEC_EN_SHIFT    13
//   Decimation Filter enable
//     0b0 ==> = Decimation filter is disabled.
//     0b1 ==> = Decimation filter is enabled.

#define  AFE_CH4_CFR_SD_MOD_EN_MASK  0x4000u
#define  AFE_CH4_CFR_SD_MOD_EN_SHIFT 14
//   Sigma Delta Modulator enable
//     0b0 ==> = SD ADC3 is disabled
//     0b1 ==> = SD ADC3 is enabled

#define  AFE_CH4_CFR_BYP_MODE_MASK   0x20000u
#define  AFE_CH4_CFR_BYP_MODE_SHIFT  17
//   AFE Channel3 bypass mode
//     0b0 ==> = Normal mode
//     0b1 ==> = Bypass mode where ADC and PGA of channel3 are disabled.

#define  AFE_CH4_CFR_DEC_OSR_MASK    0x60000000u
#define  AFE_CH4_CFR_DEC_OSR_SHIFT   29
#define  AFE_CH4_CFR_DEC_OSR(x)      (((uint32_t)(((uint32_t)(x))<<AFE_CH4_CFR_DEC_OSR_SHIFT))&AFE_CH4_CFR_DEC_OSR_MASK)
//   Decimator OverSampling Ratio select
//     0b000 ==> =64
//     0b001 ==> =128
//     0b010 ==> =256
//     0b011 ==> =512
//     0b100 ==> =1024
//     0b101 ==> =2048

#define  AFE_CR_STRTUP_CNT_MASK      0xE00u
#define  AFE_CR_STRTUP_CNT_SHIFT     9
#define  AFE_CR_STRTUP_CNT(x)        (((uint32_t)(((uint32_t)(x))<<AFE_CR_STRTUP_CNT_SHIFT))&AFE_CR_STRTUP_CNT_MASK)
//   Start up count

#define  AFE_CR_RESULT_FORMAT_MASK   0x40000u
#define  AFE_CR_RESULT_FORMAT_SHIFT  18
//   Result Format
//     0b0 ==> = Left justified 2's complement 32-bit : SVVVVVVVVVVVVVVVVVVVVVVV00000000 where (S= sign bit , V=valid result value, 0=zero)
//     0b1 ==> = Right justified 2's complement 32-bit : SSSSSSSSSVVVVVVVVVVVVVVVVVVVVVVV where (S= sign bit , V= valid result value, 0= zero)

#define  AFE_CR_DLY_OK_MASK          0x200000u
#define  AFE_CR_DLY_OK_SHIFT         21
//   Delay OK

#define  AFE_CR_RST_B_MASK           0x400000u
#define  AFE_CR_RST_B_SHIFT          22
//   Software Reset
//     0b0 ==> = All ADCs, PGAs and Decimation filters are disabled. Clock Configuration bits will be reset.
//     0b1 ==> .= All ADCs, PGAs and Decimation filters are enabled.

