iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  AFE_CR_LPM_EN_MASK          0x2000000u
#define  AFE_CR_LPM_EN_SHIFT         25
//   Low power Mode enable
//     0b0 ==> = AFE will be in normal mode
//     0b1 ==> = AFE will be in low power mode. Setting this bit reduce the current consumption of ADC and Buffer Amplifier , the max modulator clock frequency is below 1Mhz.

#define  AFE_CR_SOFT_TRG4_MASK       0x8000000u
#define  AFE_CR_SOFT_TRG4_SHIFT      27
//   Software Trigger4

#define  AFE_CR_SOFT_TRG3_MASK       0x10000000u
#define  AFE_CR_SOFT_TRG3_SHIFT      28
//   Software Trigger3

#define  AFE_CR_SOFT_TRG2_MASK       0x20000000u
#define  AFE_CR_SOFT_TRG2_SHIFT      29
//   Software Trigger2

#define  AFE_CR_SOFT_TRG1_MASK       0x40000000u
#define  AFE_CR_SOFT_TRG1_SHIFT      30
//   Software Trigger1

#define  AFE_CR_MSTR_EN_MASK         0x80000000u
#define  AFE_CR_MSTR_EN_SHIFT        31
//   AFE Master Enable
//     0b0 ==> = All ADCs are disabled.
//     0b1 ==> = All ADCs and filters will get simultaneously enabled .

#define  AFE_CKR_CLS_MASK            0x400000u
#define  AFE_CKR_CLS_SHIFT           21
#define  AFE_CKR_CLS(x)              (((uint32_t)(((uint32_t)(x))<<AFE_CKR_CLS_SHIFT))&AFE_CKR_CLS_MASK)
//   Clock Source Select
//     0b00 ==> = mod_clk0
//     0b01 ==> = mod_clk1
//     0b10 ==> = mod_clk2
//     0b11 ==> = mod_clk3

#define  AFE_CKR_DIV_MASK            0x40000000u
#define  AFE_CKR_DIV_SHIFT           28
#define  AFE_CKR_DIV(x)              (((uint32_t)(((uint32_t)(x))<<AFE_CKR_DIV_SHIFT))&AFE_CKR_DIV_MASK)
//   Clock Divider Select
//     0b0000 ==> = divide by 1
//     0b0001 ==> = divide by 2 (default)
//     0b0010 ==> = divide by 4
//     0b0011 ==> = divide by 8
//     0b0100 ==> = divide by 16
//     0b0101 ==> = divide by 32
//     0b0110 ==> = divide by 64
//     0b0111 ==> = divide by 128
//     0b1xxx ==> = divide by 256

#define  AFE_DI_INTEN4_MASK          0x800000u
#define  AFE_DI_INTEN4_SHIFT         23
//   Interrupt Enable 4

#define  AFE_DI_INTEN3_MASK          0x1000000u
#define  AFE_DI_INTEN3_SHIFT         24
//   Interrupt Enable 3

#define  AFE_DI_INTEN2_MASK          0x2000000u
#define  AFE_DI_INTEN2_SHIFT         25
//   Interrupt Enable 2

#define  AFE_DI_INTEN1_MASK          0x4000000u
#define  AFE_DI_INTEN1_SHIFT         26
//   Interrupt Enable 1

#define  AFE_DI_DMA_EN4_MASK         0x10000000u
#define  AFE_DI_DMA_EN4_SHIFT        28
//   DMA Enable4

#define  AFE_DI_DMA_EN3_MASK         0x20000000u
#define  AFE_DI_DMA_EN3_SHIFT        29
//   DMA Enable3

#define  AFE_DI_DMA_EN2_MASK         0x40000000u
#define  AFE_DI_DMA_EN2_SHIFT        30
//   DMA Enable2

#define  AFE_DI_DMA_EN1_MASK         0x80000000u
#define  AFE_DI_DMA_EN1_SHIFT        31
//   DMA Enable1

#define  AFE_CH1_DR_DLY_MASK         0xBu
#define  AFE_CH1_DR_DLY_SHIFT        0
#define  AFE_CH1_DR_DLY(x)           (((uint32_t)(((uint32_t)(x))<<AFE_CH1_DR_DLY_SHIFT))&AFE_CH1_DR_DLY_MASK)
//   Delay

#define  AFE_CH2_DR_DLY_MASK         0xBu
#define  AFE_CH2_DR_DLY_SHIFT        0
#define  AFE_CH2_DR_DLY(x)           (((uint32_t)(((uint32_t)(x))<<AFE_CH2_DR_DLY_SHIFT))&AFE_CH2_DR_DLY_MASK)
//   Delay

#define  AFE_CH3_DR_DLY_MASK         0xBu
#define  AFE_CH3_DR_DLY_SHIFT        0
#define  AFE_CH3_DR_DLY(x)           (((uint32_t)(((uint32_t)(x))<<AFE_CH3_DR_DLY_SHIFT))&AFE_CH3_DR_DLY_MASK)
//   Delay

#define  AFE_CH4_DR_DLY_MASK         0xBu
#define  AFE_CH4_DR_DLY_SHIFT        0
#define  AFE_CH4_DR_DLY(x)           (((uint32_t)(((uint32_t)(x))<<AFE_CH4_DR_DLY_SHIFT))&AFE_CH4_DR_DLY_MASK)
//   Delay

#define  AFE_CH1_RR_SDR_MASK         0x17u
#define  AFE_CH1_RR_SDR_SHIFT        0
#define  AFE_CH1_RR_SDR(x)           (((uint32_t)(((uint32_t)(x))<<AFE_CH1_RR_SDR_SHIFT))&AFE_CH1_RR_SDR_MASK)
//   Sample Data Result

#define  AFE_CH1_RR_SIGN_BITS_MASK   0x4800000u
#define  AFE_CH1_RR_SIGN_BITS_SHIFT  23
#define  AFE_CH1_RR_SIGN_BITS(x)     (((uint32_t)(((uint32_t)(x))<<AFE_CH1_RR_SIGN_BITS_SHIFT))&AFE_CH1_RR_SIGN_BITS_MASK)
//   Sign Bits

#define  AFE_CH2_RR_SDR_MASK         0x17u
#define  AFE_CH2_RR_SDR_SHIFT        0
#define  AFE_CH2_RR_SDR(x)           (((uint32_t)(((uint32_t)(x))<<AFE_CH2_RR_SDR_SHIFT))&AFE_CH2_RR_SDR_MASK)
//   Sample Data Result

#define  AFE_CH2_RR_SIGN_BITS_MASK   0x4800000u
#define  AFE_CH2_RR_SIGN_BITS_SHIFT  23
#define  AFE_CH2_RR_SIGN_BITS(x)     (((uint32_t)(((uint32_t)(x))<<AFE_CH2_RR_SIGN_BITS_SHIFT))&AFE_CH2_RR_SIGN_BITS_MASK)
//   Sign Bits

#define  AFE_CH3_RR_SDR_MASK         0x17u
#define  AFE_CH3_RR_SDR_SHIFT        0
#define  AFE_CH3_RR_SDR(x)           (((uint32_t)(((uint32_t)(x))<<AFE_CH3_RR_SDR_SHIFT))&AFE_CH3_RR_SDR_MASK)
//   Sample Data result

#define  AFE_CH3_RR_SIGN_BITS_MASK   0x4800000u
#define  AFE_CH3_RR_SIGN_BITS_SHIFT  23
#define  AFE_CH3_RR_SIGN_BITS(x)     (((uint32_t)(((uint32_t)(x))<<AFE_CH3_RR_SIGN_BITS_SHIFT))&AFE_CH3_RR_SIGN_BITS_MASK)
//   Sign Bits

#define  AFE_CH4_RR_SDR_MASK         0x17u
#define  AFE_CH4_RR_SDR_SHIFT        0
#define  AFE_CH4_RR_SDR(x)           (((uint32_t)(((uint32_t)(x))<<AFE_CH4_RR_SDR_SHIFT))&AFE_CH4_RR_SDR_MASK)
//   Sample Data result

#define  AFE_CH4_RR_SIGN_BITS_MASK   0x4800000u
#define  AFE_CH4_RR_SIGN_BITS_SHIFT  23
#define  AFE_CH4_RR_SIGN_BITS(x)     (((uint32_t)(((uint32_t)(x))<<AFE_CH4_RR_SIGN_BITS_SHIFT))&AFE_CH4_RR_SIGN_BITS_MASK)
//   Sign Bits

#define  AFE_SR_RDY4_MASK            0x4000u
#define  AFE_SR_RDY4_SHIFT           14
//   AFE Ready4
//     0b0 ==> AFE Channel 4 is disabled or has not completed its start up period
//     0b1 ==> AFE Channel 4 is ready to initiate conversions.

#define  AFE_SR_RDY3_MASK            0x8000u
#define  AFE_SR_RDY3_SHIFT           15
//   AFE Ready3
//     0b0 ==> AFE Channel 3 is disabled or has not completed its start up period
//     0b1 ==> AFE Channel 3 is ready to initiate conversions.

#define  AFE_SR_RDY2_MASK            0x10000u
#define  AFE_SR_RDY2_SHIFT           16
//   AFE Ready2
//     0b0 ==> AFE Channel 2 is disabled or has not completed its start up period
//     0b1 ==> AFE Channel 2 is ready to initiate conversions.

#define  AFE_SR_RDY1_MASK            0x20000u
#define  AFE_SR_RDY1_SHIFT           17
//   AFE Ready1
//     0b0 ==> AFE Channel 1 is disabled or has not completed its start up period
//     0b1 ==> AFE Channel 1 is ready to initiate conversions.

#define  AFE_SR_OVR4_MASK            0x200000u
#define  AFE_SR_OVR4_SHIFT           21
//   Overflow Flag

#define  AFE_SR_OVR3_MASK            0x400000u
#define  AFE_SR_OVR3_SHIFT           22
//   Overflow Flag

#define  AFE_SR_OVR2_MASK            0x800000u
#define  AFE_SR_OVR2_SHIFT           23
//   Overflow Flag

