iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  AIPS_PACRD_WP6_MASK         0x20u
#define  AIPS_PACRD_WP6_SHIFT        5
//   Write Protect
//     0b0 ==> This peripheral allows write accesses.
//     0b1 ==> This peripheral is write protected.

#define  AIPS_PACRD_SP6_MASK         0x40u
#define  AIPS_PACRD_SP6_SHIFT        6
//   Supervisor Protect
//     0b0 ==> This peripheral does not require supervisor privilege level for accesses.
//     0b1 ==> This peripheral requires supervisor privilege level for accesses.

#define  AIPS_PACRD_TP5_MASK         0x100u
#define  AIPS_PACRD_TP5_SHIFT        8
//   Trusted Protect
//     0b0 ==> Accesses from an untrusted master are allowed.
//     0b1 ==> Accesses from an untrusted master are not allowed.

#define  AIPS_PACRD_WP5_MASK         0x200u
#define  AIPS_PACRD_WP5_SHIFT        9
//   Write Protect
//     0b0 ==> This peripheral allows write accesses.
//     0b1 ==> This peripheral is write protected.

#define  AIPS_PACRD_SP5_MASK         0x400u
#define  AIPS_PACRD_SP5_SHIFT        10
//   Supervisor Protect
//     0b0 ==> This peripheral does not require supervisor privilege level for accesses.
//     0b1 ==> This peripheral requires supervisor privilege level for accesses.

#define  AIPS_PACRD_TP4_MASK         0x1000u
#define  AIPS_PACRD_TP4_SHIFT        12
//   Trusted protect
//     0b0 ==> Accesses from an untrusted master are allowed.
//     0b1 ==> Accesses from an untrusted master are not allowed.

#define  AIPS_PACRD_WP4_MASK         0x2000u
#define  AIPS_PACRD_WP4_SHIFT        13
//   Write protect
//     0b0 ==> This peripheral allows write accesses.
//     0b1 ==> This peripheral is write protected.

#define  AIPS_PACRD_SP4_MASK         0x4000u
#define  AIPS_PACRD_SP4_SHIFT        14
//   Supervisor Protect
//     0b0 ==> This peripheral does not require supervisor privilege level for accesses.
//     0b1 ==> This peripheral requires supervisor privilege level for accesses.

#define  AIPS_PACRD_TP3_MASK         0x10000u
#define  AIPS_PACRD_TP3_SHIFT        16
//   Trusted protect
//     0b0 ==> Accesses from an untrusted master are allowed.
//     0b1 ==> Accesses from an untrusted master are not allowed.

#define  AIPS_PACRD_WP3_MASK         0x20000u
#define  AIPS_PACRD_WP3_SHIFT        17
//   Write Protect
//     0b0 ==> This peripheral allows write accesses.
//     0b1 ==> This peripheral is write protected.

#define  AIPS_PACRD_SP3_MASK         0x40000u
#define  AIPS_PACRD_SP3_SHIFT        18
//   Supervisor protect
//     0b0 ==> This peripheral does not require supervisor privilege level for accesses.
//     0b1 ==> This peripheral requires supervisor privilege level for accesses.

#define  AIPS_PACRD_TP2_MASK         0x100000u
#define  AIPS_PACRD_TP2_SHIFT        20
//   Trusted Protect
//     0b0 ==> Accesses from an untrusted master are allowed.
//     0b1 ==> Accesses from an untrusted master are not allowed.

#define  AIPS_PACRD_WP2_MASK         0x200000u
#define  AIPS_PACRD_WP2_SHIFT        21
//   Write protect
//     0b0 ==> This peripheral allows write accesses.
//     0b1 ==> This peripheral is write protected.

#define  AIPS_PACRD_SP2_MASK         0x400000u
#define  AIPS_PACRD_SP2_SHIFT        22
//   Supervisor Protect
//     0b0 ==> This peripheral does not require supervisor privilege level for accesses.
//     0b1 ==> This peripheral requires supervisor privilege level for accesses.

#define  AIPS_PACRD_TP1_MASK         0x1000000u
#define  AIPS_PACRD_TP1_SHIFT        24
//   Trusted protect
//     0b0 ==> Accesses from an untrusted master are allowed.
//     0b1 ==> Accesses from an untrusted master are not allowed.

#define  AIPS_PACRD_WP1_MASK         0x2000000u
#define  AIPS_PACRD_WP1_SHIFT        25
//   Write Protect
//     0b0 ==> This peripheral allows write accesses.
//     0b1 ==> This peripheral is write protected.

#define  AIPS_PACRD_SP1_MASK         0x4000000u
#define  AIPS_PACRD_SP1_SHIFT        26
//   Supervisor Protect
//     0b0 ==> This peripheral does not require supervisor privilege level for accesses.
//     0b1 ==> This peripheral requires supervisor privilege level for accesses.

#define  AIPS_PACRD_TP0_MASK         0x10000000u
#define  AIPS_PACRD_TP0_SHIFT        28
//   Trusted Protect
//     0b0 ==> Accesses from an untrusted master are allowed.
//     0b1 ==> Accesses from an untrusted master are not allowed.

#define  AIPS_PACRD_WP0_MASK         0x20000000u
#define  AIPS_PACRD_WP0_SHIFT        29
//   Write protect
//     0b0 ==> This peripheral allows write accesses.
//     0b1 ==> This peripheral is write protected.

#define  AIPS_PACRD_SP0_MASK         0x40000000u
#define  AIPS_PACRD_SP0_SHIFT        30
//   Supervisor Protect
//     0b0 ==> This peripheral does not require supervisor privilege level for accesses.
//     0b1 ==> This peripheral requires supervisor privilege level for accesses.

#define  AIPS_PACRE_TP7_MASK         0x1u
#define  AIPS_PACRE_TP7_SHIFT        0
//   Trusted Protect
//     0b0 ==> Accesses from an untrusted master are allowed.
//     0b1 ==> Accesses from an untrusted master are not allowed.

#define  AIPS_PACRE_WP7_MASK         0x2u
#define  AIPS_PACRE_WP7_SHIFT        1
//   Write Protect
//     0b0 ==> This peripheral allows write accesses.
//     0b1 ==> This peripheral is write protected.

#define  AIPS_PACRE_SP7_MASK         0x4u
#define  AIPS_PACRE_SP7_SHIFT        2
//   Supervisor Protect
//     0b0 ==> This peripheral does not require supervisor privilege level for accesses.
//     0b1 ==> This peripheral requires supervisor privilege level for accesses.

#define  AIPS_PACRE_TP6_MASK         0x10u
#define  AIPS_PACRE_TP6_SHIFT        4
//   Trusted Protect
//     0b0 ==> Accesses from an untrusted master are allowed.
//     0b1 ==> Accesses from an untrusted master are not allowed.

#define  AIPS_PACRE_WP6_MASK         0x20u
#define  AIPS_PACRE_WP6_SHIFT        5
//   Write Protect
//     0b0 ==> This peripheral allows write accesses.
//     0b1 ==> This peripheral is write protected.

#define  AIPS_PACRE_SP6_MASK         0x40u
#define  AIPS_PACRE_SP6_SHIFT        6
//   Supervisor Protect
//     0b0 ==> This peripheral does not require supervisor privilege level for accesses.
//     0b1 ==> This peripheral requires supervisor privilege level for accesses.

#define  AIPS_PACRE_TP5_MASK         0x100u
#define  AIPS_PACRE_TP5_SHIFT        8
//   Trusted Protect
//     0b0 ==> Accesses from an untrusted master are allowed.
//     0b1 ==> Accesses from an untrusted master are not allowed.

#define  AIPS_PACRE_WP5_MASK         0x200u
#define  AIPS_PACRE_WP5_SHIFT        9
//   Write Protect
//     0b0 ==> This peripheral allows write accesses.
//     0b1 ==> This peripheral is write protected.

#define  AIPS_PACRE_SP5_MASK         0x400u
#define  AIPS_PACRE_SP5_SHIFT        10
//   Supervisor Protect
//     0b0 ==> This peripheral does not require supervisor privilege level for accesses.
//     0b1 ==> This peripheral requires supervisor privilege level for accesses.

