iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  AIPS_PACRP_SP3_MASK         0x40000u
#define  AIPS_PACRP_SP3_SHIFT        18
//   Supervisor Protect
//     0b0 ==> This peripheral does not require supervisor privilege level for accesses.
//     0b1 ==> This peripheral requires supervisor privilege level for accesses.

#define  AIPS_PACRP_TP2_MASK         0x100000u
#define  AIPS_PACRP_TP2_SHIFT        20
//   Trusted protect
//     0b0 ==> Accesses from an untrusted master are allowed.
//     0b1 ==> Accesses from an untrusted master are not allowed.

#define  AIPS_PACRP_WP2_MASK         0x200000u
#define  AIPS_PACRP_WP2_SHIFT        21
//   Write Protect
//     0b0 ==> This peripheral allows write accesses.
//     0b1 ==> This peripheral is write protected.

#define  AIPS_PACRP_SP2_MASK         0x400000u
#define  AIPS_PACRP_SP2_SHIFT        22
//   Supervisor protect
//     0b0 ==> This peripheral does not require supervisor privilege level for accesses.
//     0b1 ==> This peripheral requires supervisor privilege level for accesses.

#define  AIPS_PACRP_TP1_MASK         0x1000000u
#define  AIPS_PACRP_TP1_SHIFT        24
//   Trusted Protect
//     0b0 ==> Accesses from an untrusted master are allowed.
//     0b1 ==> Accesses from an untrusted master are not allowed.

#define  AIPS_PACRP_WP1_MASK         0x2000000u
#define  AIPS_PACRP_WP1_SHIFT        25
//   Write Protect
//     0b0 ==> This peripheral allows write accesses.
//     0b1 ==> This peripheral is write protected.

#define  AIPS_PACRP_SP1_MASK         0x4000000u
#define  AIPS_PACRP_SP1_SHIFT        26
//   Supervisor Protect
//     0b0 ==> This peripheral does not require supervisor privilege level for accesses.
//     0b1 ==> This peripheral requires supervisor privilege level for accesses.

#define  AIPS_PACRP_TP0_MASK         0x10000000u
#define  AIPS_PACRP_TP0_SHIFT        28
//   Trusted protect
//     0b0 ==> Accesses from an untrusted master are allowed.
//     0b1 ==> Accesses from an untrusted master are not allowed.

#define  AIPS_PACRP_WP0_MASK         0x20000000u
#define  AIPS_PACRP_WP0_SHIFT        29
//   Write Protect
//     0b0 ==> This peripheral allows write accesses.
//     0b1 ==> This peripheral is write protected.

#define  AIPS_PACRP_SP0_MASK         0x40000000u
#define  AIPS_PACRP_SP0_SHIFT        30
//   Supervisor Protect
//     0b0 ==> This peripheral does not require supervisor privilege level for accesses.
//     0b1 ==> This peripheral requires supervisor privilege level for accesses.

#define  AIPS_PACRU_TP1_MASK         0x1000000u
#define  AIPS_PACRU_TP1_SHIFT        24
//   Trusted Protect
//     0b0 ==> Accesses from an untrusted master are allowed.
//     0b1 ==> Accesses from an untrusted master are not allowed.

#define  AIPS_PACRU_WP1_MASK         0x2000000u
#define  AIPS_PACRU_WP1_SHIFT        25
//   Write protect
//     0b0 ==> This peripheral allows write accesses.
//     0b1 ==> This peripheral is write protected.

#define  AIPS_PACRU_SP1_MASK         0x4000000u
#define  AIPS_PACRU_SP1_SHIFT        26
//   Supervisor Protect
//     0b0 ==> This peripheral does not require supervisor privilege level for accesses.
//     0b1 ==> This peripheral requires supervisor privilege level for accesses.

#define  AIPS_PACRU_TP0_MASK         0x10000000u
#define  AIPS_PACRU_TP0_SHIFT        28
//   Trusted Protect
//     0b0 ==> Accesses from an untrusted master are allowed.
//     0b1 ==> Accesses from an untrusted master are not allowed.

#define  AIPS_PACRU_WP0_MASK         0x20000000u
#define  AIPS_PACRU_WP0_SHIFT        29
//   Write Protect
//     0b0 ==> This peripheral allows write accesses.
//     0b1 ==> This peripheral is write protected.

#define  AIPS_PACRU_SP0_MASK         0x40000000u
#define  AIPS_PACRU_SP0_SHIFT        30
//   Supervisor protect
//     0b0 ==> This peripheral does not require supervisor privilege level for accesses.
//     0b1 ==> This peripheral requires supervisor privilege level for accesses.

#define  CMP_CR0_HYSTCTR_MASK        0x2u
#define  CMP_CR0_HYSTCTR_SHIFT       0
#define  CMP_CR0_HYSTCTR(x)          (((uint8_t)(((uint8_t)(x))<<CMP_CR0_HYSTCTR_SHIFT))&CMP_CR0_HYSTCTR_MASK)
//   Comparator hard block hysteresis control
//     0b00 ==> Level 0
//     0b01 ==> Level 1
//     0b10 ==> Level 2
//     0b11 ==> Level 3

#define  CMP_CR0_FILTER_CNT_MASK     0x30u
#define  CMP_CR0_FILTER_CNT_SHIFT    4
#define  CMP_CR0_FILTER_CNT(x)       (((uint8_t)(((uint8_t)(x))<<CMP_CR0_FILTER_CNT_SHIFT))&CMP_CR0_FILTER_CNT_MASK)
//   Filter Sample Count
//     0b000 ==> Filter is disabled. If SE = 1, then COUT is a logic 0. This is not a legal state, and is not recommended. If SE = 0, COUT = COUTA.
//     0b001 ==> One sample must agree. The comparator output is simply sampled.
//     0b010 ==> 2 consecutive samples must agree.
//     0b011 ==> 3 consecutive samples must agree.
//     0b100 ==> 4 consecutive samples must agree.
//     0b101 ==> 5 consecutive samples must agree.
//     0b110 ==> 6 consecutive samples must agree.
//     0b111 ==> 7 consecutive samples must agree.

#define  CMP_CR1_EN_MASK             0x1u
#define  CMP_CR1_EN_SHIFT            0
//   Comparator Module Enable
//     0b0 ==> Analog Comparator is disabled.
//     0b1 ==> Analog Comparator is enabled.

#define  CMP_CR1_OPE_MASK            0x2u
#define  CMP_CR1_OPE_SHIFT           1
//   Comparator Output Pin Enable
//     0b0 ==> CMPO is not available on the associated CMPO output pin.
//     0b1 ==> CMPO is available on the associated CMPO output pin.

#define  CMP_CR1_COS_MASK            0x4u
#define  CMP_CR1_COS_SHIFT           2
//   Comparator Output Select
//     0b0 ==> Set the filtered comparator output (CMPO) to equal COUT.
//     0b1 ==> Set the unfiltered comparator output (CMPO) to equal COUTA.

#define  CMP_CR1_INV_MASK            0x8u
#define  CMP_CR1_INV_SHIFT           3
//   Comparator INVERT
//     0b0 ==> Does not invert the comparator output.
//     0b1 ==> Inverts the comparator output.

#define  CMP_CR1_PMODE_MASK          0x10u
#define  CMP_CR1_PMODE_SHIFT         4
//   Power Mode Select
//     0b0 ==> Low-Speed (LS) Comparison mode selected. In this mode, CMP has slower output propagation delay and lower current consumption.
//     0b1 ==> High-Speed (HS) Comparison mode selected. In this mode, CMP has faster output propagation delay and higher current consumption.

