iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  CMP_CR1_TRIGM_MASK          0x20u
#define  CMP_CR1_TRIGM_SHIFT         5
//   Trigger Mode Enable
//     0b0 ==> Trigger mode is disabled.
//     0b1 ==> Trigger mode is enabled.

#define  CMP_CR1_WE_MASK             0x40u
#define  CMP_CR1_WE_SHIFT            6
//   Windowing Enable
//     0b0 ==> Windowing mode is not selected.
//     0b1 ==> Windowing mode is selected.

#define  CMP_CR1_SE_MASK             0x80u
#define  CMP_CR1_SE_SHIFT            7
//   Sample Enable
//     0b0 ==> Sampling mode is not selected.
//     0b1 ==> Sampling mode is selected.

#define  CMP_FPR_FILT_PER_MASK       0x8u
#define  CMP_FPR_FILT_PER_SHIFT      0
#define  CMP_FPR_FILT_PER(x)         (((uint8_t)(((uint8_t)(x))<<CMP_FPR_FILT_PER_SHIFT))&CMP_FPR_FILT_PER_MASK)
//   Filter Sample Period

#define  CMP_SCR_COUT_MASK           0x1u
#define  CMP_SCR_COUT_SHIFT          0
//   Analog Comparator Output

#define  CMP_SCR_CFF_MASK            0x2u
#define  CMP_SCR_CFF_SHIFT           1
//   Analog Comparator Flag Falling
//     0b0 ==> Falling-edge on COUT has not been detected.
//     0b1 ==> Falling-edge on COUT has occurred.

#define  CMP_SCR_CFR_MASK            0x4u
#define  CMP_SCR_CFR_SHIFT           2
//   Analog Comparator Flag Rising
//     0b0 ==> Rising-edge on COUT has not been detected.
//     0b1 ==> Rising-edge on COUT has occurred.

#define  CMP_SCR_IEF_MASK            0x8u
#define  CMP_SCR_IEF_SHIFT           3
//   Comparator Interrupt Enable Falling
//     0b0 ==> Interrupt is disabled.
//     0b1 ==> Interrupt is enabled.

#define  CMP_SCR_IER_MASK            0x10u
#define  CMP_SCR_IER_SHIFT           4
//   Comparator Interrupt Enable Rising
//     0b0 ==> Interrupt is disabled.
//     0b1 ==> Interrupt is enabled.

#define  CMP_SCR_DMAEN_MASK          0x40u
#define  CMP_SCR_DMAEN_SHIFT         6
//   DMA Enable Control
//     0b0 ==> DMA is disabled.
//     0b1 ==> DMA is enabled.

#define  CMP_DACCR_VOSEL_MASK        0x6u
#define  CMP_DACCR_VOSEL_SHIFT       0
#define  CMP_DACCR_VOSEL(x)          (((uint8_t)(((uint8_t)(x))<<CMP_DACCR_VOSEL_SHIFT))&CMP_DACCR_VOSEL_MASK)
//   DAC Output Voltage Select

#define  CMP_DACCR_VRSEL_MASK        0x40u
#define  CMP_DACCR_VRSEL_SHIFT       6
//   Supply Voltage Reference Source Select
//     0b0 ==> V is selected as resistor ladder network supply reference V. in1 in
//     0b1 ==> V is selected as resistor ladder network supply reference V. in2 in

#define  CMP_DACCR_DACEN_MASK        0x80u
#define  CMP_DACCR_DACEN_SHIFT       7
//   DAC Enable
//     0b0 ==> DAC is disabled.
//     0b1 ==> DAC is enabled.

#define  CMP_MUXCR_MSEL_MASK         0x3u
#define  CMP_MUXCR_MSEL_SHIFT        0
#define  CMP_MUXCR_MSEL(x)           (((uint8_t)(((uint8_t)(x))<<CMP_MUXCR_MSEL_SHIFT))&CMP_MUXCR_MSEL_MASK)
//   Minus Input Mux Control
//     0b000 ==> IN0
//     0b001 ==> IN1
//     0b010 ==> IN2
//     0b011 ==> IN3
//     0b100 ==> IN4
//     0b101 ==> IN5
//     0b110 ==> IN6
//     0b111 ==> IN7

#define  CMP_MUXCR_PSEL_MASK         0x18u
#define  CMP_MUXCR_PSEL_SHIFT        3
#define  CMP_MUXCR_PSEL(x)           (((uint8_t)(((uint8_t)(x))<<CMP_MUXCR_PSEL_SHIFT))&CMP_MUXCR_PSEL_MASK)
//   Plus Input Mux Control
//     0b000 ==> IN0
//     0b001 ==> IN1
//     0b010 ==> IN2
//     0b011 ==> IN3
//     0b100 ==> IN4
//     0b101 ==> IN5
//     0b110 ==> IN6
//     0b111 ==> IN7

#define  CMP_MUXCR_PSTM_MASK         0x40u
#define  CMP_MUXCR_PSTM_SHIFT        6
//   Pass Through Mode Enable
//     0b0 ==> Pass Through Mode is disabled.
//     0b1 ==> Pass Through Mode is enabled.

#define  CRC_CRC_LL_MASK             0x8u
#define  CRC_CRC_LL_SHIFT            0
#define  CRC_CRC_LL(x)               (((uint32_t)(((uint32_t)(x))<<CRC_CRC_LL_SHIFT))&CRC_CRC_LL_MASK)
//   CRC Low Lower Byte

#define  CRC_CRC_LU_MASK             0x800u
#define  CRC_CRC_LU_SHIFT            8
#define  CRC_CRC_LU(x)               (((uint32_t)(((uint32_t)(x))<<CRC_CRC_LU_SHIFT))&CRC_CRC_LU_MASK)
//   CRC Low Upper Byte

#define  CRC_CRC_HL_MASK             0x80000u
#define  CRC_CRC_HL_SHIFT            16
#define  CRC_CRC_HL(x)               (((uint32_t)(((uint32_t)(x))<<CRC_CRC_HL_SHIFT))&CRC_CRC_HL_MASK)
//   CRC High Lower Byte

#define  CRC_CRC_HU_MASK             0x8000000u
#define  CRC_CRC_HU_SHIFT            24
#define  CRC_CRC_HU(x)               (((uint32_t)(((uint32_t)(x))<<CRC_CRC_HU_SHIFT))&CRC_CRC_HU_MASK)
//   CRC High Upper Byte

#define  CRC_GPOLY_LOW_MASK          0x10u
#define  CRC_GPOLY_LOW_SHIFT         0
#define  CRC_GPOLY_LOW(x)            (((uint32_t)(((uint32_t)(x))<<CRC_GPOLY_LOW_SHIFT))&CRC_GPOLY_LOW_MASK)
//   Low Polynominal Half-word

#define  CRC_GPOLY_HIGH_MASK         0x100000u
#define  CRC_GPOLY_HIGH_SHIFT        16
#define  CRC_GPOLY_HIGH(x)           (((uint32_t)(((uint32_t)(x))<<CRC_GPOLY_HIGH_SHIFT))&CRC_GPOLY_HIGH_MASK)
//   High Polynominal Half-word

#define  CRC_CTRL_TCRC_MASK          0x1000000u
#define  CRC_CTRL_TCRC_SHIFT         24
//     0b0 ==> 16-bit CRC protocol.
//     0b1 ==> 32-bit CRC protocol.

#define  CRC_CTRL_WAS_MASK           0x2000000u
#define  CRC_CTRL_WAS_SHIFT          25
//   Write CRC Data Register As Seed
//     0b0 ==> Writes to the CRC data register are data values.
//     0b1 ==> Writes to the CRC data register are seed values.

#define  CRC_CTRL_FXOR_MASK          0x4000000u
#define  CRC_CTRL_FXOR_SHIFT         26
//   Complement Read Of CRC Data Register
//     0b0 ==> No XOR on reading.
//     0b1 ==> Invert or complement the read value of the CRC Data register.

#define  CRC_CTRL_TOTR_MASK          0x20000000u
#define  CRC_CTRL_TOTR_SHIFT         28
#define  CRC_CTRL_TOTR(x)            (((uint32_t)(((uint32_t)(x))<<CRC_CTRL_TOTR_SHIFT))&CRC_CTRL_TOTR_MASK)
//   Type Of Transpose For Read
//     0b00 ==> No transposition.
//     0b01 ==> Bits in bytes are transposed; bytes are not transposed.
//     0b10 ==> Both bits in bytes and bytes are transposed.
//     0b11 ==> Only bytes are transposed; no bits in a byte are transposed.

