iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  DMAMUX1_CHCFG1_ENBL_MASK    0x80u
#define  DMAMUX1_CHCFG1_ENBL_SHIFT   7
//   DMA Channel Enable
//     0b0 ==> DMA channel is disabled. This mode is primarily used during configuration of the DMA Mux. The DMA has separate channel enables/disables, which should be used to disable or re-configure a DMA channel.
//     0b1 ==> DMA channel is enabled

#define  DMAMUX1_CHCFG2_SOURCE_MASK  0x6u
#define  DMAMUX1_CHCFG2_SOURCE_SHIFT 0
#define  DMAMUX1_CHCFG2_SOURCE(x)    (((uint8_t)(((uint8_t)(x))<<DMAMUX1_CHCFG2_SOURCE_SHIFT))&DMAMUX1_CHCFG2_SOURCE_MASK)
//   DMA Channel Source (Slot)

#define  DMAMUX1_CHCFG2_TRIG_MASK    0x40u
#define  DMAMUX1_CHCFG2_TRIG_SHIFT   6
//   DMA Channel Trigger Enable
//     0b0 ==> Triggering is disabled. If triggering is disabled, and the ENBL bit is set, the DMA Channel will simply route the specified source to the DMA channel. (Normal mode)
//     0b1 ==> Triggering is enabled. If triggering is enabled, and the ENBL bit is set, the DMAMUX is in Periodic Trigger mode.

#define  DMAMUX1_CHCFG2_ENBL_MASK    0x80u
#define  DMAMUX1_CHCFG2_ENBL_SHIFT   7
//   DMA Channel Enable
//     0b0 ==> DMA channel is disabled. This mode is primarily used during configuration of the DMA Mux. The DMA has separate channel enables/disables, which should be used to disable or re-configure a DMA channel.
//     0b1 ==> DMA channel is enabled

#define  DMAMUX1_CHCFG3_SOURCE_MASK  0x6u
#define  DMAMUX1_CHCFG3_SOURCE_SHIFT 0
#define  DMAMUX1_CHCFG3_SOURCE(x)    (((uint8_t)(((uint8_t)(x))<<DMAMUX1_CHCFG3_SOURCE_SHIFT))&DMAMUX1_CHCFG3_SOURCE_MASK)
//   DMA Channel Source (Slot)

#define  DMAMUX1_CHCFG3_TRIG_MASK    0x40u
#define  DMAMUX1_CHCFG3_TRIG_SHIFT   6
//   DMA Channel Trigger Enable
//     0b0 ==> Triggering is disabled. If triggering is disabled, and the ENBL bit is set, the DMA Channel will simply route the specified source to the DMA channel. (Normal mode)
//     0b1 ==> Triggering is enabled. If triggering is enabled, and the ENBL bit is set, the DMAMUX is in Periodic Trigger mode.

#define  DMAMUX1_CHCFG3_ENBL_MASK    0x80u
#define  DMAMUX1_CHCFG3_ENBL_SHIFT   7
//   DMA Channel Enable
//     0b0 ==> DMA channel is disabled. This mode is primarily used during configuration of the DMA Mux. The DMA has separate channel enables/disables, which should be used to disable or re-configure a DMA channel.
//     0b1 ==> DMA channel is enabled

#define  DMAMUX2_CHCFG0_SOURCE_MASK  0x6u
#define  DMAMUX2_CHCFG0_SOURCE_SHIFT 0
#define  DMAMUX2_CHCFG0_SOURCE(x)    (((uint8_t)(((uint8_t)(x))<<DMAMUX2_CHCFG0_SOURCE_SHIFT))&DMAMUX2_CHCFG0_SOURCE_MASK)
//   DMA Channel Source (Slot)

#define  DMAMUX2_CHCFG0_TRIG_MASK    0x40u
#define  DMAMUX2_CHCFG0_TRIG_SHIFT   6
//   DMA Channel Trigger Enable
//     0b0 ==> Triggering is disabled. If triggering is disabled, and the ENBL bit is set, the DMA Channel will simply route the specified source to the DMA channel. (Normal mode)
//     0b1 ==> Triggering is enabled. If triggering is enabled, and the ENBL bit is set, the DMAMUX is in Periodic Trigger mode.

#define  DMAMUX2_CHCFG0_ENBL_MASK    0x80u
#define  DMAMUX2_CHCFG0_ENBL_SHIFT   7
//   DMA Channel Enable
//     0b0 ==> DMA channel is disabled. This mode is primarily used during configuration of the DMA Mux. The DMA has separate channel enables/disables, which should be used to disable or re-configure a DMA channel.
//     0b1 ==> DMA channel is enabled

#define  DMAMUX2_CHCFG1_SOURCE_MASK  0x6u
#define  DMAMUX2_CHCFG1_SOURCE_SHIFT 0
#define  DMAMUX2_CHCFG1_SOURCE(x)    (((uint8_t)(((uint8_t)(x))<<DMAMUX2_CHCFG1_SOURCE_SHIFT))&DMAMUX2_CHCFG1_SOURCE_MASK)
//   DMA Channel Source (Slot)

#define  DMAMUX2_CHCFG1_TRIG_MASK    0x40u
#define  DMAMUX2_CHCFG1_TRIG_SHIFT   6
//   DMA Channel Trigger Enable
//     0b0 ==> Triggering is disabled. If triggering is disabled, and the ENBL bit is set, the DMA Channel will simply route the specified source to the DMA channel. (Normal mode)
//     0b1 ==> Triggering is enabled. If triggering is enabled, and the ENBL bit is set, the DMAMUX is in Periodic Trigger mode.

#define  DMAMUX2_CHCFG1_ENBL_MASK    0x80u
#define  DMAMUX2_CHCFG1_ENBL_SHIFT   7
//   DMA Channel Enable
//     0b0 ==> DMA channel is disabled. This mode is primarily used during configuration of the DMA Mux. The DMA has separate channel enables/disables, which should be used to disable or re-configure a DMA channel.
//     0b1 ==> DMA channel is enabled

#define  DMAMUX2_CHCFG2_SOURCE_MASK  0x6u
#define  DMAMUX2_CHCFG2_SOURCE_SHIFT 0
#define  DMAMUX2_CHCFG2_SOURCE(x)    (((uint8_t)(((uint8_t)(x))<<DMAMUX2_CHCFG2_SOURCE_SHIFT))&DMAMUX2_CHCFG2_SOURCE_MASK)
//   DMA Channel Source (Slot)

#define  DMAMUX2_CHCFG2_TRIG_MASK    0x40u
#define  DMAMUX2_CHCFG2_TRIG_SHIFT   6
//   DMA Channel Trigger Enable
//     0b0 ==> Triggering is disabled. If triggering is disabled, and the ENBL bit is set, the DMA Channel will simply route the specified source to the DMA channel. (Normal mode)
//     0b1 ==> Triggering is enabled. If triggering is enabled, and the ENBL bit is set, the DMAMUX is in Periodic Trigger mode.

#define  DMAMUX2_CHCFG2_ENBL_MASK    0x80u
#define  DMAMUX2_CHCFG2_ENBL_SHIFT   7
//   DMA Channel Enable
//     0b0 ==> DMA channel is disabled. This mode is primarily used during configuration of the DMA Mux. The DMA has separate channel enables/disables, which should be used to disable or re-configure a DMA channel.
//     0b1 ==> DMA channel is enabled

#define  DMAMUX2_CHCFG3_SOURCE_MASK  0x6u
#define  DMAMUX2_CHCFG3_SOURCE_SHIFT 0
#define  DMAMUX2_CHCFG3_SOURCE(x)    (((uint8_t)(((uint8_t)(x))<<DMAMUX2_CHCFG3_SOURCE_SHIFT))&DMAMUX2_CHCFG3_SOURCE_MASK)
//   DMA Channel Source (Slot)

#define  DMAMUX2_CHCFG3_TRIG_MASK    0x40u
#define  DMAMUX2_CHCFG3_TRIG_SHIFT   6
//   DMA Channel Trigger Enable
//     0b0 ==> Triggering is disabled. If triggering is disabled, and the ENBL bit is set, the DMA Channel will simply route the specified source to the DMA channel. (Normal mode)
//     0b1 ==> Triggering is enabled. If triggering is enabled, and the ENBL bit is set, the DMAMUX is in Periodic Trigger mode.

#define  DMAMUX2_CHCFG3_ENBL_MASK    0x80u
#define  DMAMUX2_CHCFG3_ENBL_SHIFT   7
//   DMA Channel Enable
//     0b0 ==> DMA channel is disabled. This mode is primarily used during configuration of the DMA Mux. The DMA has separate channel enables/disables, which should be used to disable or re-configure a DMA channel.
//     0b1 ==> DMA channel is enabled

#define  DMAMUX3_CHCFG0_SOURCE_MASK  0x6u
#define  DMAMUX3_CHCFG0_SOURCE_SHIFT 0
#define  DMAMUX3_CHCFG0_SOURCE(x)    (((uint8_t)(((uint8_t)(x))<<DMAMUX3_CHCFG0_SOURCE_SHIFT))&DMAMUX3_CHCFG0_SOURCE_MASK)
//   DMA Channel Source (Slot)

#define  DMAMUX3_CHCFG0_TRIG_MASK    0x40u
#define  DMAMUX3_CHCFG0_TRIG_SHIFT   6
//   DMA Channel Trigger Enable
//     0b0 ==> Triggering is disabled. If triggering is disabled, and the ENBL bit is set, the DMA Channel will simply route the specified source to the DMA channel. (Normal mode)
//     0b1 ==> Triggering is enabled. If triggering is enabled, and the ENBL bit is set, the DMAMUX is in Periodic Trigger mode.

