iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  DMAMUX3_CHCFG0_ENBL_MASK    0x80u
#define  DMAMUX3_CHCFG0_ENBL_SHIFT   7
//   DMA Channel Enable
//     0b0 ==> DMA channel is disabled. This mode is primarily used during configuration of the DMA Mux. The DMA has separate channel enables/disables, which should be used to disable or re-configure a DMA channel.
//     0b1 ==> DMA channel is enabled

#define  DMAMUX3_CHCFG1_SOURCE_MASK  0x6u
#define  DMAMUX3_CHCFG1_SOURCE_SHIFT 0
#define  DMAMUX3_CHCFG1_SOURCE(x)    (((uint8_t)(((uint8_t)(x))<<DMAMUX3_CHCFG1_SOURCE_SHIFT))&DMAMUX3_CHCFG1_SOURCE_MASK)
//   DMA Channel Source (Slot)

#define  DMAMUX3_CHCFG1_TRIG_MASK    0x40u
#define  DMAMUX3_CHCFG1_TRIG_SHIFT   6
//   DMA Channel Trigger Enable
//     0b0 ==> Triggering is disabled. If triggering is disabled, and the ENBL bit is set, the DMA Channel will simply route the specified source to the DMA channel. (Normal mode)
//     0b1 ==> Triggering is enabled. If triggering is enabled, and the ENBL bit is set, the DMAMUX is in Periodic Trigger mode.

#define  DMAMUX3_CHCFG1_ENBL_MASK    0x80u
#define  DMAMUX3_CHCFG1_ENBL_SHIFT   7
//   DMA Channel Enable
//     0b0 ==> DMA channel is disabled. This mode is primarily used during configuration of the DMA Mux. The DMA has separate channel enables/disables, which should be used to disable or re-configure a DMA channel.
//     0b1 ==> DMA channel is enabled

#define  DMAMUX3_CHCFG2_SOURCE_MASK  0x6u
#define  DMAMUX3_CHCFG2_SOURCE_SHIFT 0
#define  DMAMUX3_CHCFG2_SOURCE(x)    (((uint8_t)(((uint8_t)(x))<<DMAMUX3_CHCFG2_SOURCE_SHIFT))&DMAMUX3_CHCFG2_SOURCE_MASK)
//   DMA Channel Source (Slot)

#define  DMAMUX3_CHCFG2_TRIG_MASK    0x40u
#define  DMAMUX3_CHCFG2_TRIG_SHIFT   6
//   DMA Channel Trigger Enable
//     0b0 ==> Triggering is disabled. If triggering is disabled, and the ENBL bit is set, the DMA Channel will simply route the specified source to the DMA channel. (Normal mode)
//     0b1 ==> Triggering is enabled. If triggering is enabled, and the ENBL bit is set, the DMAMUX is in Periodic Trigger mode.

#define  DMAMUX3_CHCFG2_ENBL_MASK    0x80u
#define  DMAMUX3_CHCFG2_ENBL_SHIFT   7
//   DMA Channel Enable
//     0b0 ==> DMA channel is disabled. This mode is primarily used during configuration of the DMA Mux. The DMA has separate channel enables/disables, which should be used to disable or re-configure a DMA channel.
//     0b1 ==> DMA channel is enabled

#define  DMAMUX3_CHCFG3_SOURCE_MASK  0x6u
#define  DMAMUX3_CHCFG3_SOURCE_SHIFT 0
#define  DMAMUX3_CHCFG3_SOURCE(x)    (((uint8_t)(((uint8_t)(x))<<DMAMUX3_CHCFG3_SOURCE_SHIFT))&DMAMUX3_CHCFG3_SOURCE_MASK)
//   DMA Channel Source (Slot)

#define  DMAMUX3_CHCFG3_TRIG_MASK    0x40u
#define  DMAMUX3_CHCFG3_TRIG_SHIFT   6
//   DMA Channel Trigger Enable
//     0b0 ==> Triggering is disabled. If triggering is disabled, and the ENBL bit is set, the DMA Channel will simply route the specified source to the DMA channel. (Normal mode)
//     0b1 ==> Triggering is enabled. If triggering is enabled, and the ENBL bit is set, the DMAMUX is in Periodic Trigger mode.

#define  DMAMUX3_CHCFG3_ENBL_MASK    0x80u
#define  DMAMUX3_CHCFG3_ENBL_SHIFT   7
//   DMA Channel Enable
//     0b0 ==> DMA channel is disabled. This mode is primarily used during configuration of the DMA Mux. The DMA has separate channel enables/disables, which should be used to disable or re-configure a DMA channel.
//     0b1 ==> DMA channel is enabled

#define  EWM_CTRL_EWMEN_MASK         0x1u
#define  EWM_CTRL_EWMEN_SHIFT        0
//   EWM enable.

#define  EWM_CTRL_ASSIN_MASK         0x2u
#define  EWM_CTRL_ASSIN_SHIFT        1
//   EWM_in's Assertion State Select.

#define  EWM_CTRL_INEN_MASK          0x4u
#define  EWM_CTRL_INEN_SHIFT         2
//   Input Enable.

#define  EWM_CTRL_INTEN_MASK         0x8u
#define  EWM_CTRL_INTEN_SHIFT        3
//   Interrupt Enable.

#define  EWM_SERV_SERVICE_MASK       0x8u
#define  EWM_SERV_SERVICE_SHIFT      0
#define  EWM_SERV_SERVICE(x)         (((uint8_t)(((uint8_t)(x))<<EWM_SERV_SERVICE_SHIFT))&EWM_SERV_SERVICE_MASK)

#define  EWM_CMPL_COMPAREL_MASK      0x8u
#define  EWM_CMPL_COMPAREL_SHIFT     0
#define  EWM_CMPL_COMPAREL(x)        (((uint8_t)(((uint8_t)(x))<<EWM_CMPL_COMPAREL_SHIFT))&EWM_CMPL_COMPAREL_MASK)

#define  EWM_CMPH_COMPAREH_MASK      0x8u
#define  EWM_CMPH_COMPAREH_SHIFT     0
#define  EWM_CMPH_COMPAREH(x)        (((uint8_t)(((uint8_t)(x))<<EWM_CMPH_COMPAREH_SHIFT))&EWM_CMPH_COMPAREH_MASK)

#define  FTFA_FSTAT_MGSTAT0_MASK     0x1u
#define  FTFA_FSTAT_MGSTAT0_SHIFT    0
//   Memory Controller Command Completion Status Flag

#define  FTFA_FSTAT_FPVIOL_MASK      0x10u
#define  FTFA_FSTAT_FPVIOL_SHIFT     4
//   Flash Protection Violation Flag
//     0b0 ==> No protection violation detected
//     0b1 ==> Protection violation detected

#define  FTFA_FSTAT_ACCERR_MASK      0x20u
#define  FTFA_FSTAT_ACCERR_SHIFT     5
//   Flash Access Error Flag
//     0b0 ==> No access error detected
//     0b1 ==> Access error detected

#define  FTFA_FSTAT_RDCOLERR_MASK    0x40u
#define  FTFA_FSTAT_RDCOLERR_SHIFT   6
//   Flash Read Collision Error Flag
//     0b0 ==> No collision error detected
//     0b1 ==> Collision error detected

#define  FTFA_FSTAT_CCIF_MASK        0x80u
#define  FTFA_FSTAT_CCIF_SHIFT       7
//   Command Complete Interrupt Flag
//     0b0 ==> Flash command in progress
//     0b1 ==> Flash command has completed

#define  FTFA_FCNFG_ERSSUSP_MASK     0x10u
#define  FTFA_FCNFG_ERSSUSP_SHIFT    4
//   Erase Suspend
//     0b0 ==> No suspend requested
//     0b1 ==> Suspend the current Erase Flash Sector command execution.

#define  FTFA_FCNFG_ERSAREQ_MASK     0x20u
#define  FTFA_FCNFG_ERSAREQ_SHIFT    5
//   Erase All Request
//     0b0 ==> No request or request complete
//     0b1 ==> Request to: run the Erase All Blocks command, verify the erased state, program the security byte in the Flash Configuration Field to the unsecure state, and release MCU security by setting the FSEC[SEC] field to the unsecure state.

#define  FTFA_FCNFG_RDCOLLIE_MASK    0x40u
#define  FTFA_FCNFG_RDCOLLIE_SHIFT   6
//   Read Collision Error Interrupt Enable
//     0b0 ==> Read collision error interrupt disabled
//     0b1 ==> Read collision error interrupt enabled. An interrupt request is generated whenever a flash memory read collision error is detected (see the description of FSTAT[RDCOLERR]).

