iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  FTFA_FCNFG_CCIE_MASK        0x80u
#define  FTFA_FCNFG_CCIE_SHIFT       7
//   Command Complete Interrupt Enable
//     0b0 ==> Command complete interrupt disabled
//     0b1 ==> Command complete interrupt enabled. An interrupt request is generated whenever the FSTAT[CCIF] flag is set.

#define  FTFA_FSEC_SEC_MASK          0x2u
#define  FTFA_FSEC_SEC_SHIFT         0
#define  FTFA_FSEC_SEC(x)            (((uint8_t)(((uint8_t)(x))<<FTFA_FSEC_SEC_SHIFT))&FTFA_FSEC_SEC_MASK)
//   Flash Security
//     0b00 ==> MCU security status is secure
//     0b01 ==> MCU security status is secure
//     0b10 ==> MCU security status is unsecure (The standard shipping condition of the flash memory module is unsecure.)
//     0b11 ==> MCU security status is secure

#define  FTFA_FSEC_FSLACC_MASK       0x8u
#define  FTFA_FSEC_FSLACC_SHIFT      2
#define  FTFA_FSEC_FSLACC(x)         (((uint8_t)(((uint8_t)(x))<<FTFA_FSEC_FSLACC_SHIFT))&FTFA_FSEC_FSLACC_MASK)
//   Freescale Failure Analysis Access Code
//     0b00 ==> Freescale factory access granted
//     0b01 ==> Freescale factory access denied
//     0b10 ==> Freescale factory access denied
//     0b11 ==> Freescale factory access granted

#define  FTFA_FSEC_MEEN_MASK         0x20u
#define  FTFA_FSEC_MEEN_SHIFT        4
#define  FTFA_FSEC_MEEN(x)           (((uint8_t)(((uint8_t)(x))<<FTFA_FSEC_MEEN_SHIFT))&FTFA_FSEC_MEEN_MASK)
//   Mass Erase Enable Bits
//     0b00 ==> Mass erase is enabled
//     0b01 ==> Mass erase is enabled
//     0b10 ==> Mass erase is disabled
//     0b11 ==> Mass erase is enabled

#define  FTFA_FSEC_KEYEN_MASK        0x80u
#define  FTFA_FSEC_KEYEN_SHIFT       6
#define  FTFA_FSEC_KEYEN(x)          (((uint8_t)(((uint8_t)(x))<<FTFA_FSEC_KEYEN_SHIFT))&FTFA_FSEC_KEYEN_MASK)
//   Backdoor Key Security Enable
//     0b00 ==> Backdoor key access disabled
//     0b01 ==> Backdoor key access disabled (preferred KEYEN state to disable backdoor key access)
//     0b10 ==> Backdoor key access enabled
//     0b11 ==> Backdoor key access disabled

#define  FTFA_FOPT_OPT_MASK          0x8u
#define  FTFA_FOPT_OPT_SHIFT         0
#define  FTFA_FOPT_OPT(x)            (((uint8_t)(((uint8_t)(x))<<FTFA_FOPT_OPT_SHIFT))&FTFA_FOPT_OPT_MASK)
//   Nonvolatile Option

#define  FTFA_FCCOB3_CCOBn_MASK      0x8u
#define  FTFA_FCCOB3_CCOBn_SHIFT     0
#define  FTFA_FCCOB3_CCOBn(x)        (((uint8_t)(((uint8_t)(x))<<FTFA_FCCOB3_CCOBn_SHIFT))&FTFA_FCCOB3_CCOBn_MASK)

#define  FTFA_FCCOB2_CCOBn_MASK      0x8u
#define  FTFA_FCCOB2_CCOBn_SHIFT     0
#define  FTFA_FCCOB2_CCOBn(x)        (((uint8_t)(((uint8_t)(x))<<FTFA_FCCOB2_CCOBn_SHIFT))&FTFA_FCCOB2_CCOBn_MASK)

#define  FTFA_FCCOB1_CCOBn_MASK      0x8u
#define  FTFA_FCCOB1_CCOBn_SHIFT     0
#define  FTFA_FCCOB1_CCOBn(x)        (((uint8_t)(((uint8_t)(x))<<FTFA_FCCOB1_CCOBn_SHIFT))&FTFA_FCCOB1_CCOBn_MASK)

#define  FTFA_FCCOB0_CCOBn_MASK      0x8u
#define  FTFA_FCCOB0_CCOBn_SHIFT     0
#define  FTFA_FCCOB0_CCOBn(x)        (((uint8_t)(((uint8_t)(x))<<FTFA_FCCOB0_CCOBn_SHIFT))&FTFA_FCCOB0_CCOBn_MASK)

#define  FTFA_FCCOB7_CCOBn_MASK      0x8u
#define  FTFA_FCCOB7_CCOBn_SHIFT     0
#define  FTFA_FCCOB7_CCOBn(x)        (((uint8_t)(((uint8_t)(x))<<FTFA_FCCOB7_CCOBn_SHIFT))&FTFA_FCCOB7_CCOBn_MASK)

#define  FTFA_FCCOB6_CCOBn_MASK      0x8u
#define  FTFA_FCCOB6_CCOBn_SHIFT     0
#define  FTFA_FCCOB6_CCOBn(x)        (((uint8_t)(((uint8_t)(x))<<FTFA_FCCOB6_CCOBn_SHIFT))&FTFA_FCCOB6_CCOBn_MASK)

#define  FTFA_FCCOB5_CCOBn_MASK      0x8u
#define  FTFA_FCCOB5_CCOBn_SHIFT     0
#define  FTFA_FCCOB5_CCOBn(x)        (((uint8_t)(((uint8_t)(x))<<FTFA_FCCOB5_CCOBn_SHIFT))&FTFA_FCCOB5_CCOBn_MASK)

#define  FTFA_FCCOB4_CCOBn_MASK      0x8u
#define  FTFA_FCCOB4_CCOBn_SHIFT     0
#define  FTFA_FCCOB4_CCOBn(x)        (((uint8_t)(((uint8_t)(x))<<FTFA_FCCOB4_CCOBn_SHIFT))&FTFA_FCCOB4_CCOBn_MASK)

#define  FTFA_FCCOBB_CCOBn_MASK      0x8u
#define  FTFA_FCCOBB_CCOBn_SHIFT     0
#define  FTFA_FCCOBB_CCOBn(x)        (((uint8_t)(((uint8_t)(x))<<FTFA_FCCOBB_CCOBn_SHIFT))&FTFA_FCCOBB_CCOBn_MASK)

#define  FTFA_FCCOBA_CCOBn_MASK      0x8u
#define  FTFA_FCCOBA_CCOBn_SHIFT     0
#define  FTFA_FCCOBA_CCOBn(x)        (((uint8_t)(((uint8_t)(x))<<FTFA_FCCOBA_CCOBn_SHIFT))&FTFA_FCCOBA_CCOBn_MASK)

#define  FTFA_FCCOB9_CCOBn_MASK      0x8u
#define  FTFA_FCCOB9_CCOBn_SHIFT     0
#define  FTFA_FCCOB9_CCOBn(x)        (((uint8_t)(((uint8_t)(x))<<FTFA_FCCOB9_CCOBn_SHIFT))&FTFA_FCCOB9_CCOBn_MASK)

#define  FTFA_FCCOB8_CCOBn_MASK      0x8u
#define  FTFA_FCCOB8_CCOBn_SHIFT     0
#define  FTFA_FCCOB8_CCOBn(x)        (((uint8_t)(((uint8_t)(x))<<FTFA_FCCOB8_CCOBn_SHIFT))&FTFA_FCCOB8_CCOBn_MASK)

#define  FTFA_FPROT3_PROT_MASK       0x8u
#define  FTFA_FPROT3_PROT_SHIFT      0
#define  FTFA_FPROT3_PROT(x)         (((uint8_t)(((uint8_t)(x))<<FTFA_FPROT3_PROT_SHIFT))&FTFA_FPROT3_PROT_MASK)
//   Program Flash Region Protect
//     0b0 ==> Program flash region is protected.
//     0b1 ==> Program flash region is not protected

#define  FTFA_FPROT2_PROT_MASK       0x8u
#define  FTFA_FPROT2_PROT_SHIFT      0
#define  FTFA_FPROT2_PROT(x)         (((uint8_t)(((uint8_t)(x))<<FTFA_FPROT2_PROT_SHIFT))&FTFA_FPROT2_PROT_MASK)
//   Program Flash Region Protect
//     0b0 ==> Program flash region is protected.
//     0b1 ==> Program flash region is not protected

#define  FTFA_FPROT1_PROT_MASK       0x8u
#define  FTFA_FPROT1_PROT_SHIFT      0
#define  FTFA_FPROT1_PROT(x)         (((uint8_t)(((uint8_t)(x))<<FTFA_FPROT1_PROT_SHIFT))&FTFA_FPROT1_PROT_MASK)
//   Program Flash Region Protect
//     0b0 ==> Program flash region is protected.
//     0b1 ==> Program flash region is not protected

#define  FTFA_FPROT0_PROT_MASK       0x8u
#define  FTFA_FPROT0_PROT_SHIFT      0
#define  FTFA_FPROT0_PROT(x)         (((uint8_t)(((uint8_t)(x))<<FTFA_FPROT0_PROT_SHIFT))&FTFA_FPROT0_PROT_MASK)
//   Program Flash Region Protect
//     0b0 ==> Program flash region is protected.
//     0b1 ==> Program flash region is not protected

#define  GPIO_PDOR_PDO_MASK          0x20u
#define  GPIO_PDOR_PDO_SHIFT         0
#define  GPIO_PDOR_PDO(x)            (((uint32_t)(((uint32_t)(x))<<GPIO_PDOR_PDO_SHIFT))&GPIO_PDOR_PDO_MASK)
//   Port Data Output
//     0b0 ==> Logic level 0 is driven on pin, provided pin is configured for general-purpose output.
//     0b1 ==> Logic level 1 is driven on pin, provided pin is configured for general-purpose output.

#define  GPIO_PSOR_PTSO_MASK         0x20u
#define  GPIO_PSOR_PTSO_SHIFT        0
#define  GPIO_PSOR_PTSO(x)           (((uint32_t)(((uint32_t)(x))<<GPIO_PSOR_PTSO_SHIFT))&GPIO_PSOR_PTSO_MASK)
//   Port Set Output
//     0b0 ==> Corresponding bit in PDORn does not change.
//     0b1 ==> Corresponding bit in PDORn is set to logic 1.

#define  GPIO_PCOR_PTCO_MASK         0x20u
#define  GPIO_PCOR_PTCO_SHIFT        0
#define  GPIO_PCOR_PTCO(x)           (((uint32_t)(((uint32_t)(x))<<GPIO_PCOR_PTCO_SHIFT))&GPIO_PCOR_PTCO_MASK)
//   Port Clear Output
//     0b0 ==> Corresponding bit in PDORn does not change.
//     0b1 ==> Corresponding bit in PDORn is cleared to logic 0.

