iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  GPIO_PTOR_PTTO_MASK         0x20u
#define  GPIO_PTOR_PTTO_SHIFT        0
#define  GPIO_PTOR_PTTO(x)           (((uint32_t)(((uint32_t)(x))<<GPIO_PTOR_PTTO_SHIFT))&GPIO_PTOR_PTTO_MASK)
//   Port Toggle Output
//     0b0 ==> Corresponding bit in PDORn does not change.
//     0b1 ==> Corresponding bit in PDORn is set to the inverse of its existing logic state.

#define  GPIO_PDIR_PDI_MASK          0x20u
#define  GPIO_PDIR_PDI_SHIFT         0
#define  GPIO_PDIR_PDI(x)            (((uint32_t)(((uint32_t)(x))<<GPIO_PDIR_PDI_SHIFT))&GPIO_PDIR_PDI_MASK)
//   Port Data Input
//     0b0 ==> Pin logic level is logic 0, or is not configured for use by digital function.
//     0b1 ==> Pin logic level is logic 1.

#define  I2C0_A1_AD_MASK             0xEu
#define  I2C0_A1_AD_SHIFT            1
#define  I2C0_A1_AD(x)               (((uint8_t)(((uint8_t)(x))<<I2C0_A1_AD_SHIFT))&I2C0_A1_AD_MASK)
//   Address

#define  I2C0_F_ICR_MASK             0x6u
#define  I2C0_F_ICR_SHIFT            0
#define  I2C0_F_ICR(x)               (((uint8_t)(((uint8_t)(x))<<I2C0_F_ICR_SHIFT))&I2C0_F_ICR_MASK)
//   ClockRate

#define  I2C0_F_MULT_MASK            0x80u
#define  I2C0_F_MULT_SHIFT           6
#define  I2C0_F_MULT(x)              (((uint8_t)(((uint8_t)(x))<<I2C0_F_MULT_SHIFT))&I2C0_F_MULT_MASK)
//     0b00 ==> mul = 1
//     0b01 ==> mul = 2
//     0b10 ==> mul = 4
//     0b11 ==> Reserved

#define  I2C0_C1_DMAEN_MASK          0x1u
#define  I2C0_C1_DMAEN_SHIFT         0
//   DMA Enable
//     0b0 ==> All DMA signalling disabled.
//     0b1 ==> DMA transfer is enabled and the following conditions trigger the DMA request: While FACK = 0, a data byte is received, either address or data is transmitted. (ACK/NACK automatic) While FACK = 0, the first byte received matches the A1 register or is general call address. If any address matching occurs, IAAS and TCF are set. If the direction of transfer is known from master to slave, then it is not required to check the SRW. With this assumption, DMA can also be used in this
//             case. In other cases, if the master reads data from the slave, then it is required to rewrite the C1 register operation. With this assumption, DMA cannot be used. When FACK = 1, an address or a data byte is transmitted.

#define  I2C0_C1_WUEN_MASK           0x2u
#define  I2C0_C1_WUEN_SHIFT          1
//   Wakeup Enable
//     0b0 ==> Normal operation. No interrupt generated when address matching in low power mode.
//     0b1 ==> Enables the wakeup function in low power mode.

#define  I2C0_C1_RSTA_MASK           0x4u
#define  I2C0_C1_RSTA_SHIFT          2
//   Repeat START

#define  I2C0_C1_TXAK_MASK           0x8u
#define  I2C0_C1_TXAK_SHIFT          3
//   Transmit Acknowledge Enable
//     0b0 ==> An acknowledge signal is sent to the bus on the following receiving byte (if FACK is cleared) or the current receiving byte (if FACK is set).
//     0b1 ==> No acknowledge signal is sent to the bus on the following receiving data byte (if FACK is cleared) or the current receiving data byte (if FACK is set).

#define  I2C0_C1_TX_MASK             0x10u
#define  I2C0_C1_TX_SHIFT            4
//   Transmit Mode Select
//     0b0 ==> Receive
//     0b1 ==> Transmit

#define  I2C0_C1_MST_MASK            0x20u
#define  I2C0_C1_MST_SHIFT           5
//   Master Mode Select
//     0b0 ==> Slave mode
//     0b1 ==> Master mode

#define  I2C0_C1_IICIE_MASK          0x40u
#define  I2C0_C1_IICIE_SHIFT         6
//   I2C Interrupt Enable
//     0b0 ==> Disabled
//     0b1 ==> Enabled

#define  I2C0_C1_IICEN_MASK          0x80u
#define  I2C0_C1_IICEN_SHIFT         7
//   I2C Enable
//     0b0 ==> Disabled
//     0b1 ==> Enabled

#define  I2C0_S_RXAK_MASK            0x1u
#define  I2C0_S_RXAK_SHIFT           0
//   Receive Acknowledge
//     0b0 ==> Acknowledge signal was received after the completion of one byte of data transmission on the bus
//     0b1 ==> No acknowledge signal detected

#define  I2C0_S_IICIF_MASK           0x2u
#define  I2C0_S_IICIF_SHIFT          1
//   Interrupt Flag
//     0b0 ==> No interrupt pending
//     0b1 ==> Interrupt pending

#define  I2C0_S_SRW_MASK             0x4u
#define  I2C0_S_SRW_SHIFT            2
//   Slave Read/Write
//     0b0 ==> Slave receive, master writing to slave
//     0b1 ==> Slave transmit, master reading from slave

#define  I2C0_S_RAM_MASK             0x8u
#define  I2C0_S_RAM_SHIFT            3
//   Range Address Match
//     0b0 ==> Not addressed
//     0b1 ==> Addressed as a slave

#define  I2C0_S_ARBL_MASK            0x10u
#define  I2C0_S_ARBL_SHIFT           4
//   Arbitration Lost
//     0b0 ==> Standard bus operation.
//     0b1 ==> Loss of arbitration.

#define  I2C0_S_BUSY_MASK            0x20u
#define  I2C0_S_BUSY_SHIFT           5
//   Bus Busy
//     0b0 ==> Bus is idle
//     0b1 ==> Bus is busy

#define  I2C0_S_IAAS_MASK            0x40u
#define  I2C0_S_IAAS_SHIFT           6
//   Addressed As A Slave
//     0b0 ==> Not addressed
//     0b1 ==> Addressed as a slave

#define  I2C0_S_TCF_MASK             0x80u
#define  I2C0_S_TCF_SHIFT            7
//   Transfer Complete Flag
//     0b0 ==> Transfer in progress
//     0b1 ==> Transfer complete

#define  I2C0_D_DATA_MASK            0x8u
#define  I2C0_D_DATA_SHIFT           0
#define  I2C0_D_DATA(x)              (((uint8_t)(((uint8_t)(x))<<I2C0_D_DATA_SHIFT))&I2C0_D_DATA_MASK)
//   Data

#define  I2C0_C2_AD_MASK             0x3u
#define  I2C0_C2_AD_SHIFT            0
#define  I2C0_C2_AD(x)               (((uint8_t)(((uint8_t)(x))<<I2C0_C2_AD_SHIFT))&I2C0_C2_AD_MASK)
//   Slave Address

#define  I2C0_C2_RMEN_MASK           0x8u
#define  I2C0_C2_RMEN_SHIFT          3
//   Range Address Matching Enable
//     0b0 ==> Range mode disabled. No address match occurs for an address within the range of values of the A1 and RA registers.
//     0b1 ==> Range mode enabled. Address matching occurs when a slave receives an address within the range of values of the A1 and RA registers.

#define  I2C0_C2_SBRC_MASK           0x10u
#define  I2C0_C2_SBRC_SHIFT          4
//   Slave Baud Rate Control
//     0b0 ==> The slave baud rate follows the master baud rate and clock stretching may occur
//     0b1 ==> Slave baud rate is independent of the master baud rate

#define  I2C0_C2_HDRS_MASK           0x20u
#define  I2C0_C2_HDRS_SHIFT          5
//   High Drive Select
//     0b0 ==> Normal drive mode
//     0b1 ==> High drive mode

#define  I2C0_C2_ADEXT_MASK          0x40u
#define  I2C0_C2_ADEXT_SHIFT         6
//   Address Extension
//     0b0 ==> 7-bit address scheme
//     0b1 ==> 10-bit address scheme

#define  I2C0_C2_GCAEN_MASK          0x80u
#define  I2C0_C2_GCAEN_SHIFT         7
//   General Call Address Enable
//     0b0 ==> Disabled
//     0b1 ==> Enabled

#define  I2C0_FLT_FLT_MASK           0x5u
#define  I2C0_FLT_FLT_SHIFT          0
#define  I2C0_FLT_FLT(x)             (((uint8_t)(((uint8_t)(x))<<I2C0_FLT_FLT_SHIFT))&I2C0_FLT_FLT_MASK)
//   I2C Programmable Filter Factor
//     0b0 ==> No filter/bypass

