iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  I2C0_RA_RAD_MASK            0xEu
#define  I2C0_RA_RAD_SHIFT           1
#define  I2C0_RA_RAD(x)              (((uint8_t)(((uint8_t)(x))<<I2C0_RA_RAD_SHIFT))&I2C0_RA_RAD_MASK)
//   Range Slave Address

#define  I2C0_SMB_SHTF2IE_MASK       0x1u
#define  I2C0_SMB_SHTF2IE_SHIFT      0
//   SHTF2 Interrupt Enable
//     0b0 ==> SHTF2 interrupt is disabled
//     0b1 ==> SHTF2 interrupt is enabled

#define  I2C0_SMB_SHTF2_MASK         0x2u
#define  I2C0_SMB_SHTF2_SHIFT        1
//   SCL High Timeout Flag 2
//     0b0 ==> No SCL high and SDA low timeout occurs
//     0b1 ==> SCL high and SDA low timeout occurs

#define  I2C0_SMB_SHTF1_MASK         0x4u
#define  I2C0_SMB_SHTF1_SHIFT        2
//   SCL High Timeout Flag 1
//     0b0 ==> No SCL high and SDA high timeout occurs
//     0b1 ==> SCL high and SDA high timeout occurs

#define  I2C0_SMB_SLTF_MASK          0x8u
#define  I2C0_SMB_SLTF_SHIFT         3
//   SCL Low Timeout Flag
//     0b0 ==> No low timeout occurs
//     0b1 ==> Low timeout occurs

#define  I2C0_SMB_TCKSEL_MASK        0x10u
#define  I2C0_SMB_TCKSEL_SHIFT       4
//   Timeout Counter Clock Select
//     0b0 ==> Timeout counter counts at the frequency of the bus clock / 64
//     0b1 ==> Timeout counter counts at the frequency of the bus clock

#define  I2C0_SMB_SIICAEN_MASK       0x20u
#define  I2C0_SMB_SIICAEN_SHIFT      5
//   Second I2C Address Enable
//     0b0 ==> I2C address register 2 matching is disabled
//     0b1 ==> I2C address register 2 matching is enabled

#define  I2C0_SMB_ALERTEN_MASK       0x40u
#define  I2C0_SMB_ALERTEN_SHIFT      6
//   SMBus Alert Response Address Enable
//     0b0 ==> SMBus alert response address matching is disabled
//     0b1 ==> SMBus alert response address matching is enabled

#define  I2C0_SMB_FACK_MASK          0x80u
#define  I2C0_SMB_FACK_SHIFT         7
//   Fast NACK/ACK Enable
//     0b0 ==> An ACK or NACK is sent on the following receiving data byte
//     0b1 ==> Writing 0 to TXAK after receiving a data byte generates an ACK. Writing 1 to TXAK after receiving a data byte generates a NACK.

#define  I2C0_A2_SAD_MASK            0xEu
#define  I2C0_A2_SAD_SHIFT           1
#define  I2C0_A2_SAD(x)              (((uint8_t)(((uint8_t)(x))<<I2C0_A2_SAD_SHIFT))&I2C0_A2_SAD_MASK)
//   SMBus Address

#define  I2C0_SLTH_SSLT_MASK         0x8u
#define  I2C0_SLTH_SSLT_SHIFT        0
#define  I2C0_SLTH_SSLT(x)           (((uint8_t)(((uint8_t)(x))<<I2C0_SLTH_SSLT_SHIFT))&I2C0_SLTH_SSLT_MASK)

#define  I2C0_SLTL_SSLT_MASK         0x8u
#define  I2C0_SLTL_SSLT_SHIFT        0
#define  I2C0_SLTL_SSLT(x)           (((uint8_t)(((uint8_t)(x))<<I2C0_SLTL_SSLT_SHIFT))&I2C0_SLTL_SSLT_MASK)

#define  I2C1_A1_AD_MASK             0xEu
#define  I2C1_A1_AD_SHIFT            1
#define  I2C1_A1_AD(x)               (((uint8_t)(((uint8_t)(x))<<I2C1_A1_AD_SHIFT))&I2C1_A1_AD_MASK)
//   Address

#define  I2C1_F_ICR_MASK             0x6u
#define  I2C1_F_ICR_SHIFT            0
#define  I2C1_F_ICR(x)               (((uint8_t)(((uint8_t)(x))<<I2C1_F_ICR_SHIFT))&I2C1_F_ICR_MASK)
//   ClockRate

#define  I2C1_F_MULT_MASK            0x80u
#define  I2C1_F_MULT_SHIFT           6
#define  I2C1_F_MULT(x)              (((uint8_t)(((uint8_t)(x))<<I2C1_F_MULT_SHIFT))&I2C1_F_MULT_MASK)
//     0b00 ==> mul = 1
//     0b01 ==> mul = 2
//     0b10 ==> mul = 4
//     0b11 ==> Reserved

#define  I2C1_C1_DMAEN_MASK          0x1u
#define  I2C1_C1_DMAEN_SHIFT         0
//   DMA Enable
//     0b0 ==> All DMA signalling disabled.
//     0b1 ==> DMA transfer is enabled and the following conditions trigger the DMA request: While FACK = 0, a data byte is received, either address or data is transmitted. (ACK/NACK automatic) While FACK = 0, the first byte received matches the A1 register or is general call address. If any address matching occurs, IAAS and TCF are set. If the direction of transfer is known from master to slave, then it is not required to check the SRW. With this assumption, DMA can also be used in this
//             case. In other cases, if the master reads data from the slave, then it is required to rewrite the C1 register operation. With this assumption, DMA cannot be used. When FACK = 1, an address or a data byte is transmitted.

#define  I2C1_C1_WUEN_MASK           0x2u
#define  I2C1_C1_WUEN_SHIFT          1
//   Wakeup Enable
//     0b0 ==> Normal operation. No interrupt generated when address matching in low power mode.
//     0b1 ==> Enables the wakeup function in low power mode.

#define  I2C1_C1_RSTA_MASK           0x4u
#define  I2C1_C1_RSTA_SHIFT          2
//   Repeat START

#define  I2C1_C1_TXAK_MASK           0x8u
#define  I2C1_C1_TXAK_SHIFT          3
//   Transmit Acknowledge Enable
//     0b0 ==> An acknowledge signal is sent to the bus on the following receiving byte (if FACK is cleared) or the current receiving byte (if FACK is set).
//     0b1 ==> No acknowledge signal is sent to the bus on the following receiving data byte (if FACK is cleared) or the current receiving data byte (if FACK is set).

#define  I2C1_C1_TX_MASK             0x10u
#define  I2C1_C1_TX_SHIFT            4
//   Transmit Mode Select
//     0b0 ==> Receive
//     0b1 ==> Transmit

#define  I2C1_C1_MST_MASK            0x20u
#define  I2C1_C1_MST_SHIFT           5
//   Master Mode Select
//     0b0 ==> Slave mode
//     0b1 ==> Master mode

#define  I2C1_C1_IICIE_MASK          0x40u
#define  I2C1_C1_IICIE_SHIFT         6
//   I2C Interrupt Enable
//     0b0 ==> Disabled
//     0b1 ==> Enabled

#define  I2C1_C1_IICEN_MASK          0x80u
#define  I2C1_C1_IICEN_SHIFT         7
//   I2C Enable
//     0b0 ==> Disabled
//     0b1 ==> Enabled

#define  I2C1_S_RXAK_MASK            0x1u
#define  I2C1_S_RXAK_SHIFT           0
//   Receive Acknowledge
//     0b0 ==> Acknowledge signal was received after the completion of one byte of data transmission on the bus
//     0b1 ==> No acknowledge signal detected

#define  I2C1_S_IICIF_MASK           0x2u
#define  I2C1_S_IICIF_SHIFT          1
//   Interrupt Flag
//     0b0 ==> No interrupt pending
//     0b1 ==> Interrupt pending

#define  I2C1_S_SRW_MASK             0x4u
#define  I2C1_S_SRW_SHIFT            2
//   Slave Read/Write
//     0b0 ==> Slave receive, master writing to slave
//     0b1 ==> Slave transmit, master reading from slave

#define  I2C1_S_RAM_MASK             0x8u
#define  I2C1_S_RAM_SHIFT            3
//   Range Address Match
//     0b0 ==> Not addressed
//     0b1 ==> Addressed as a slave

#define  I2C1_S_ARBL_MASK            0x10u
#define  I2C1_S_ARBL_SHIFT           4
//   Arbitration Lost
//     0b0 ==> Standard bus operation.
//     0b1 ==> Loss of arbitration.

#define  I2C1_S_BUSY_MASK            0x20u
#define  I2C1_S_BUSY_SHIFT           5
//   Bus Busy
//     0b0 ==> Bus is idle
//     0b1 ==> Bus is busy

