iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  I2C1_S_IAAS_MASK            0x40u
#define  I2C1_S_IAAS_SHIFT           6
//   Addressed As A Slave
//     0b0 ==> Not addressed
//     0b1 ==> Addressed as a slave

#define  I2C1_S_TCF_MASK             0x80u
#define  I2C1_S_TCF_SHIFT            7
//   Transfer Complete Flag
//     0b0 ==> Transfer in progress
//     0b1 ==> Transfer complete

#define  I2C1_D_DATA_MASK            0x8u
#define  I2C1_D_DATA_SHIFT           0
#define  I2C1_D_DATA(x)              (((uint8_t)(((uint8_t)(x))<<I2C1_D_DATA_SHIFT))&I2C1_D_DATA_MASK)
//   Data

#define  I2C1_C2_AD_MASK             0x3u
#define  I2C1_C2_AD_SHIFT            0
#define  I2C1_C2_AD(x)               (((uint8_t)(((uint8_t)(x))<<I2C1_C2_AD_SHIFT))&I2C1_C2_AD_MASK)
//   Slave Address

#define  I2C1_C2_RMEN_MASK           0x8u
#define  I2C1_C2_RMEN_SHIFT          3
//   Range Address Matching Enable
//     0b0 ==> Range mode disabled. No address match occurs for an address within the range of values of the A1 and RA registers.
//     0b1 ==> Range mode enabled. Address matching occurs when a slave receives an address within the range of values of the A1 and RA registers.

#define  I2C1_C2_SBRC_MASK           0x10u
#define  I2C1_C2_SBRC_SHIFT          4
//   Slave Baud Rate Control
//     0b0 ==> The slave baud rate follows the master baud rate and clock stretching may occur
//     0b1 ==> Slave baud rate is independent of the master baud rate

#define  I2C1_C2_HDRS_MASK           0x20u
#define  I2C1_C2_HDRS_SHIFT          5
//   High Drive Select
//     0b0 ==> Normal drive mode
//     0b1 ==> High drive mode

#define  I2C1_C2_ADEXT_MASK          0x40u
#define  I2C1_C2_ADEXT_SHIFT         6
//   Address Extension
//     0b0 ==> 7-bit address scheme
//     0b1 ==> 10-bit address scheme

#define  I2C1_C2_GCAEN_MASK          0x80u
#define  I2C1_C2_GCAEN_SHIFT         7
//   General Call Address Enable
//     0b0 ==> Disabled
//     0b1 ==> Enabled

#define  I2C1_FLT_FLT_MASK           0x5u
#define  I2C1_FLT_FLT_SHIFT          0
#define  I2C1_FLT_FLT(x)             (((uint8_t)(((uint8_t)(x))<<I2C1_FLT_FLT_SHIFT))&I2C1_FLT_FLT_MASK)
//   I2C Programmable Filter Factor
//     0b0 ==> No filter/bypass

#define  I2C1_RA_RAD_MASK            0xEu
#define  I2C1_RA_RAD_SHIFT           1
#define  I2C1_RA_RAD(x)              (((uint8_t)(((uint8_t)(x))<<I2C1_RA_RAD_SHIFT))&I2C1_RA_RAD_MASK)
//   Range Slave Address

#define  I2C1_SMB_SHTF2IE_MASK       0x1u
#define  I2C1_SMB_SHTF2IE_SHIFT      0
//   SHTF2 Interrupt Enable
//     0b0 ==> SHTF2 interrupt is disabled
//     0b1 ==> SHTF2 interrupt is enabled

#define  I2C1_SMB_SHTF2_MASK         0x2u
#define  I2C1_SMB_SHTF2_SHIFT        1
//   SCL High Timeout Flag 2
//     0b0 ==> No SCL high and SDA low timeout occurs
//     0b1 ==> SCL high and SDA low timeout occurs

#define  I2C1_SMB_SHTF1_MASK         0x4u
#define  I2C1_SMB_SHTF1_SHIFT        2
//   SCL High Timeout Flag 1
//     0b0 ==> No SCL high and SDA high timeout occurs
//     0b1 ==> SCL high and SDA high timeout occurs

#define  I2C1_SMB_SLTF_MASK          0x8u
#define  I2C1_SMB_SLTF_SHIFT         3
//   SCL Low Timeout Flag
//     0b0 ==> No low timeout occurs
//     0b1 ==> Low timeout occurs

#define  I2C1_SMB_TCKSEL_MASK        0x10u
#define  I2C1_SMB_TCKSEL_SHIFT       4
//   Timeout Counter Clock Select
//     0b0 ==> Timeout counter counts at the frequency of the bus clock / 64
//     0b1 ==> Timeout counter counts at the frequency of the bus clock

#define  I2C1_SMB_SIICAEN_MASK       0x20u
#define  I2C1_SMB_SIICAEN_SHIFT      5
//   Second I2C Address Enable
//     0b0 ==> I2C address register 2 matching is disabled
//     0b1 ==> I2C address register 2 matching is enabled

#define  I2C1_SMB_ALERTEN_MASK       0x40u
#define  I2C1_SMB_ALERTEN_SHIFT      6
//   SMBus Alert Response Address Enable
//     0b0 ==> SMBus alert response address matching is disabled
//     0b1 ==> SMBus alert response address matching is enabled

#define  I2C1_SMB_FACK_MASK          0x80u
#define  I2C1_SMB_FACK_SHIFT         7
//   Fast NACK/ACK Enable
//     0b0 ==> An ACK or NACK is sent on the following receiving data byte
//     0b1 ==> Writing 0 to TXAK after receiving a data byte generates an ACK. Writing 1 to TXAK after receiving a data byte generates a NACK.

#define  I2C1_A2_SAD_MASK            0xEu
#define  I2C1_A2_SAD_SHIFT           1
#define  I2C1_A2_SAD(x)              (((uint8_t)(((uint8_t)(x))<<I2C1_A2_SAD_SHIFT))&I2C1_A2_SAD_MASK)
//   SMBus Address

#define  I2C1_SLTH_SSLT_MASK         0x8u
#define  I2C1_SLTH_SSLT_SHIFT        0
#define  I2C1_SLTH_SSLT(x)           (((uint8_t)(((uint8_t)(x))<<I2C1_SLTH_SSLT_SHIFT))&I2C1_SLTH_SSLT_MASK)

#define  I2C1_SLTL_SSLT_MASK         0x8u
#define  I2C1_SLTL_SSLT_SHIFT        0
#define  I2C1_SLTL_SSLT(x)           (((uint8_t)(((uint8_t)(x))<<I2C1_SLTL_SSLT_SHIFT))&I2C1_SLTL_SSLT_MASK)

#define  LCD_GCR_DUTY_MASK           0x3u
#define  LCD_GCR_DUTY_SHIFT          0
#define  LCD_GCR_DUTY(x)             (((uint32_t)(((uint32_t)(x))<<LCD_GCR_DUTY_SHIFT))&LCD_GCR_DUTY_MASK)
//   LCD duty select
//     0b000 ==> Use 1 BP (1/1 duty cycle).
//     0b001 ==> Use 2 BP (1/2 duty cycle).
//     0b010 ==> Use 3 BP (1/3 duty cycle).
//     0b011 ==> Use 4 BP (1/4 duty cycle). (Default)
//     0b100 ==> Use 5 BP (1/5 duty cycle).
//     0b101 ==> Use 6 BP (1/6 duty cycle).
//     0b110 ==> Use 7 BP (1/7 duty cycle).
//     0b111 ==> Use 8 BP (1/8 duty cycle).

#define  LCD_GCR_LCLK_MASK           0x18u
#define  LCD_GCR_LCLK_SHIFT          3
#define  LCD_GCR_LCLK(x)             (((uint32_t)(((uint32_t)(x))<<LCD_GCR_LCLK_SHIFT))&LCD_GCR_LCLK_MASK)
//   LCD Clock Prescaler

#define  LCD_GCR_SOURCE_MASK         0x40u
#define  LCD_GCR_SOURCE_SHIFT        6
//   LCD Clock Source Select
//     0b0 ==> Selects the default clock as the LCD clock source.
//     0b1 ==> Selects the alternate clock as the LCD clock source.

#define  LCD_GCR_LCDEN_MASK          0x80u
#define  LCD_GCR_LCDEN_SHIFT         7
//   LCD Driver Enable
//     0b0 ==> All front plane and back plane pins are disabled. The LCD controller system is also disabled, and all LCD waveform generation clocks are stopped. V LL3 is connected to V DD internally.
//     0b1 ==> LCD controller driver system is enabled, and front plane and back plane waveforms are generated. All LCD pins, LCD_Pn, enabled using the LCD Pin Enable register, output an LCD driver waveform. The back plane pins output an LCD driver back plane waveform based on the settings of DUTY[2:0]. Charge pump or resistor bias is enabled.

#define  LCD_GCR_LCDSTP_MASK         0x100u
#define  LCD_GCR_LCDSTP_SHIFT        8
//   LCD Stop
//     0b0 ==> Allows the LCD driver, charge pump, resistor bias network, and voltage regulator to continue running during Stop mode.
//     0b1 ==> Disables the LCD driver, charge pump, resistor bias network, and voltage regulator when MCU enters Stop mode.

