iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  LCD_GCR_LCDWAIT_MASK        0x200u
#define  LCD_GCR_LCDWAIT_SHIFT       9
//   LCD Wait
//     0b0 ==> Allows the LCD driver, charge pump, resistor bias network, and voltage regulator to continue running during Wait mode.
//     0b1 ==> Disables the LCD driver, charge pump, resistor bias network, and voltage regulator when MCU enters Wait mode.

#define  LCD_GCR_ALTDIV_MASK         0x2000u
#define  LCD_GCR_ALTDIV_SHIFT        12
#define  LCD_GCR_ALTDIV(x)           (((uint32_t)(((uint32_t)(x))<<LCD_GCR_ALTDIV_SHIFT))&LCD_GCR_ALTDIV_MASK)
//   LCD AlternateClock Divider
//     0b0 ==> Divide factor = 1 (No divide)
//     0b1 ==> Divide factor = 8

#define  LCD_GCR_FDCIEN_MASK         0x4000u
#define  LCD_GCR_FDCIEN_SHIFT        14
//   LCD Fault Detection Complete Interrupt Enable
//     0b0 ==> No interrupt request is generated by this event.
//     0b1 ==> When a fault is detected and FDCF bit is set, this event causes an interrupt request.

#define  LCD_GCR_LCDIEN_MASK         0x8000u
#define  LCD_GCR_LCDIEN_SHIFT        15
//   LCD Frame Frequency Interrupt Enable
//     0b0 ==> No interrupt request is generated by this event.
//     0b1 ==> When LCDIF bit is set, this event causes an interrupt request.

#define  LCD_GCR_VSUPPLY_MASK        0x20000u
#define  LCD_GCR_VSUPPLY_SHIFT       16
#define  LCD_GCR_VSUPPLY(x)          (((uint32_t)(((uint32_t)(x))<<LCD_GCR_VSUPPLY_SHIFT))&LCD_GCR_VSUPPLY_MASK)
//   Voltage Supply Control
//     0b00 ==> Drive V LL2 internally from V DD .
//     0b01 ==> Drive V LL3 internally from V DD .
//     0b10 ==> Reserved
//     0b11 ==> Drive V LL3 externally from V DD or drive V LL1 internally from V IREG .

#define  LCD_GCR_LADJ_MASK           0x200000u
#define  LCD_GCR_LADJ_SHIFT          20
#define  LCD_GCR_LADJ(x)             (((uint32_t)(((uint32_t)(x))<<LCD_GCR_LADJ_SHIFT))&LCD_GCR_LADJ_MASK)
//   Load Adjust

#define  LCD_GCR_HREFSEL_MASK        0x400000u
#define  LCD_GCR_HREFSEL_SHIFT       22
//   High Reference Select
//     0b0 ==> Divide input, V IREG = 1.0 V for 3 V glass.
//     0b1 ==> Do not divide the input, V IREG = 1.67 V for 5 V glass.

#define  LCD_GCR_CPSEL_MASK          0x800000u
#define  LCD_GCR_CPSEL_SHIFT         23
//   Charge Pump or Resistor Bias Select
//     0b0 ==> LCD charge pump is disabled. Resistor network selected. (The internal 1/3-bias is forced.)
//     0b1 ==> LCD charge pump is selected. Resistor network disabled. (The internal 1/3-bias is forced.)

#define  LCD_GCR_RVTRIM_MASK         0x4000000u
#define  LCD_GCR_RVTRIM_SHIFT        24
#define  LCD_GCR_RVTRIM(x)           (((uint32_t)(((uint32_t)(x))<<LCD_GCR_RVTRIM_SHIFT))&LCD_GCR_RVTRIM_MASK)
//   Regulated Voltage Trim

#define  LCD_GCR_RVEN_MASK           0x80000000u
#define  LCD_GCR_RVEN_SHIFT          31
//   Regulated Voltage Enable
//     0b0 ==> Regulated voltage disabled.
//     0b1 ==> Regulated voltage enabled.

#define  LCD_AR_BRATE_MASK           0x3u
#define  LCD_AR_BRATE_SHIFT          0
#define  LCD_AR_BRATE(x)             (((uint32_t)(((uint32_t)(x))<<LCD_AR_BRATE_SHIFT))&LCD_AR_BRATE_MASK)
//   Blink-rate configuration

#define  LCD_AR_BMODE_MASK           0x8u
#define  LCD_AR_BMODE_SHIFT          3
//   Blink mode
//     0b0 ==> Display blank during the blink period.
//     0b1 ==> Display alternate display during blink period (Ignored if duty is 5 or greater).

#define  LCD_AR_BLANK_MASK           0x20u
#define  LCD_AR_BLANK_SHIFT          5
//   Blank display mode
//     0b0 ==> Normal or alternate display mode.
//     0b1 ==> Blank display mode.

#define  LCD_AR_ALT_MASK             0x40u
#define  LCD_AR_ALT_SHIFT            6
//   Alternate display mode
//     0b0 ==> Normal display mode.
//     0b1 ==> Alternate display mode.

#define  LCD_AR_BLINK_MASK           0x80u
#define  LCD_AR_BLINK_SHIFT          7
//   Blink command
//     0b0 ==> Disables blinking.
//     0b1 ==> Starts blinking at blinking frequency specified by LCD blink rate calculation.

#define  LCD_AR_LCDIF_MASK           0x8000u
#define  LCD_AR_LCDIF_SHIFT          15
//   LCD Frame Frequency Interrupt flag
//     0b0 ==> Frame frequency interrupt condition has not occurred.
//     0b1 ==> Start of SLCD frame has occurred.

#define  LCD_FDCR_FDPINID_MASK       0x6u
#define  LCD_FDCR_FDPINID_SHIFT      0
#define  LCD_FDCR_FDPINID(x)         (((uint32_t)(((uint32_t)(x))<<LCD_FDCR_FDPINID_SHIFT))&LCD_FDCR_FDPINID_MASK)
//   Fault Detect Pin ID
//     0b0 ==> Fault detection for LCD_P0 pin.
//     0b1 ==> Fault detection for LCD_P1 pin.

#define  LCD_FDCR_FDBPEN_MASK        0x40u
#define  LCD_FDCR_FDBPEN_SHIFT       6
//   Fault Detect Back Plane Enable
//     0b0 ==> Type of the selected pin under fault detect test is front plane.
//     0b1 ==> Type of the selected pin under fault detect test is back plane.

#define  LCD_FDCR_FDEN_MASK          0x80u
#define  LCD_FDCR_FDEN_SHIFT         7
//   Fault Detect Enable
//     0b0 ==> Disable fault detection.
//     0b1 ==> Enable fault detection.

#define  LCD_FDCR_FDSWW_MASK         0x600u
#define  LCD_FDCR_FDSWW_SHIFT        9
#define  LCD_FDCR_FDSWW(x)           (((uint32_t)(((uint32_t)(x))<<LCD_FDCR_FDSWW_SHIFT))&LCD_FDCR_FDSWW_MASK)
//   Fault Detect Sample Window Width
//     0b0 ==> Sample window width is 4 sample clock cycles.
//     0b1 ==> Sample window width is 8 sample clock cycles.

#define  LCD_FDCR_FDPRS_MASK         0x3000u
#define  LCD_FDCR_FDPRS_SHIFT        12
#define  LCD_FDCR_FDPRS(x)           (((uint32_t)(((uint32_t)(x))<<LCD_FDCR_FDPRS_SHIFT))&LCD_FDCR_FDPRS_MASK)
//   Fault Detect Clock Prescaler
//     0b0 ==> 1/1 bus clock.
//     0b1 ==> 1/2 bus clock.

#define  LCD_FDSR_FDCNT_MASK         0x8u
#define  LCD_FDSR_FDCNT_SHIFT        0
#define  LCD_FDSR_FDCNT(x)           (((uint32_t)(((uint32_t)(x))<<LCD_FDSR_FDCNT_SHIFT))&LCD_FDSR_FDCNT_MASK)
//   Fault Detect Counter
//     0b0 ==> No "one" samples.
//     0b1 ==> 1 "one" samples.

#define  LCD_FDSR_FDCF_MASK          0x8000u
#define  LCD_FDSR_FDCF_SHIFT         15
//   Fault Detection Complete Flag
//     0b0 ==> Fault detection is not completed.
//     0b1 ==> Fault detection is completed.

