iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  LCD_PENL_PEN_MASK           0x20u
#define  LCD_PENL_PEN_SHIFT          0
#define  LCD_PENL_PEN(x)             (((uint32_t)(((uint32_t)(x))<<LCD_PENL_PEN_SHIFT))&LCD_PENL_PEN_MASK)
//   LCD Pin Enable
//     0b0 ==> LCD operation disabled on LCD_Pn.
//     0b1 ==> LCD operation enabled on LCD_Pn.

#define  LCD_PENH_PEN_MASK           0x20u
#define  LCD_PENH_PEN_SHIFT          0
#define  LCD_PENH_PEN(x)             (((uint32_t)(((uint32_t)(x))<<LCD_PENH_PEN_SHIFT))&LCD_PENH_PEN_MASK)
//   LCD Pin Enable
//     0b0 ==> LCD operation disabled on LCD_Pn.
//     0b1 ==> LCD operation enabled on LCD_Pn.

#define  LCD_BPENL_BPEN_MASK         0x20u
#define  LCD_BPENL_BPEN_SHIFT        0
#define  LCD_BPENL_BPEN(x)           (((uint32_t)(((uint32_t)(x))<<LCD_BPENL_BPEN_SHIFT))&LCD_BPENL_BPEN_MASK)
//   Back Plane Enable
//     0b0 ==> Front plane operation enabled on LCD_Pn.
//     0b1 ==> Back plane operation enabled on LCD_Pn.

#define  LCD_BPENH_BPEN_MASK         0x20u
#define  LCD_BPENH_BPEN_SHIFT        0
#define  LCD_BPENH_BPEN(x)           (((uint32_t)(((uint32_t)(x))<<LCD_BPENH_BPEN_SHIFT))&LCD_BPENH_BPEN_MASK)
//   Back Plane Enable
//     0b0 ==> Front plane operation enabled on LCD_Pn.
//     0b1 ==> Back plane operation enabled on LCD_Pn.

#define  LCD_WF3TO0_WF0_MASK         0x8u
#define  LCD_WF3TO0_WF0_SHIFT        0
#define  LCD_WF3TO0_WF0(x)           (((uint32_t)(((uint32_t)(x))<<LCD_WF3TO0_WF0_SHIFT))&LCD_WF3TO0_WF0_MASK)

#define  LCD_WF3TO0_WF1_MASK         0x800u
#define  LCD_WF3TO0_WF1_SHIFT        8
#define  LCD_WF3TO0_WF1(x)           (((uint32_t)(((uint32_t)(x))<<LCD_WF3TO0_WF1_SHIFT))&LCD_WF3TO0_WF1_MASK)

#define  LCD_WF3TO0_WF2_MASK         0x80000u
#define  LCD_WF3TO0_WF2_SHIFT        16
#define  LCD_WF3TO0_WF2(x)           (((uint32_t)(((uint32_t)(x))<<LCD_WF3TO0_WF2_SHIFT))&LCD_WF3TO0_WF2_MASK)

#define  LCD_WF3TO0_WF3_MASK         0x8000000u
#define  LCD_WF3TO0_WF3_SHIFT        24
#define  LCD_WF3TO0_WF3(x)           (((uint32_t)(((uint32_t)(x))<<LCD_WF3TO0_WF3_SHIFT))&LCD_WF3TO0_WF3_MASK)

#define  LCD_WF7TO4_WF4_MASK         0x8u
#define  LCD_WF7TO4_WF4_SHIFT        0
#define  LCD_WF7TO4_WF4(x)           (((uint32_t)(((uint32_t)(x))<<LCD_WF7TO4_WF4_SHIFT))&LCD_WF7TO4_WF4_MASK)

#define  LCD_WF7TO4_WF5_MASK         0x800u
#define  LCD_WF7TO4_WF5_SHIFT        8
#define  LCD_WF7TO4_WF5(x)           (((uint32_t)(((uint32_t)(x))<<LCD_WF7TO4_WF5_SHIFT))&LCD_WF7TO4_WF5_MASK)

#define  LCD_WF7TO4_WF6_MASK         0x80000u
#define  LCD_WF7TO4_WF6_SHIFT        16
#define  LCD_WF7TO4_WF6(x)           (((uint32_t)(((uint32_t)(x))<<LCD_WF7TO4_WF6_SHIFT))&LCD_WF7TO4_WF6_MASK)

#define  LCD_WF7TO4_WF7_MASK         0x8000000u
#define  LCD_WF7TO4_WF7_SHIFT        24
#define  LCD_WF7TO4_WF7(x)           (((uint32_t)(((uint32_t)(x))<<LCD_WF7TO4_WF7_SHIFT))&LCD_WF7TO4_WF7_MASK)

#define  LCD_WF11TO8_WF8_MASK        0x8u
#define  LCD_WF11TO8_WF8_SHIFT       0
#define  LCD_WF11TO8_WF8(x)          (((uint32_t)(((uint32_t)(x))<<LCD_WF11TO8_WF8_SHIFT))&LCD_WF11TO8_WF8_MASK)

#define  LCD_WF11TO8_WF9_MASK        0x800u
#define  LCD_WF11TO8_WF9_SHIFT       8
#define  LCD_WF11TO8_WF9(x)          (((uint32_t)(((uint32_t)(x))<<LCD_WF11TO8_WF9_SHIFT))&LCD_WF11TO8_WF9_MASK)

#define  LCD_WF11TO8_WF10_MASK       0x80000u
#define  LCD_WF11TO8_WF10_SHIFT      16
#define  LCD_WF11TO8_WF10(x)         (((uint32_t)(((uint32_t)(x))<<LCD_WF11TO8_WF10_SHIFT))&LCD_WF11TO8_WF10_MASK)

#define  LCD_WF11TO8_WF11_MASK       0x8000000u
#define  LCD_WF11TO8_WF11_SHIFT      24
#define  LCD_WF11TO8_WF11(x)         (((uint32_t)(((uint32_t)(x))<<LCD_WF11TO8_WF11_SHIFT))&LCD_WF11TO8_WF11_MASK)

#define  LCD_WF15TO12_WF12_MASK      0x8u
#define  LCD_WF15TO12_WF12_SHIFT     0
#define  LCD_WF15TO12_WF12(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF15TO12_WF12_SHIFT))&LCD_WF15TO12_WF12_MASK)

#define  LCD_WF15TO12_WF13_MASK      0x800u
#define  LCD_WF15TO12_WF13_SHIFT     8
#define  LCD_WF15TO12_WF13(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF15TO12_WF13_SHIFT))&LCD_WF15TO12_WF13_MASK)

#define  LCD_WF15TO12_WF14_MASK      0x80000u
#define  LCD_WF15TO12_WF14_SHIFT     16
#define  LCD_WF15TO12_WF14(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF15TO12_WF14_SHIFT))&LCD_WF15TO12_WF14_MASK)

#define  LCD_WF15TO12_WF15_MASK      0x8000000u
#define  LCD_WF15TO12_WF15_SHIFT     24
#define  LCD_WF15TO12_WF15(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF15TO12_WF15_SHIFT))&LCD_WF15TO12_WF15_MASK)

#define  LCD_WF19TO16_WF16_MASK      0x8u
#define  LCD_WF19TO16_WF16_SHIFT     0
#define  LCD_WF19TO16_WF16(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF19TO16_WF16_SHIFT))&LCD_WF19TO16_WF16_MASK)

#define  LCD_WF19TO16_WF17_MASK      0x800u
#define  LCD_WF19TO16_WF17_SHIFT     8
#define  LCD_WF19TO16_WF17(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF19TO16_WF17_SHIFT))&LCD_WF19TO16_WF17_MASK)

#define  LCD_WF19TO16_WF18_MASK      0x80000u
#define  LCD_WF19TO16_WF18_SHIFT     16
#define  LCD_WF19TO16_WF18(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF19TO16_WF18_SHIFT))&LCD_WF19TO16_WF18_MASK)

#define  LCD_WF19TO16_WF19_MASK      0x8000000u
#define  LCD_WF19TO16_WF19_SHIFT     24
#define  LCD_WF19TO16_WF19(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF19TO16_WF19_SHIFT))&LCD_WF19TO16_WF19_MASK)

#define  LCD_WF23TO20_WF20_MASK      0x8u
#define  LCD_WF23TO20_WF20_SHIFT     0
#define  LCD_WF23TO20_WF20(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF23TO20_WF20_SHIFT))&LCD_WF23TO20_WF20_MASK)

#define  LCD_WF23TO20_WF21_MASK      0x800u
#define  LCD_WF23TO20_WF21_SHIFT     8
#define  LCD_WF23TO20_WF21(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF23TO20_WF21_SHIFT))&LCD_WF23TO20_WF21_MASK)

#define  LCD_WF23TO20_WF22_MASK      0x80000u
#define  LCD_WF23TO20_WF22_SHIFT     16
#define  LCD_WF23TO20_WF22(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF23TO20_WF22_SHIFT))&LCD_WF23TO20_WF22_MASK)

#define  LCD_WF23TO20_WF23_MASK      0x8000000u
#define  LCD_WF23TO20_WF23_SHIFT     24
#define  LCD_WF23TO20_WF23(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF23TO20_WF23_SHIFT))&LCD_WF23TO20_WF23_MASK)

#define  LCD_WF27TO24_WF24_MASK      0x8u
#define  LCD_WF27TO24_WF24_SHIFT     0
#define  LCD_WF27TO24_WF24(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF27TO24_WF24_SHIFT))&LCD_WF27TO24_WF24_MASK)

#define  LCD_WF27TO24_WF25_MASK      0x800u
#define  LCD_WF27TO24_WF25_SHIFT     8
#define  LCD_WF27TO24_WF25(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF27TO24_WF25_SHIFT))&LCD_WF27TO24_WF25_MASK)

#define  LCD_WF27TO24_WF26_MASK      0x80000u
#define  LCD_WF27TO24_WF26_SHIFT     16
#define  LCD_WF27TO24_WF26(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF27TO24_WF26_SHIFT))&LCD_WF27TO24_WF26_MASK)

#define  LCD_WF27TO24_WF27_MASK      0x8000000u
#define  LCD_WF27TO24_WF27_SHIFT     24
#define  LCD_WF27TO24_WF27(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF27TO24_WF27_SHIFT))&LCD_WF27TO24_WF27_MASK)

#define  LCD_WF31TO28_WF28_MASK      0x8u
#define  LCD_WF31TO28_WF28_SHIFT     0
#define  LCD_WF31TO28_WF28(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF31TO28_WF28_SHIFT))&LCD_WF31TO28_WF28_MASK)

