iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  LCD_WF31TO28_WF29_MASK      0x800u
#define  LCD_WF31TO28_WF29_SHIFT     8
#define  LCD_WF31TO28_WF29(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF31TO28_WF29_SHIFT))&LCD_WF31TO28_WF29_MASK)

#define  LCD_WF31TO28_WF30_MASK      0x80000u
#define  LCD_WF31TO28_WF30_SHIFT     16
#define  LCD_WF31TO28_WF30(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF31TO28_WF30_SHIFT))&LCD_WF31TO28_WF30_MASK)

#define  LCD_WF31TO28_WF31_MASK      0x8000000u
#define  LCD_WF31TO28_WF31_SHIFT     24
#define  LCD_WF31TO28_WF31(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF31TO28_WF31_SHIFT))&LCD_WF31TO28_WF31_MASK)

#define  LCD_WF35TO32_WF32_MASK      0x8u
#define  LCD_WF35TO32_WF32_SHIFT     0
#define  LCD_WF35TO32_WF32(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF35TO32_WF32_SHIFT))&LCD_WF35TO32_WF32_MASK)

#define  LCD_WF35TO32_WF33_MASK      0x800u
#define  LCD_WF35TO32_WF33_SHIFT     8
#define  LCD_WF35TO32_WF33(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF35TO32_WF33_SHIFT))&LCD_WF35TO32_WF33_MASK)

#define  LCD_WF35TO32_WF34_MASK      0x80000u
#define  LCD_WF35TO32_WF34_SHIFT     16
#define  LCD_WF35TO32_WF34(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF35TO32_WF34_SHIFT))&LCD_WF35TO32_WF34_MASK)

#define  LCD_WF35TO32_WF35_MASK      0x8000000u
#define  LCD_WF35TO32_WF35_SHIFT     24
#define  LCD_WF35TO32_WF35(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF35TO32_WF35_SHIFT))&LCD_WF35TO32_WF35_MASK)

#define  LCD_WF39TO36_WF36_MASK      0x8u
#define  LCD_WF39TO36_WF36_SHIFT     0
#define  LCD_WF39TO36_WF36(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF39TO36_WF36_SHIFT))&LCD_WF39TO36_WF36_MASK)

#define  LCD_WF39TO36_WF37_MASK      0x800u
#define  LCD_WF39TO36_WF37_SHIFT     8
#define  LCD_WF39TO36_WF37(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF39TO36_WF37_SHIFT))&LCD_WF39TO36_WF37_MASK)

#define  LCD_WF39TO36_WF38_MASK      0x80000u
#define  LCD_WF39TO36_WF38_SHIFT     16
#define  LCD_WF39TO36_WF38(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF39TO36_WF38_SHIFT))&LCD_WF39TO36_WF38_MASK)

#define  LCD_WF39TO36_WF39_MASK      0x8000000u
#define  LCD_WF39TO36_WF39_SHIFT     24
#define  LCD_WF39TO36_WF39(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF39TO36_WF39_SHIFT))&LCD_WF39TO36_WF39_MASK)

#define  LCD_WF43TO40_WF40_MASK      0x8u
#define  LCD_WF43TO40_WF40_SHIFT     0
#define  LCD_WF43TO40_WF40(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF43TO40_WF40_SHIFT))&LCD_WF43TO40_WF40_MASK)

#define  LCD_WF43TO40_WF41_MASK      0x800u
#define  LCD_WF43TO40_WF41_SHIFT     8
#define  LCD_WF43TO40_WF41(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF43TO40_WF41_SHIFT))&LCD_WF43TO40_WF41_MASK)

#define  LCD_WF43TO40_WF42_MASK      0x80000u
#define  LCD_WF43TO40_WF42_SHIFT     16
#define  LCD_WF43TO40_WF42(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF43TO40_WF42_SHIFT))&LCD_WF43TO40_WF42_MASK)

#define  LCD_WF43TO40_WF43_MASK      0x8000000u
#define  LCD_WF43TO40_WF43_SHIFT     24
#define  LCD_WF43TO40_WF43(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF43TO40_WF43_SHIFT))&LCD_WF43TO40_WF43_MASK)

#define  LCD_WF47TO44_WF44_MASK      0x8u
#define  LCD_WF47TO44_WF44_SHIFT     0
#define  LCD_WF47TO44_WF44(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF47TO44_WF44_SHIFT))&LCD_WF47TO44_WF44_MASK)

#define  LCD_WF47TO44_WF45_MASK      0x800u
#define  LCD_WF47TO44_WF45_SHIFT     8
#define  LCD_WF47TO44_WF45(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF47TO44_WF45_SHIFT))&LCD_WF47TO44_WF45_MASK)

#define  LCD_WF47TO44_WF46_MASK      0x80000u
#define  LCD_WF47TO44_WF46_SHIFT     16
#define  LCD_WF47TO44_WF46(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF47TO44_WF46_SHIFT))&LCD_WF47TO44_WF46_MASK)

#define  LCD_WF47TO44_WF47_MASK      0x8000000u
#define  LCD_WF47TO44_WF47_SHIFT     24
#define  LCD_WF47TO44_WF47(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF47TO44_WF47_SHIFT))&LCD_WF47TO44_WF47_MASK)

#define  LCD_WF51TO48_WF48_MASK      0x8u
#define  LCD_WF51TO48_WF48_SHIFT     0
#define  LCD_WF51TO48_WF48(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF51TO48_WF48_SHIFT))&LCD_WF51TO48_WF48_MASK)

#define  LCD_WF51TO48_WF49_MASK      0x800u
#define  LCD_WF51TO48_WF49_SHIFT     8
#define  LCD_WF51TO48_WF49(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF51TO48_WF49_SHIFT))&LCD_WF51TO48_WF49_MASK)

#define  LCD_WF51TO48_WF50_MASK      0x80000u
#define  LCD_WF51TO48_WF50_SHIFT     16
#define  LCD_WF51TO48_WF50(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF51TO48_WF50_SHIFT))&LCD_WF51TO48_WF50_MASK)

#define  LCD_WF51TO48_WF51_MASK      0x8000000u
#define  LCD_WF51TO48_WF51_SHIFT     24
#define  LCD_WF51TO48_WF51(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF51TO48_WF51_SHIFT))&LCD_WF51TO48_WF51_MASK)

#define  LCD_WF55TO52_WF52_MASK      0x8u
#define  LCD_WF55TO52_WF52_SHIFT     0
#define  LCD_WF55TO52_WF52(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF55TO52_WF52_SHIFT))&LCD_WF55TO52_WF52_MASK)

#define  LCD_WF55TO52_WF53_MASK      0x800u
#define  LCD_WF55TO52_WF53_SHIFT     8
#define  LCD_WF55TO52_WF53(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF55TO52_WF53_SHIFT))&LCD_WF55TO52_WF53_MASK)

#define  LCD_WF55TO52_WF54_MASK      0x80000u
#define  LCD_WF55TO52_WF54_SHIFT     16
#define  LCD_WF55TO52_WF54(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF55TO52_WF54_SHIFT))&LCD_WF55TO52_WF54_MASK)

#define  LCD_WF55TO52_WF55_MASK      0x8000000u
#define  LCD_WF55TO52_WF55_SHIFT     24
#define  LCD_WF55TO52_WF55(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF55TO52_WF55_SHIFT))&LCD_WF55TO52_WF55_MASK)

#define  LCD_WF59TO56_WF56_MASK      0x8u
#define  LCD_WF59TO56_WF56_SHIFT     0
#define  LCD_WF59TO56_WF56(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF59TO56_WF56_SHIFT))&LCD_WF59TO56_WF56_MASK)

#define  LCD_WF59TO56_WF57_MASK      0x800u
#define  LCD_WF59TO56_WF57_SHIFT     8
#define  LCD_WF59TO56_WF57(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF59TO56_WF57_SHIFT))&LCD_WF59TO56_WF57_MASK)

#define  LCD_WF59TO56_WF58_MASK      0x80000u
#define  LCD_WF59TO56_WF58_SHIFT     16
#define  LCD_WF59TO56_WF58(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF59TO56_WF58_SHIFT))&LCD_WF59TO56_WF58_MASK)

#define  LCD_WF59TO56_WF59_MASK      0x8000000u
#define  LCD_WF59TO56_WF59_SHIFT     24
#define  LCD_WF59TO56_WF59(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF59TO56_WF59_SHIFT))&LCD_WF59TO56_WF59_MASK)

#define  LCD_WF63TO60_WF60_MASK      0x8u
#define  LCD_WF63TO60_WF60_SHIFT     0
#define  LCD_WF63TO60_WF60(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF63TO60_WF60_SHIFT))&LCD_WF63TO60_WF60_MASK)

