iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  LCD_WF63TO60_WF61_MASK      0x800u
#define  LCD_WF63TO60_WF61_SHIFT     8
#define  LCD_WF63TO60_WF61(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF63TO60_WF61_SHIFT))&LCD_WF63TO60_WF61_MASK)

#define  LCD_WF63TO60_WF62_MASK      0x80000u
#define  LCD_WF63TO60_WF62_SHIFT     16
#define  LCD_WF63TO60_WF62(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF63TO60_WF62_SHIFT))&LCD_WF63TO60_WF62_MASK)

#define  LCD_WF63TO60_WF63_MASK      0x8000000u
#define  LCD_WF63TO60_WF63_SHIFT     24
#define  LCD_WF63TO60_WF63(x)        (((uint32_t)(((uint32_t)(x))<<LCD_WF63TO60_WF63_SHIFT))&LCD_WF63TO60_WF63_MASK)

#define  LLWU_PE1_WUPE0_MASK         0x2u
#define  LLWU_PE1_WUPE0_SHIFT        0
#define  LLWU_PE1_WUPE0(x)           (((uint8_t)(((uint8_t)(x))<<LLWU_PE1_WUPE0_SHIFT))&LLWU_PE1_WUPE0_MASK)
//   Wakeup Pin Enable For LLWU_P0
//     0b00 ==> External input pin disabled as wakeup input
//     0b01 ==> External input pin enabled with rising edge detection
//     0b10 ==> External input pin enabled with falling edge detection
//     0b11 ==> External input pin enabled with any change detection

#define  LLWU_PE1_WUPE1_MASK         0x8u
#define  LLWU_PE1_WUPE1_SHIFT        2
#define  LLWU_PE1_WUPE1(x)           (((uint8_t)(((uint8_t)(x))<<LLWU_PE1_WUPE1_SHIFT))&LLWU_PE1_WUPE1_MASK)
//   Wakeup Pin Enable For LLWU_P1
//     0b00 ==> External input pin disabled as wakeup input
//     0b01 ==> External input pin enabled with rising edge detection
//     0b10 ==> External input pin enabled with falling edge detection
//     0b11 ==> External input pin enabled with any change detection

#define  LLWU_PE1_WUPE2_MASK         0x20u
#define  LLWU_PE1_WUPE2_SHIFT        4
#define  LLWU_PE1_WUPE2(x)           (((uint8_t)(((uint8_t)(x))<<LLWU_PE1_WUPE2_SHIFT))&LLWU_PE1_WUPE2_MASK)
//   Wakeup Pin Enable For LLWU_P2
//     0b00 ==> External input pin disabled as wakeup input
//     0b01 ==> External input pin enabled with rising edge detection
//     0b10 ==> External input pin enabled with falling edge detection
//     0b11 ==> External input pin enabled with any change detection

#define  LLWU_PE1_WUPE3_MASK         0x80u
#define  LLWU_PE1_WUPE3_SHIFT        6
#define  LLWU_PE1_WUPE3(x)           (((uint8_t)(((uint8_t)(x))<<LLWU_PE1_WUPE3_SHIFT))&LLWU_PE1_WUPE3_MASK)
//   Wakeup Pin Enable For LLWU_P3
//     0b00 ==> External input pin disabled as wakeup input
//     0b01 ==> External input pin enabled with rising edge detection
//     0b10 ==> External input pin enabled with falling edge detection
//     0b11 ==> External input pin enabled with any change detection

#define  LLWU_PE2_WUPE4_MASK         0x2u
#define  LLWU_PE2_WUPE4_SHIFT        0
#define  LLWU_PE2_WUPE4(x)           (((uint8_t)(((uint8_t)(x))<<LLWU_PE2_WUPE4_SHIFT))&LLWU_PE2_WUPE4_MASK)
//   Wakeup Pin Enable For LLWU_P4
//     0b00 ==> External input pin disabled as wakeup input
//     0b01 ==> External input pin enabled with rising edge detection
//     0b10 ==> External input pin enabled with falling edge detection
//     0b11 ==> External input pin enabled with any change detection

#define  LLWU_PE2_WUPE5_MASK         0x8u
#define  LLWU_PE2_WUPE5_SHIFT        2
#define  LLWU_PE2_WUPE5(x)           (((uint8_t)(((uint8_t)(x))<<LLWU_PE2_WUPE5_SHIFT))&LLWU_PE2_WUPE5_MASK)
//   Wakeup Pin Enable For LLWU_P5
//     0b00 ==> External input pin disabled as wakeup input
//     0b01 ==> External input pin enabled with rising edge detection
//     0b10 ==> External input pin enabled with falling edge detection
//     0b11 ==> External input pin enabled with any change detection

#define  LLWU_PE2_WUPE6_MASK         0x20u
#define  LLWU_PE2_WUPE6_SHIFT        4
#define  LLWU_PE2_WUPE6(x)           (((uint8_t)(((uint8_t)(x))<<LLWU_PE2_WUPE6_SHIFT))&LLWU_PE2_WUPE6_MASK)
//   Wakeup Pin Enable For LLWU_P6
//     0b00 ==> External input pin disabled as wakeup input
//     0b01 ==> External input pin enabled with rising edge detection
//     0b10 ==> External input pin enabled with falling edge detection
//     0b11 ==> External input pin enabled with any change detection

#define  LLWU_PE2_WUPE7_MASK         0x80u
#define  LLWU_PE2_WUPE7_SHIFT        6
#define  LLWU_PE2_WUPE7(x)           (((uint8_t)(((uint8_t)(x))<<LLWU_PE2_WUPE7_SHIFT))&LLWU_PE2_WUPE7_MASK)
//   Wakeup Pin Enable For LLWU_P7
//     0b00 ==> External input pin disabled as wakeup input
//     0b01 ==> External input pin enabled with rising edge detection
//     0b10 ==> External input pin enabled with falling edge detection
//     0b11 ==> External input pin enabled with any change detection

#define  LLWU_PE3_WUPE8_MASK         0x2u
#define  LLWU_PE3_WUPE8_SHIFT        0
#define  LLWU_PE3_WUPE8(x)           (((uint8_t)(((uint8_t)(x))<<LLWU_PE3_WUPE8_SHIFT))&LLWU_PE3_WUPE8_MASK)
//   Wakeup Pin Enable For LLWU_P8
//     0b00 ==> External input pin disabled as wakeup input
//     0b01 ==> External input pin enabled with rising edge detection
//     0b10 ==> External input pin enabled with falling edge detection
//     0b11 ==> External input pin enabled with any change detection

#define  LLWU_PE3_WUPE9_MASK         0x8u
#define  LLWU_PE3_WUPE9_SHIFT        2
#define  LLWU_PE3_WUPE9(x)           (((uint8_t)(((uint8_t)(x))<<LLWU_PE3_WUPE9_SHIFT))&LLWU_PE3_WUPE9_MASK)
//   Wakeup Pin Enable For LLWU_P9
//     0b00 ==> External input pin disabled as wakeup input
//     0b01 ==> External input pin enabled with rising edge detection
//     0b10 ==> External input pin enabled with falling edge detection
//     0b11 ==> External input pin enabled with any change detection

#define  LLWU_PE3_WUPE10_MASK        0x20u
#define  LLWU_PE3_WUPE10_SHIFT       4
#define  LLWU_PE3_WUPE10(x)          (((uint8_t)(((uint8_t)(x))<<LLWU_PE3_WUPE10_SHIFT))&LLWU_PE3_WUPE10_MASK)
//   Wakeup Pin Enable For LLWU_P10
//     0b00 ==> External input pin disabled as wakeup input
//     0b01 ==> External input pin enabled with rising edge detection
//     0b10 ==> External input pin enabled with falling edge detection
//     0b11 ==> External input pin enabled with any change detection

#define  LLWU_PE3_WUPE11_MASK        0x80u
#define  LLWU_PE3_WUPE11_SHIFT       6
#define  LLWU_PE3_WUPE11(x)          (((uint8_t)(((uint8_t)(x))<<LLWU_PE3_WUPE11_SHIFT))&LLWU_PE3_WUPE11_MASK)
//   Wakeup Pin Enable For LLWU_P11
//     0b00 ==> External input pin disabled as wakeup input
//     0b01 ==> External input pin enabled with rising edge detection
//     0b10 ==> External input pin enabled with falling edge detection
//     0b11 ==> External input pin enabled with any change detection

