iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  LLWU_F2_WUF11_MASK          0x8u
#define  LLWU_F2_WUF11_SHIFT         3
//   Wakeup Flag For LLWU_P11
//     0b0 ==> LLWU_P11 input was not a wakeup source
//     0b1 ==> LLWU_P11 input was a wakeup source

#define  LLWU_F2_WUF12_MASK          0x10u
#define  LLWU_F2_WUF12_SHIFT         4
//   Wakeup Flag For LLWU_P12
//     0b0 ==> LLWU_P12 input was not a wakeup source
//     0b1 ==> LLWU_P12 input was a wakeup source

#define  LLWU_F2_WUF13_MASK          0x20u
#define  LLWU_F2_WUF13_SHIFT         5
//   Wakeup Flag For LLWU_P13
//     0b0 ==> LLWU_P13 input was not a wakeup source
//     0b1 ==> LLWU_P13 input was a wakeup source

#define  LLWU_F2_WUF14_MASK          0x40u
#define  LLWU_F2_WUF14_SHIFT         6
//   Wakeup Flag For LLWU_P14
//     0b0 ==> LLWU_P14 input was not a wakeup source
//     0b1 ==> LLWU_P14 input was a wakeup source

#define  LLWU_F2_WUF15_MASK          0x80u
#define  LLWU_F2_WUF15_SHIFT         7
//   Wakeup Flag For LLWU_P15
//     0b0 ==> LLWU_P15 input was not a wakeup source
//     0b1 ==> LLWU_P15 input was a wakeup source

#define  LLWU_F3_MWUF0_MASK          0x1u
#define  LLWU_F3_MWUF0_SHIFT         0
//   Wakeup flag For module 0
//     0b0 ==> Module 0 input was not a wakeup source
//     0b1 ==> Module 0 input was a wakeup source

#define  LLWU_F3_MWUF1_MASK          0x2u
#define  LLWU_F3_MWUF1_SHIFT         1
//   Wakeup flag For module 1
//     0b0 ==> Module 1 input was not a wakeup source
//     0b1 ==> Module 1 input was a wakeup source

#define  LLWU_F3_MWUF2_MASK          0x4u
#define  LLWU_F3_MWUF2_SHIFT         2
//   Wakeup flag For module 2
//     0b0 ==> Module 2 input was not a wakeup source
//     0b1 ==> Module 2 input was a wakeup source

#define  LLWU_F3_MWUF3_MASK          0x8u
#define  LLWU_F3_MWUF3_SHIFT         3
//   Wakeup flag For module 3
//     0b0 ==> Module 3 input was not a wakeup source
//     0b1 ==> Module 3 input was a wakeup source

#define  LLWU_F3_MWUF4_MASK          0x10u
#define  LLWU_F3_MWUF4_SHIFT         4
//   Wakeup flag For module 4
//     0b0 ==> Module 4 input was not a wakeup source
//     0b1 ==> Module 4 input was a wakeup source

#define  LLWU_F3_MWUF5_MASK          0x20u
#define  LLWU_F3_MWUF5_SHIFT         5
//   Wakeup flag For module 5
//     0b0 ==> Module 5 input was not a wakeup source
//     0b1 ==> Module 5 input was a wakeup source

#define  LLWU_F3_MWUF6_MASK          0x40u
#define  LLWU_F3_MWUF6_SHIFT         6
//   Wakeup flag For module 6
//     0b0 ==> Module 6 input was not a wakeup source
//     0b1 ==> Module 6 input was a wakeup source

#define  LLWU_F3_MWUF7_MASK          0x80u
#define  LLWU_F3_MWUF7_SHIFT         7
//   Wakeup flag For module 7
//     0b0 ==> Module 7 input was not a wakeup source
//     0b1 ==> Module 7 input was a wakeup source

#define  LLWU_FILT1_FILTSEL_MASK     0x4u
#define  LLWU_FILT1_FILTSEL_SHIFT    0
#define  LLWU_FILT1_FILTSEL(x)       (((uint8_t)(((uint8_t)(x))<<LLWU_FILT1_FILTSEL_SHIFT))&LLWU_FILT1_FILTSEL_MASK)
//   Filter Pin Select
//     0b0000 ==> Select LLWU_P0 for filter
//     0b1111 ==> Select LLWU_P15 for filter

#define  LLWU_FILT1_FILTE_MASK       0x40u
#define  LLWU_FILT1_FILTE_SHIFT      5
#define  LLWU_FILT1_FILTE(x)         (((uint8_t)(((uint8_t)(x))<<LLWU_FILT1_FILTE_SHIFT))&LLWU_FILT1_FILTE_MASK)
//   Digital Filter On External Pin
//     0b00 ==> Filter disabled
//     0b01 ==> Filter posedge detect enabled
//     0b10 ==> Filter negedge detect enabled
//     0b11 ==> Filter any edge detect enabled

#define  LLWU_FILT1_FILTF_MASK       0x80u
#define  LLWU_FILT1_FILTF_SHIFT      7
//   Filter Detect Flag
//     0b0 ==> Pin Filter 1 was not a wakeup source
//     0b1 ==> Pin Filter 1 was a wakeup source

#define  LLWU_FILT2_FILTSEL_MASK     0x4u
#define  LLWU_FILT2_FILTSEL_SHIFT    0
#define  LLWU_FILT2_FILTSEL(x)       (((uint8_t)(((uint8_t)(x))<<LLWU_FILT2_FILTSEL_SHIFT))&LLWU_FILT2_FILTSEL_MASK)
//   Filter Pin Select
//     0b0000 ==> Select LLWU_P0 for filter
//     0b1111 ==> Select LLWU_P15 for filter

#define  LLWU_FILT2_FILTE_MASK       0x40u
#define  LLWU_FILT2_FILTE_SHIFT      5
#define  LLWU_FILT2_FILTE(x)         (((uint8_t)(((uint8_t)(x))<<LLWU_FILT2_FILTE_SHIFT))&LLWU_FILT2_FILTE_MASK)
//   Digital Filter On External Pin
//     0b00 ==> Filter disabled
//     0b01 ==> Filter posedge detect enabled
//     0b10 ==> Filter negedge detect enabled
//     0b11 ==> Filter any edge detect enabled

#define  LLWU_FILT2_FILTF_MASK       0x80u
#define  LLWU_FILT2_FILTF_SHIFT      7
//   Filter Detect Flag
//     0b0 ==> Pin Filter 2 was not a wakeup source
//     0b1 ==> Pin Filter 2 was a wakeup source

#define  LPTMR_CSR_TEN_MASK          0x1u
#define  LPTMR_CSR_TEN_SHIFT         0
//   Timer Enable
//     0b0 ==> LPTMR is disabled and internal logic is reset.
//     0b1 ==> LPTMR is enabled.

#define  LPTMR_CSR_TMS_MASK          0x2u
#define  LPTMR_CSR_TMS_SHIFT         1
//   Timer Mode Select
//     0b0 ==> Time Counter mode.
//     0b1 ==> Pulse Counter mode.

#define  LPTMR_CSR_TFC_MASK          0x4u
#define  LPTMR_CSR_TFC_SHIFT         2
//   Timer Free-Running Counter
//     0b0 ==> CNR is reset whenever TCF is set.
//     0b1 ==> CNR is reset on overflow.

#define  LPTMR_CSR_TPP_MASK          0x8u
#define  LPTMR_CSR_TPP_SHIFT         3
//   Timer Pin Polarity
//     0b0 ==> Pulse Counter input source is active-high, and the CNR will increment on the rising-edge.
//     0b1 ==> Pulse Counter input source is active-low, and the CNR will increment on the falling-edge.

#define  LPTMR_CSR_TPS_MASK          0x20u
#define  LPTMR_CSR_TPS_SHIFT         4
#define  LPTMR_CSR_TPS(x)            (((uint32_t)(((uint32_t)(x))<<LPTMR_CSR_TPS_SHIFT))&LPTMR_CSR_TPS_MASK)
//   Timer Pin Select
//     0b00 ==> Pulse counter input 0 is selected.
//     0b01 ==> Pulse counter input 1 is selected.
//     0b10 ==> Pulse counter input 2 is selected.
//     0b11 ==> Pulse counter input 3 is selected.

#define  LPTMR_CSR_TIE_MASK          0x40u
#define  LPTMR_CSR_TIE_SHIFT         6
//   Timer Interrupt Enable
//     0b0 ==> Timer interrupt disabled.
//     0b1 ==> Timer interrupt enabled.

#define  LPTMR_CSR_TCF_MASK          0x80u
#define  LPTMR_CSR_TCF_SHIFT         7
//   Timer Compare Flag
//     0b0 ==> The value of CNR is not equal to CMR and increments.
//     0b1 ==> The value of CNR is equal to CMR and increments.

