iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  LPTMR_PSR_PCS_MASK          0x2u
#define  LPTMR_PSR_PCS_SHIFT         0
#define  LPTMR_PSR_PCS(x)            (((uint32_t)(((uint32_t)(x))<<LPTMR_PSR_PCS_SHIFT))&LPTMR_PSR_PCS_MASK)
//   Prescaler Clock Select
//     0b00 ==> Prescaler/glitch filter clock 0 selected.
//     0b01 ==> Prescaler/glitch filter clock 1 selected.
//     0b10 ==> Prescaler/glitch filter clock 2 selected.
//     0b11 ==> Prescaler/glitch filter clock 3 selected.

#define  LPTMR_PSR_PBYP_MASK         0x4u
#define  LPTMR_PSR_PBYP_SHIFT        2
//   Prescaler Bypass
//     0b0 ==> Prescaler/glitch filter is enabled.
//     0b1 ==> Prescaler/glitch filter is bypassed.

#define  LPTMR_PSR_PRESCALE_MASK     0x20u
#define  LPTMR_PSR_PRESCALE_SHIFT    3
#define  LPTMR_PSR_PRESCALE(x)       (((uint32_t)(((uint32_t)(x))<<LPTMR_PSR_PRESCALE_SHIFT))&LPTMR_PSR_PRESCALE_MASK)
//   Prescale Value
//     0b0000 ==> Prescaler divides the prescaler clock by 2; glitch filter does not support this configuration.
//     0b0001 ==> Prescaler divides the prescaler clock by 4; glitch filter recognizes change on input pin after 2 rising clock edges.
//     0b0010 ==> Prescaler divides the prescaler clock by 8; glitch filter recognizes change on input pin after 4 rising clock edges.
//     0b0011 ==> Prescaler divides the prescaler clock by 16; glitch filter recognizes change on input pin after 8 rising clock edges.
//     0b0100 ==> Prescaler divides the prescaler clock by 32; glitch filter recognizes change on input pin after 16 rising clock edges.
//     0b0101 ==> Prescaler divides the prescaler clock by 64; glitch filter recognizes change on input pin after 32 rising clock edges.
//     0b0110 ==> Prescaler divides the prescaler clock by 128; glitch filter recognizes change on input pin after 64 rising clock edges.
//     0b0111 ==> Prescaler divides the prescaler clock by 256; glitch filter recognizes change on input pin after 128 rising clock edges.
//     0b1000 ==> Prescaler divides the prescaler clock by 512; glitch filter recognizes change on input pin after 256 rising clock edges.
//     0b1001 ==> Prescaler divides the prescaler clock by 1024; glitch filter recognizes change on input pin after 512 rising clock edges.
//     0b1010 ==> Prescaler divides the prescaler clock by 2048; glitch filter recognizes change on input pin after 1024 rising clock edges.
//     0b1011 ==> Prescaler divides the prescaler clock by 4096; glitch filter recognizes change on input pin after 2048 rising clock edges.
//     0b1100 ==> Prescaler divides the prescaler clock by 8192; glitch filter recognizes change on input pin after 4096 rising clock edges.
//     0b1101 ==> Prescaler divides the prescaler clock by 16,384; glitch filter recognizes change on input pin after 8192 rising clock edges.
//     0b1110 ==> Prescaler divides the prescaler clock by 32,768; glitch filter recognizes change on input pin after 16,384 rising clock edges.
//     0b1111 ==> Prescaler divides the prescaler clock by 65,536; glitch filter recognizes change on input pin after 32,768 rising clock edges.

#define  LPTMR_CMR_COMPARE_MASK      0x10u
#define  LPTMR_CMR_COMPARE_SHIFT     0
#define  LPTMR_CMR_COMPARE(x)        (((uint32_t)(((uint32_t)(x))<<LPTMR_CMR_COMPARE_SHIFT))&LPTMR_CMR_COMPARE_MASK)
//   Compare Value

#define  LPTMR_CNR_COUNTER_MASK      0x10u
#define  LPTMR_CNR_COUNTER_SHIFT     0
#define  LPTMR_CNR_COUNTER(x)        (((uint32_t)(((uint32_t)(x))<<LPTMR_CNR_COUNTER_SHIFT))&LPTMR_CNR_COUNTER_MASK)
//   Counter Value

#define  MCG_C1_IREFSTEN_MASK        0x1u
#define  MCG_C1_IREFSTEN_SHIFT       0
//   Internal Reference Stop Enable
//     0b0 ==> Internal reference clock is disabled in Stop mode.
//     0b1 ==> Internal reference clock is enabled in Stop mode if IRCLKEN is set or if MCG is in FEI, FBI, or BLPI modes before entering Stop mode.

#define  MCG_C1_IRCLKEN_MASK         0x2u
#define  MCG_C1_IRCLKEN_SHIFT        1
//   Internal Reference Clock Enable
//     0b0 ==> MCGIRCLK inactive.
//     0b1 ==> MCGIRCLK active.

#define  MCG_C1_IREFS_MASK           0x4u
#define  MCG_C1_IREFS_SHIFT          2
//   Internal Reference Select
//     0b0 ==> External reference clock is selected.
//     0b1 ==> The slow internal reference clock is selected.

#define  MCG_C1_FRDIV_MASK           0x18u
#define  MCG_C1_FRDIV_SHIFT          3
#define  MCG_C1_FRDIV(x)             (((uint8_t)(((uint8_t)(x))<<MCG_C1_FRDIV_SHIFT))&MCG_C1_FRDIV_MASK)
//   FLL External Reference Divider
//     0b000 ==> If RANGE 0 = 0 or OSCSEL=1 , Divide Factor is 1; for all other RANGE 0 values, Divide Factor is 32.
//     0b001 ==> If RANGE 0 = 0 or OSCSEL=1 , Divide Factor is 2; for all other RANGE 0 values, Divide Factor is 64.
//     0b010 ==> If RANGE 0 = 0 or OSCSEL=1 , Divide Factor is 4; for all other RANGE 0 values, Divide Factor is 128.
//     0b011 ==> If RANGE 0 = 0 or OSCSEL=1 , Divide Factor is 8; for all other RANGE 0 values, Divide Factor is 256.
//     0b100 ==> If RANGE 0 = 0 or OSCSEL=1 , Divide Factor is 16; for all other RANGE 0 values, Divide Factor is 512.
//     0b101 ==> If RANGE 0 = 0 or OSCSEL=1 , Divide Factor is 32; for all other RANGE 0 values, Divide Factor is 1024.
//     0b110 ==> If RANGE 0 = 0 or OSCSEL=1 , Divide Factor is 64; for all other RANGE 0 values, Divide Factor is 1280 .
//     0b111 ==> If RANGE 0 = 0 or OSCSEL=1 , Divide Factor is 128; for all other RANGE 0 values, Divide Factor is 1536 .

#define  MCG_C1_CLKS_MASK            0x80u
#define  MCG_C1_CLKS_SHIFT           6
#define  MCG_C1_CLKS(x)              (((uint8_t)(((uint8_t)(x))<<MCG_C1_CLKS_SHIFT))&MCG_C1_CLKS_MASK)
//   Clock Source Select
//     0b00 ==> Encoding 0 - Output of FLL or PLL is selected (depends on PLLS control bit).
//     0b01 ==> Encoding 1 - Internal reference clock is selected.
//     0b10 ==> Encoding 2 - External reference clock is selected.
//     0b11 ==> Encoding 3 - Reserved.

#define  MCG_C2_IRCS_MASK            0x1u
#define  MCG_C2_IRCS_SHIFT           0
//   Internal Reference Clock Select
//     0b0 ==> Slow internal reference clock selected.
//     0b1 ==> Fast internal reference clock selected.

#define  MCG_C2_LP_MASK              0x2u
#define  MCG_C2_LP_SHIFT             1
//   Low Power Select
//     0b0 ==> FLL or PLL is not disabled in bypass modes.
//     0b1 ==> FLL or PLL is disabled in bypass modes (lower power)

#define  MCG_C2_EREFS0_MASK          0x4u
#define  MCG_C2_EREFS0_SHIFT         2
//   External Reference Select
//     0b0 ==> External reference clock requested.
//     0b1 ==> Oscillator requested.

