iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  MCG_C2_HGO0_MASK            0x8u
#define  MCG_C2_HGO0_SHIFT           3
//   High Gain Oscillator Select
//     0b0 ==> Configure crystal oscillator for low-power operation.
//     0b1 ==> Configure crystal oscillator for high-gain operation.

#define  MCG_C2_RANGE0_MASK          0x20u
#define  MCG_C2_RANGE0_SHIFT         4
#define  MCG_C2_RANGE0(x)            (((uint8_t)(((uint8_t)(x))<<MCG_C2_RANGE0_SHIFT))&MCG_C2_RANGE0_MASK)
//   Frequency Range Select
//     0b00 ==> Encoding 0 - Low frequency range selected for the crystal oscillator .
//     0b01 ==> Encoding 1 - High frequency range selected for the crystal oscillator .

#define  MCG_C2_LOCRE0_MASK          0x80u
#define  MCG_C2_LOCRE0_SHIFT         7
//   Loss of Clock Reset Enable
//     0b0 ==> Interrupt request is generated on a loss of OSC0 external reference clock.
//     0b1 ==> Generate a reset request on a loss of OSC0 external reference clock.

#define  MCG_C3_SCTRIM_MASK          0x8u
#define  MCG_C3_SCTRIM_SHIFT         0
#define  MCG_C3_SCTRIM(x)            (((uint8_t)(((uint8_t)(x))<<MCG_C3_SCTRIM_SHIFT))&MCG_C3_SCTRIM_MASK)
//   Slow Internal Reference Clock Trim Setting

#define  MCG_C4_SCFTRIM_MASK         0x1u
#define  MCG_C4_SCFTRIM_SHIFT        0
//   Slow Internal Reference Clock Fine Trim

#define  MCG_C4_FCTRIM_MASK          0x8u
#define  MCG_C4_FCTRIM_SHIFT         1
#define  MCG_C4_FCTRIM(x)            (((uint8_t)(((uint8_t)(x))<<MCG_C4_FCTRIM_SHIFT))&MCG_C4_FCTRIM_MASK)
//   Fast Internal Reference Clock Trim Setting

#define  MCG_C4_DRST_DRS_MASK        0x40u
#define  MCG_C4_DRST_DRS_SHIFT       5
#define  MCG_C4_DRST_DRS(x)          (((uint8_t)(((uint8_t)(x))<<MCG_C4_DRST_DRS_SHIFT))&MCG_C4_DRST_DRS_MASK)
//   DCO Range Select
//     0b00 ==> Encoding 0 - Low range (reset default).
//     0b01 ==> Encoding 1 - Mid range.
//     0b10 ==> Encoding 2 - Mid-high range.
//     0b11 ==> Encoding 3 - High range.

#define  MCG_C4_DMX32_MASK           0x80u
#define  MCG_C4_DMX32_SHIFT          7
//   DCO Maximum Frequency with 32.768 kHz Reference
//     0b0 ==> DCO has a default range of 25%.
//     0b1 ==> DCO is fine-tuned for maximum frequency with 32.768 kHz reference.

#define  MCG_C5_PLLSTEN0_MASK        0x20u
#define  MCG_C5_PLLSTEN0_SHIFT       5
//   PLL Stop Enable
//     0b0 ==> MCGPLLCLK is disabled in any of the Stop modes.
//     0b1 ==> MCGPLLCLK is enabled if system is in Normal Stop mode.

#define  MCG_C5_PLLCLKEN0_MASK       0x40u
#define  MCG_C5_PLLCLKEN0_SHIFT      6
//   PLL Clock Enable
//     0b0 ==> MCGPLLCLK is inactive.
//     0b1 ==> MCGPLLCLK is active.

#define  MCG_C6_CME0_MASK            0x20u
#define  MCG_C6_CME0_SHIFT           5
//   Clock Monitor Enable
//     0b0 ==> External clock monitor is disabled for OSC0.
//     0b1 ==> External clock monitor is enabled for OSC0.

#define  MCG_C6_PLLS_MASK            0x40u
#define  MCG_C6_PLLS_SHIFT           6
//   PLL Select
//     0b0 ==> FLL is selected.
//     0b1 ==> PLL is selected (PRDIV 0 need to be programmed to the correct divider to generate a PLL reference clock in the range of 2-4 MHz prior to setting the PLLS bit).

#define  MCG_C6_LOLIE0_MASK          0x80u
#define  MCG_C6_LOLIE0_SHIFT         7
//   Loss of Lock Interrrupt Enable
//     0b0 ==> No interrupt request is generated on loss of lock.
//     0b1 ==> Generate an interrupt request on loss of lock.

#define  MCG_S_IRCST_MASK            0x1u
#define  MCG_S_IRCST_SHIFT           0
//   Internal Reference Clock Status
//     0b0 ==> Source of internal reference clock is the slow clock (32 kHz IRC).
//     0b1 ==> Source of internal reference clock is the fast clock (2 MHz IRC).

#define  MCG_S_OSCINIT0_MASK         0x2u
#define  MCG_S_OSCINIT0_SHIFT        1
//   OSC Initialization

#define  MCG_S_CLKST_MASK            0x8u
#define  MCG_S_CLKST_SHIFT           2
#define  MCG_S_CLKST(x)              (((uint8_t)(((uint8_t)(x))<<MCG_S_CLKST_SHIFT))&MCG_S_CLKST_MASK)
//   Clock Mode Status
//     0b00 ==> Encoding 0 - Output of the FLL is selected (reset default).
//     0b01 ==> Encoding 1 - Internal reference clock is selected.
//     0b10 ==> Encoding 2 - External reference clock is selected.
//     0b11 ==> Encoding 3 - Output of the PLL is selected.

#define  MCG_S_IREFST_MASK           0x10u
#define  MCG_S_IREFST_SHIFT          4
//   Internal Reference Status
//     0b0 ==> Source of FLL reference clock is the external reference clock.
//     0b1 ==> Source of FLL reference clock is the internal reference clock.

#define  MCG_S_PLLST_MASK            0x20u
#define  MCG_S_PLLST_SHIFT           5
//   PLL Select Status
//     0b0 ==> Source of PLLS clock is FLL clock.
//     0b1 ==> Source of PLLS clock is PLL clock.

#define  MCG_S_LOCK0_MASK            0x40u
#define  MCG_S_LOCK0_SHIFT           6
//   Lock Status
//     0b0 ==> PLL is currently unlocked.
//     0b1 ==> PLL is currently locked.

#define  MCG_S_LOLS0_MASK            0x80u
#define  MCG_S_LOLS0_SHIFT           7
//   Loss of Lock Status
//     0b0 ==> PLL has not lost lock since LOLS 0 was last cleared.
//     0b1 ==> PLL has lost lock since LOLS 0 was last cleared.

#define  MCG_SC_LOCS0_MASK           0x1u
#define  MCG_SC_LOCS0_SHIFT          0
//   OSC0 Loss of Clock Status
//     0b0 ==> Loss of OSC0 has not occurred.
//     0b1 ==> Loss of OSC0 has occurred.

#define  MCG_SC_FCRDIV_MASK          0x6u
#define  MCG_SC_FCRDIV_SHIFT         1
#define  MCG_SC_FCRDIV(x)            (((uint8_t)(((uint8_t)(x))<<MCG_SC_FCRDIV_SHIFT))&MCG_SC_FCRDIV_MASK)
//   Fast Clock Internal Reference Divider
//     0b000 ==> Divide Factor is 1
//     0b001 ==> Divide Factor is 2.
//     0b010 ==> Divide Factor is 4.
//     0b011 ==> Divide Factor is 8.
//     0b100 ==> Divide Factor is 16
//     0b101 ==> Divide Factor is 32
//     0b110 ==> Divide Factor is 64
//     0b111 ==> Divide Factor is 128.

#define  MCG_SC_FLTPRSRV_MASK        0x10u
#define  MCG_SC_FLTPRSRV_SHIFT       4
//   FLL Filter Preserve Enable
//     0b0 ==> FLL filter and FLL frequency will reset on changes to currect clock mode.
//     0b1 ==> Fll filter and FLL frequency retain their previous values during new clock mode change.

#define  MCG_SC_ATMF_MASK            0x20u
#define  MCG_SC_ATMF_SHIFT           5
//   Automatic Trim Machine Fail Flag
//     0b0 ==> Automatic Trim Machine completed normally.
//     0b1 ==> Automatic Trim Machine failed.

