iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  MCG_SC_ATMS_MASK            0x40u
#define  MCG_SC_ATMS_SHIFT           6
//   Automatic Trim Machine Select
//     0b0 ==> 32 kHz Internal Reference Clock selected.
//     0b1 ==> 4 MHz Internal Reference Clock selected.

#define  MCG_SC_ATME_MASK            0x80u
#define  MCG_SC_ATME_SHIFT           7
//   Automatic Trim Machine Enable
//     0b0 ==> Auto Trim Machine disabled.
//     0b1 ==> Auto Trim Machine enabled.

#define  MCG_ATCVH_ATCVH_MASK        0x8u
#define  MCG_ATCVH_ATCVH_SHIFT       0
#define  MCG_ATCVH_ATCVH(x)          (((uint8_t)(((uint8_t)(x))<<MCG_ATCVH_ATCVH_SHIFT))&MCG_ATCVH_ATCVH_MASK)
//   ATM Compare Value High

#define  MCG_ATCVL_ATCVL_MASK        0x8u
#define  MCG_ATCVL_ATCVL_SHIFT       0
#define  MCG_ATCVL_ATCVL(x)          (((uint8_t)(((uint8_t)(x))<<MCG_ATCVL_ATCVL_SHIFT))&MCG_ATCVL_ATCVL_MASK)
//   ATM Compare Value Low

#define  MCG_C7_OSCSEL_MASK          0x1u
#define  MCG_C7_OSCSEL_SHIFT         0
//   MCG OSC Clock Select
//     0b0 ==> Selects System Oscillator (OSCCLK).
//     0b1 ==> Selects 32 kHz RTC Oscillator.

#define  MCG_C7_PLL32KREFSEL_MASK    0x80u
#define  MCG_C7_PLL32KREFSEL_SHIFT   6
#define  MCG_C7_PLL32KREFSEL(x)      (((uint8_t)(((uint8_t)(x))<<MCG_C7_PLL32KREFSEL_SHIFT))&MCG_C7_PLL32KREFSEL_MASK)
//   MCG PLL 32Khz Reference Clock Select
//     0b00 ==> Selects 32 kHz RTC Oscillator.
//     0b01 ==> Selects 32 kHz IRC.
//     0b10 ==> Selects FLL FRDIV clock.
//     0b11 ==> Reserved.

#define  MCG_C8_LOCS1_MASK           0x1u
#define  MCG_C8_LOCS1_SHIFT          0
//   RTC Loss of Clock Status
//     0b0 ==> Loss of RTC has not occur.
//     0b1 ==> Loss of RTC has occur

#define  MCG_C8_CME1_MASK            0x20u
#define  MCG_C8_CME1_SHIFT           5
//   Clock Monitor Enable1
//     0b0 ==> External clock monitor is disabled for RTC clock.
//     0b1 ==> External clock monitor is enabled for RTC clock.

#define  MCG_C8_LOLRE_MASK           0x40u
#define  MCG_C8_LOLRE_SHIFT          6
//     0b0 ==> Interrupt request is generated on a PLL loss of lock indication. The PLL loss of lock interrupt enable bit must also be set to generate the interrupt request.
//     0b1 ==> Generate a reset request on a PLL loss of lock indication.

#define  MCG_C8_LOCRE1_MASK          0x80u
#define  MCG_C8_LOCRE1_SHIFT         7
//   Loss of Clock Reset Enable
//     0b0 ==> Interrupt request is generated on a loss of RTC external reference clock.
//     0b1 ==> Generate a reset request on a loss of RTC external reference clock

#define  MCM_CR_SRAMUAP_MASK         0x2000000u
#define  MCM_CR_SRAMUAP_SHIFT        24
#define  MCM_CR_SRAMUAP(x)           (((uint32_t)(((uint32_t)(x))<<MCM_CR_SRAMUAP_SHIFT))&MCM_CR_SRAMUAP_MASK)
//   SRAM_U arbitration priority
//     0b00 ==> Round robin
//     0b01 ==> Special round robin (favors SRAM backoor accesses over the processor)
//     0b10 ==> Fixed priority. Processor has highest, backdoor has lowest
//     0b11 ==> Fixed priority. Backdoor has highest, processor has lowest

#define  MCM_CR_SRAMUWP_MASK         0x4000000u
#define  MCM_CR_SRAMUWP_SHIFT        26
//   SRAM_U write protect

#define  MCM_CR_SRAMLAP_MASK         0x20000000u
#define  MCM_CR_SRAMLAP_SHIFT        28
#define  MCM_CR_SRAMLAP(x)           (((uint32_t)(((uint32_t)(x))<<MCM_CR_SRAMLAP_SHIFT))&MCM_CR_SRAMLAP_MASK)
//   SRAM_L arbitration priority
//     0b00 ==> Round robin
//     0b01 ==> Special round robin (favors SRAM backoor accesses over the processor)
//     0b10 ==> Fixed priority. Processor has highest, backdoor has lowest
//     0b11 ==> Fixed priority. Backdoor has highest, processor has lowest

#define  MCM_CR_SRAMLWP_MASK         0x40000000u
#define  MCM_CR_SRAMLWP_SHIFT        30
//   SRAM_L Write Protect

#define  MCM_PID_PID_MASK            0x8u
#define  MCM_PID_PID_SHIFT           0
#define  MCM_PID_PID(x)              (((uint32_t)(((uint32_t)(x))<<MCM_PID_PID_SHIFT))&MCM_PID_PID_MASK)
//   M0_PID And M1_PID For MPU

#define  MPU_CESR_VLD_MASK           0x1u
#define  MPU_CESR_VLD_SHIFT          0
//   Valid
//     0b0 ==> MPU is disabled. All accesses from all bus masters are allowed.
//     0b1 ==> MPU is enabled

#define  MPU_CESR_NRGD_MASK          0x400u
#define  MPU_CESR_NRGD_SHIFT         8
#define  MPU_CESR_NRGD(x)            (((uint32_t)(((uint32_t)(x))<<MPU_CESR_NRGD_SHIFT))&MPU_CESR_NRGD_MASK)
//   Number Of Region Descriptors
//     0b0000 ==> 8 region descriptors
//     0b0001 ==> 12 region descriptors
//     0b0010 ==> 16 region descriptors

#define  MPU_CESR_NSP_MASK           0x4000u
#define  MPU_CESR_NSP_SHIFT          12
#define  MPU_CESR_NSP(x)             (((uint32_t)(((uint32_t)(x))<<MPU_CESR_NSP_SHIFT))&MPU_CESR_NSP_MASK)
//   Number Of Slave Ports

#define  MPU_CESR_HRL_MASK           0x40000u
#define  MPU_CESR_HRL_SHIFT          16
#define  MPU_CESR_HRL(x)             (((uint32_t)(((uint32_t)(x))<<MPU_CESR_HRL_SHIFT))&MPU_CESR_HRL_MASK)
//   Hardware Revision Level

#define  MPU_CESR_SPERR_MASK         0x80000000u
#define  MPU_CESR_SPERR_SHIFT        30
#define  MPU_CESR_SPERR(x)           (((uint32_t)(((uint32_t)(x))<<MPU_CESR_SPERR_SHIFT))&MPU_CESR_SPERR_MASK)
//   Slave Port n Error
//     0b0 ==> No error has occurred for slave port n.
//     0b1 ==> An error has occurred for slave port n.

#define  MPU_EAR0_EADDR_MASK         0x20u
#define  MPU_EAR0_EADDR_SHIFT        0
#define  MPU_EAR0_EADDR(x)           (((uint32_t)(((uint32_t)(x))<<MPU_EAR0_EADDR_SHIFT))&MPU_EAR0_EADDR_MASK)
//   Error Address

#define  MPU_EDR0_ERW_MASK           0x1u
#define  MPU_EDR0_ERW_SHIFT          0
//   Error Read/Write
//     0b0 ==> Read
//     0b1 ==> Write

#define  MPU_EDR0_EATTR_MASK         0x6u
#define  MPU_EDR0_EATTR_SHIFT        1
#define  MPU_EDR0_EATTR(x)           (((uint32_t)(((uint32_t)(x))<<MPU_EDR0_EATTR_SHIFT))&MPU_EDR0_EATTR_MASK)
//   Error Attributes
//     0b000 ==> User mode, instruction access
//     0b001 ==> User mode, data access
//     0b010 ==> Supervisor mode, instruction access
//     0b011 ==> Supervisor mode, data access

#define  MPU_EDR0_EMN_MASK           0x40u
#define  MPU_EDR0_EMN_SHIFT          4
#define  MPU_EDR0_EMN(x)             (((uint32_t)(((uint32_t)(x))<<MPU_EDR0_EMN_SHIFT))&MPU_EDR0_EMN_MASK)
//   Error Master Number

#define  MPU_EDR0_EACD_MASK          0x100000u
#define  MPU_EDR0_EACD_SHIFT         16
#define  MPU_EDR0_EACD(x)            (((uint32_t)(((uint32_t)(x))<<MPU_EDR0_EACD_SHIFT))&MPU_EDR0_EACD_MASK)
//   Error Access Control Detail

