iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  MPU_RGD2_WORD2_M0SM_MASK    0x10u
#define  MPU_RGD2_WORD2_M0SM_SHIFT   3
#define  MPU_RGD2_WORD2_M0SM(x)      (((uint32_t)(((uint32_t)(x))<<MPU_RGD2_WORD2_M0SM_SHIFT))&MPU_RGD2_WORD2_M0SM_MASK)
//   Bus Master 0 Supervisor Mode Access Control

#define  MPU_RGD2_WORD2_M1UM_MASK    0xC0u
#define  MPU_RGD2_WORD2_M1UM_SHIFT   6
#define  MPU_RGD2_WORD2_M1UM(x)      (((uint32_t)(((uint32_t)(x))<<MPU_RGD2_WORD2_M1UM_SHIFT))&MPU_RGD2_WORD2_M1UM_MASK)
//   Bus Master 1 User Mode Access Control

#define  MPU_RGD2_WORD2_M1SM_MASK    0x400u
#define  MPU_RGD2_WORD2_M1SM_SHIFT   9
#define  MPU_RGD2_WORD2_M1SM(x)      (((uint32_t)(((uint32_t)(x))<<MPU_RGD2_WORD2_M1SM_SHIFT))&MPU_RGD2_WORD2_M1SM_MASK)
//   Bus Master 1 Supervisor Mode Access Control

#define  MPU_RGD2_WORD2_M2UM_MASK    0x3000u
#define  MPU_RGD2_WORD2_M2UM_SHIFT   12
#define  MPU_RGD2_WORD2_M2UM(x)      (((uint32_t)(((uint32_t)(x))<<MPU_RGD2_WORD2_M2UM_SHIFT))&MPU_RGD2_WORD2_M2UM_MASK)
//   Bus Master 2 User Mode Access control

#define  MPU_RGD2_WORD2_M2SM_MASK    0x10000u
#define  MPU_RGD2_WORD2_M2SM_SHIFT   15
#define  MPU_RGD2_WORD2_M2SM(x)      (((uint32_t)(((uint32_t)(x))<<MPU_RGD2_WORD2_M2SM_SHIFT))&MPU_RGD2_WORD2_M2SM_MASK)
//   Bus Master 2 Supervisor Mode Access Control

#define  MPU_RGD2_WORD2_M3UM_MASK    0xC0000u
#define  MPU_RGD2_WORD2_M3UM_SHIFT   18
#define  MPU_RGD2_WORD2_M3UM(x)      (((uint32_t)(((uint32_t)(x))<<MPU_RGD2_WORD2_M3UM_SHIFT))&MPU_RGD2_WORD2_M3UM_MASK)
//   Bus Master 3 User Mode Access Control
//     0b0 ==> An attempted access of that mode may be terminated with an access error (if not allowed by another descriptor) and the access not performed.
//     0b1 ==> Allows the given access type to occur

#define  MPU_RGD2_WORD2_M3SM_MASK    0x400000u
#define  MPU_RGD2_WORD2_M3SM_SHIFT   21
#define  MPU_RGD2_WORD2_M3SM(x)      (((uint32_t)(((uint32_t)(x))<<MPU_RGD2_WORD2_M3SM_SHIFT))&MPU_RGD2_WORD2_M3SM_MASK)
//   Bus Master 3 Supervisor Mode Access Control
//     0b00 ==> r/w/x; read, write and execute allowed
//     0b01 ==> r/x; read and execute allowed, but no write
//     0b10 ==> r/w; read and write allowed, but no execute
//     0b11 ==> Same as User mode defined in M3UM

#define  MPU_RGD2_WORD2_M4WE_MASK    0x1000000u
#define  MPU_RGD2_WORD2_M4WE_SHIFT   24
//   Bus Master 4 Write Enable
//     0b0 ==> Bus master 4 writes terminate with an access error and the write is not performed
//     0b1 ==> Bus master 4 writes allowed

#define  MPU_RGD2_WORD2_M4RE_MASK    0x2000000u
#define  MPU_RGD2_WORD2_M4RE_SHIFT   25
//   Bus Master 4 Read Enable
//     0b0 ==> Bus master 4 reads terminate with an access error and the read is not performed
//     0b1 ==> Bus master 4 reads allowed

#define  MPU_RGD2_WORD2_M5WE_MASK    0x4000000u
#define  MPU_RGD2_WORD2_M5WE_SHIFT   26
//   Bus Master 5 Write Enable
//     0b0 ==> Bus master 5 writes terminate with an access error and the write is not performed
//     0b1 ==> Bus master 5 writes allowed

#define  MPU_RGD2_WORD2_M5RE_MASK    0x8000000u
#define  MPU_RGD2_WORD2_M5RE_SHIFT   27
//   Bus Master 5 Read Enable
//     0b0 ==> Bus master 5 reads terminate with an access error and the read is not performed
//     0b1 ==> Bus master 5 reads allowed

#define  MPU_RGD2_WORD2_M6WE_MASK    0x10000000u
#define  MPU_RGD2_WORD2_M6WE_SHIFT   28
//   Bus Master 6 Write Enable
//     0b0 ==> Bus master 6 writes terminate with an access error and the write is not performed
//     0b1 ==> Bus master 6 writes allowed

#define  MPU_RGD2_WORD2_M6RE_MASK    0x20000000u
#define  MPU_RGD2_WORD2_M6RE_SHIFT   29
//   Bus Master 6 Read Enable
//     0b0 ==> Bus master 6 reads terminate with an access error and the read is not performed
//     0b1 ==> Bus master 6 reads allowed

#define  MPU_RGD2_WORD2_M7WE_MASK    0x40000000u
#define  MPU_RGD2_WORD2_M7WE_SHIFT   30
//   Bus Master 7 Write Enable
//     0b0 ==> Bus master 7 writes terminate with an access error and the write is not performed
//     0b1 ==> Bus master 7 writes allowed

#define  MPU_RGD2_WORD2_M7RE_MASK    0x80000000u
#define  MPU_RGD2_WORD2_M7RE_SHIFT   31
//   Bus Master 7 Read Enable
//     0b0 ==> Bus master 7 reads terminate with an access error and the read is not performed
//     0b1 ==> Bus master 7 reads allowed

#define  MPU_RGD2_WORD3_VLD_MASK     0x1u
#define  MPU_RGD2_WORD3_VLD_SHIFT    0
//   Valid
//     0b0 ==> Region descriptor is invalid
//     0b1 ==> Region descriptor is valid

#define  MPU_RGD3_WORD0_SRTADDR_MASK 0x360u
#define  MPU_RGD3_WORD0_SRTADDR_SHIFT 5
#define  MPU_RGD3_WORD0_SRTADDR(x)   (((uint32_t)(((uint32_t)(x))<<MPU_RGD3_WORD0_SRTADDR_SHIFT))&MPU_RGD3_WORD0_SRTADDR_MASK)
//   Start Address

#define  MPU_RGD3_WORD1_ENDADDR_MASK 0x360u
#define  MPU_RGD3_WORD1_ENDADDR_SHIFT 5
#define  MPU_RGD3_WORD1_ENDADDR(x)   (((uint32_t)(((uint32_t)(x))<<MPU_RGD3_WORD1_ENDADDR_SHIFT))&MPU_RGD3_WORD1_ENDADDR_MASK)
//   End Address

#define  MPU_RGD3_WORD2_M0UM_MASK    0x3u
#define  MPU_RGD3_WORD2_M0UM_SHIFT   0
#define  MPU_RGD3_WORD2_M0UM(x)      (((uint32_t)(((uint32_t)(x))<<MPU_RGD3_WORD2_M0UM_SHIFT))&MPU_RGD3_WORD2_M0UM_MASK)
//   Bus Master 0 User Mode Access Control

#define  MPU_RGD3_WORD2_M0SM_MASK    0x10u
#define  MPU_RGD3_WORD2_M0SM_SHIFT   3
#define  MPU_RGD3_WORD2_M0SM(x)      (((uint32_t)(((uint32_t)(x))<<MPU_RGD3_WORD2_M0SM_SHIFT))&MPU_RGD3_WORD2_M0SM_MASK)
//   Bus Master 0 Supervisor Mode Access Control

#define  MPU_RGD3_WORD2_M1UM_MASK    0xC0u
#define  MPU_RGD3_WORD2_M1UM_SHIFT   6
#define  MPU_RGD3_WORD2_M1UM(x)      (((uint32_t)(((uint32_t)(x))<<MPU_RGD3_WORD2_M1UM_SHIFT))&MPU_RGD3_WORD2_M1UM_MASK)
//   Bus Master 1 User Mode Access Control

#define  MPU_RGD3_WORD2_M1SM_MASK    0x400u
#define  MPU_RGD3_WORD2_M1SM_SHIFT   9
#define  MPU_RGD3_WORD2_M1SM(x)      (((uint32_t)(((uint32_t)(x))<<MPU_RGD3_WORD2_M1SM_SHIFT))&MPU_RGD3_WORD2_M1SM_MASK)
//   Bus Master 1 Supervisor Mode Access Control

#define  MPU_RGD3_WORD2_M2UM_MASK    0x3000u
#define  MPU_RGD3_WORD2_M2UM_SHIFT   12
#define  MPU_RGD3_WORD2_M2UM(x)      (((uint32_t)(((uint32_t)(x))<<MPU_RGD3_WORD2_M2UM_SHIFT))&MPU_RGD3_WORD2_M2UM_MASK)
//   Bus Master 2 User Mode Access control

#define  MPU_RGD3_WORD2_M2SM_MASK    0x10000u
#define  MPU_RGD3_WORD2_M2SM_SHIFT   15
#define  MPU_RGD3_WORD2_M2SM(x)      (((uint32_t)(((uint32_t)(x))<<MPU_RGD3_WORD2_M2SM_SHIFT))&MPU_RGD3_WORD2_M2SM_MASK)
//   Bus Master 2 Supervisor Mode Access Control

#define  MPU_RGD3_WORD2_M3UM_MASK    0xC0000u
#define  MPU_RGD3_WORD2_M3UM_SHIFT   18
#define  MPU_RGD3_WORD2_M3UM(x)      (((uint32_t)(((uint32_t)(x))<<MPU_RGD3_WORD2_M3UM_SHIFT))&MPU_RGD3_WORD2_M3UM_MASK)
//   Bus Master 3 User Mode Access Control
//     0b0 ==> An attempted access of that mode may be terminated with an access error (if not allowed by another descriptor) and the access not performed.
//     0b1 ==> Allows the given access type to occur

#define  MPU_RGD3_WORD2_M3SM_MASK    0x400000u
#define  MPU_RGD3_WORD2_M3SM_SHIFT   21
#define  MPU_RGD3_WORD2_M3SM(x)      (((uint32_t)(((uint32_t)(x))<<MPU_RGD3_WORD2_M3SM_SHIFT))&MPU_RGD3_WORD2_M3SM_MASK)
//   Bus Master 3 Supervisor Mode Access Control
//     0b00 ==> r/w/x; read, write and execute allowed
//     0b01 ==> r/x; read and execute allowed, but no write
//     0b10 ==> r/w; read and write allowed, but no execute
//     0b11 ==> Same as User mode defined in M3UM

