iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  MPU_RGDAAC7_M2SM_MASK       0x10000u
#define  MPU_RGDAAC7_M2SM_SHIFT      15
#define  MPU_RGDAAC7_M2SM(x)         (((uint32_t)(((uint32_t)(x))<<MPU_RGDAAC7_M2SM_SHIFT))&MPU_RGDAAC7_M2SM_MASK)
//   Bus Master 2 Supervisor Mode Access Control

#define  MPU_RGDAAC7_M3UM_MASK       0xC0000u
#define  MPU_RGDAAC7_M3UM_SHIFT      18
#define  MPU_RGDAAC7_M3UM(x)         (((uint32_t)(((uint32_t)(x))<<MPU_RGDAAC7_M3UM_SHIFT))&MPU_RGDAAC7_M3UM_MASK)
//   Bus Master 3 User Mode Access Control
//     0b0 ==> An attempted access of that mode may be terminated with an access error (if not allowed by another descriptor) and the access not performed.
//     0b1 ==> Allows the given access type to occur

#define  MPU_RGDAAC7_M3SM_MASK       0x400000u
#define  MPU_RGDAAC7_M3SM_SHIFT      21
#define  MPU_RGDAAC7_M3SM(x)         (((uint32_t)(((uint32_t)(x))<<MPU_RGDAAC7_M3SM_SHIFT))&MPU_RGDAAC7_M3SM_MASK)
//   Bus Master 3 Supervisor Mode Access Control
//     0b00 ==> r/w/x; read, write and execute allowed
//     0b01 ==> r/x; read and execute allowed, but no write
//     0b10 ==> r/w; read and write allowed, but no execute
//     0b11 ==> Same as User mode defined in M3UM

#define  MPU_RGDAAC7_M4WE_MASK       0x1000000u
#define  MPU_RGDAAC7_M4WE_SHIFT      24
//   Bus Master 4 Write Enable
//     0b0 ==> Bus master 4 writes terminate with an access error and the write is not performed
//     0b1 ==> Bus master 4 writes allowed

#define  MPU_RGDAAC7_M4RE_MASK       0x2000000u
#define  MPU_RGDAAC7_M4RE_SHIFT      25
//   Bus Master 4 Read Enable
//     0b0 ==> Bus master 4 reads terminate with an access error and the read is not performed
//     0b1 ==> Bus master 4 reads allowed

#define  MPU_RGDAAC7_M5WE_MASK       0x4000000u
#define  MPU_RGDAAC7_M5WE_SHIFT      26
//   Bus Master 5 Write Enable
//     0b0 ==> Bus master 5 writes terminate with an access error and the write is not performed
//     0b1 ==> Bus master 5 writes allowed

#define  MPU_RGDAAC7_M5RE_MASK       0x8000000u
#define  MPU_RGDAAC7_M5RE_SHIFT      27
//   Bus Master 5 Read Enable
//     0b0 ==> Bus master 5 reads terminate with an access error and the read is not performed
//     0b1 ==> Bus master 5 reads allowed

#define  MPU_RGDAAC7_M6WE_MASK       0x10000000u
#define  MPU_RGDAAC7_M6WE_SHIFT      28
//   Bus Master 6 Write Enable
//     0b0 ==> Bus master 6 writes terminate with an access error and the write is not performed
//     0b1 ==> Bus master 6 writes allowed

#define  MPU_RGDAAC7_M6RE_MASK       0x20000000u
#define  MPU_RGDAAC7_M6RE_SHIFT      29
//   Bus Master 6 Read Enable
//     0b0 ==> Bus master 6 reads terminate with an access error and the read is not performed
//     0b1 ==> Bus master 6 reads allowed

#define  MPU_RGDAAC7_M7WE_MASK       0x40000000u
#define  MPU_RGDAAC7_M7WE_SHIFT      30
//   Bus Master 7 Write Enable
//     0b0 ==> Bus master 7 writes terminate with an access error and the write is not performed
//     0b1 ==> Bus master 7 writes allowed

#define  MPU_RGDAAC7_M7RE_MASK       0x80000000u
#define  MPU_RGDAAC7_M7RE_SHIFT      31
//   Bus Master 7 Read Enable
//     0b0 ==> Bus master 7 reads terminate with an access error and the read is not performed
//     0b1 ==> Bus master 7 reads allowed

#define  MTB_POSITION_WRAP_MASK      0x4u
#define  MTB_POSITION_WRAP_SHIFT     2

#define  MTB_POSITION_POINTER_MASK   0xE8u
#define  MTB_POSITION_POINTER_SHIFT  3
#define  MTB_POSITION_POINTER(x)     (((uint32_t)(((uint32_t)(x))<<MTB_POSITION_POINTER_SHIFT))&MTB_POSITION_POINTER_MASK)
//   Trace Packet Address Pointer

#define  MTB_MASTER_MASK_MASK        0x5u
#define  MTB_MASTER_MASK_SHIFT       0
#define  MTB_MASTER_MASK(x)          (((uint32_t)(((uint32_t)(x))<<MTB_MASTER_MASK_SHIFT))&MTB_MASTER_MASK_MASK)
//   Mask

#define  MTB_MASTER_TSTARTEN_MASK    0x20u
#define  MTB_MASTER_TSTARTEN_SHIFT   5
//   Trace start input enable

#define  MTB_MASTER_TSTOPEN_MASK     0x40u
#define  MTB_MASTER_TSTOPEN_SHIFT    6
//   Trace stop input enable

#define  MTB_MASTER_SFRWPRIV_MASK    0x80u
#define  MTB_MASTER_SFRWPRIV_SHIFT   7
//   Special Function Register Write Privilege bit

#define  MTB_MASTER_RAMPRIV_MASK     0x100u
#define  MTB_MASTER_RAMPRIV_SHIFT    8
//   RAM privilege bit

#define  MTB_MASTER_HALTREQ_MASK     0x200u
#define  MTB_MASTER_HALTREQ_SHIFT    9
//   Halt request bit

#define  MTB_MASTER_EN_MASK          0x80000000u
#define  MTB_MASTER_EN_SHIFT         31
//   Main trace enable bit

#define  MTB_FLOW_AUTOSTOP_MASK      0x1u
#define  MTB_FLOW_AUTOSTOP_SHIFT     0

#define  MTB_FLOW_AUTOHALT_MASK      0x2u
#define  MTB_FLOW_AUTOHALT_SHIFT     1

#define  MTB_FLOW_WATERMARK_MASK     0xE8u
#define  MTB_FLOW_WATERMARK_SHIFT    3
#define  MTB_FLOW_WATERMARK(x)       (((uint32_t)(((uint32_t)(x))<<MTB_FLOW_WATERMARK_SHIFT))&MTB_FLOW_WATERMARK_MASK)
//   WATERMARK value

#define  MTB_BASE_BASEADDR_MASK      0x20u
#define  MTB_BASE_BASEADDR_SHIFT     0
#define  MTB_BASE_BASEADDR(x)        (((uint32_t)(((uint32_t)(x))<<MTB_BASE_BASEADDR_SHIFT))&MTB_BASE_BASEADDR_MASK)

#define  MTB_MODECTRL_MODECTRL_MASK  0x20u
#define  MTB_MODECTRL_MODECTRL_SHIFT 0
#define  MTB_MODECTRL_MODECTRL(x)    (((uint32_t)(((uint32_t)(x))<<MTB_MODECTRL_MODECTRL_SHIFT))&MTB_MODECTRL_MODECTRL_MASK)

#define  MTB_TAGSET_TAGSET_MASK      0x20u
#define  MTB_TAGSET_TAGSET_SHIFT     0
#define  MTB_TAGSET_TAGSET(x)        (((uint32_t)(((uint32_t)(x))<<MTB_TAGSET_TAGSET_SHIFT))&MTB_TAGSET_TAGSET_MASK)

#define  MTB_TAGCLEAR_TAGCLEAR_MASK  0x20u
#define  MTB_TAGCLEAR_TAGCLEAR_SHIFT 0
#define  MTB_TAGCLEAR_TAGCLEAR(x)    (((uint32_t)(((uint32_t)(x))<<MTB_TAGCLEAR_TAGCLEAR_SHIFT))&MTB_TAGCLEAR_TAGCLEAR_MASK)

#define  MTB_LOCKACCESS_LOCKACCESS_MASK 0x20u
#define  MTB_LOCKACCESS_LOCKACCESS_SHIFT 0
#define  MTB_LOCKACCESS_LOCKACCESS(x) (((uint32_t)(((uint32_t)(x))<<MTB_LOCKACCESS_LOCKACCESS_SHIFT))&MTB_LOCKACCESS_LOCKACCESS_MASK)

#define  MTB_LOCKSTAT_LOCKSTAT_MASK  0x20u
#define  MTB_LOCKSTAT_LOCKSTAT_SHIFT 0
#define  MTB_LOCKSTAT_LOCKSTAT(x)    (((uint32_t)(((uint32_t)(x))<<MTB_LOCKSTAT_LOCKSTAT_SHIFT))&MTB_LOCKSTAT_LOCKSTAT_MASK)

#define  MTB_AUTHSTAT_BIT0_MASK      0x1u
#define  MTB_AUTHSTAT_BIT0_SHIFT     0

#define  MTB_AUTHSTAT_BIT1_MASK      0x2u
#define  MTB_AUTHSTAT_BIT1_SHIFT     1

#define  MTB_AUTHSTAT_BIT2_MASK      0x4u
#define  MTB_AUTHSTAT_BIT2_SHIFT     2

#define  MTB_AUTHSTAT_BIT3_MASK      0x8u
#define  MTB_AUTHSTAT_BIT3_SHIFT     3

#define  MTB_DEVICEARCH_DEVICEARCH_MASK 0x20u
#define  MTB_DEVICEARCH_DEVICEARCH_SHIFT 0
#define  MTB_DEVICEARCH_DEVICEARCH(x) (((uint32_t)(((uint32_t)(x))<<MTB_DEVICEARCH_DEVICEARCH_SHIFT))&MTB_DEVICEARCH_DEVICEARCH_MASK)

