iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  MTB_DEVICECFG_DEVICECFG_MASK 0x20u
#define  MTB_DEVICECFG_DEVICECFG_SHIFT 0
#define  MTB_DEVICECFG_DEVICECFG(x)  (((uint32_t)(((uint32_t)(x))<<MTB_DEVICECFG_DEVICECFG_SHIFT))&MTB_DEVICECFG_DEVICECFG_MASK)

#define  MTB_DEVICETYPID_DEVICETYPID_MASK 0x20u
#define  MTB_DEVICETYPID_DEVICETYPID_SHIFT 0
#define  MTB_DEVICETYPID_DEVICETYPID(x) (((uint32_t)(((uint32_t)(x))<<MTB_DEVICETYPID_DEVICETYPID_SHIFT))&MTB_DEVICETYPID_DEVICETYPID_MASK)

#define  MTB_PERIPHID4_PERIPHID_MASK 0x20u
#define  MTB_PERIPHID4_PERIPHID_SHIFT 0
#define  MTB_PERIPHID4_PERIPHID(x)   (((uint32_t)(((uint32_t)(x))<<MTB_PERIPHID4_PERIPHID_SHIFT))&MTB_PERIPHID4_PERIPHID_MASK)

#define  MTB_PERIPHID5_PERIPHID_MASK 0x20u
#define  MTB_PERIPHID5_PERIPHID_SHIFT 0
#define  MTB_PERIPHID5_PERIPHID(x)   (((uint32_t)(((uint32_t)(x))<<MTB_PERIPHID5_PERIPHID_SHIFT))&MTB_PERIPHID5_PERIPHID_MASK)

#define  MTB_PERIPHID6_PERIPHID_MASK 0x20u
#define  MTB_PERIPHID6_PERIPHID_SHIFT 0
#define  MTB_PERIPHID6_PERIPHID(x)   (((uint32_t)(((uint32_t)(x))<<MTB_PERIPHID6_PERIPHID_SHIFT))&MTB_PERIPHID6_PERIPHID_MASK)

#define  MTB_PERIPHID7_PERIPHID_MASK 0x20u
#define  MTB_PERIPHID7_PERIPHID_SHIFT 0
#define  MTB_PERIPHID7_PERIPHID(x)   (((uint32_t)(((uint32_t)(x))<<MTB_PERIPHID7_PERIPHID_SHIFT))&MTB_PERIPHID7_PERIPHID_MASK)

#define  MTB_PERIPHID0_PERIPHID_MASK 0x20u
#define  MTB_PERIPHID0_PERIPHID_SHIFT 0
#define  MTB_PERIPHID0_PERIPHID(x)   (((uint32_t)(((uint32_t)(x))<<MTB_PERIPHID0_PERIPHID_SHIFT))&MTB_PERIPHID0_PERIPHID_MASK)

#define  MTB_PERIPHID1_PERIPHID_MASK 0x20u
#define  MTB_PERIPHID1_PERIPHID_SHIFT 0
#define  MTB_PERIPHID1_PERIPHID(x)   (((uint32_t)(((uint32_t)(x))<<MTB_PERIPHID1_PERIPHID_SHIFT))&MTB_PERIPHID1_PERIPHID_MASK)

#define  MTB_PERIPHID2_PERIPHID_MASK 0x20u
#define  MTB_PERIPHID2_PERIPHID_SHIFT 0
#define  MTB_PERIPHID2_PERIPHID(x)   (((uint32_t)(((uint32_t)(x))<<MTB_PERIPHID2_PERIPHID_SHIFT))&MTB_PERIPHID2_PERIPHID_MASK)

#define  MTB_PERIPHID3_PERIPHID_MASK 0x20u
#define  MTB_PERIPHID3_PERIPHID_SHIFT 0
#define  MTB_PERIPHID3_PERIPHID(x)   (((uint32_t)(((uint32_t)(x))<<MTB_PERIPHID3_PERIPHID_SHIFT))&MTB_PERIPHID3_PERIPHID_MASK)

#define  MTB_COMPID0_COMPID_MASK     0x20u
#define  MTB_COMPID0_COMPID_SHIFT    0
#define  MTB_COMPID0_COMPID(x)       (((uint32_t)(((uint32_t)(x))<<MTB_COMPID0_COMPID_SHIFT))&MTB_COMPID0_COMPID_MASK)
//   Component ID

#define  MTB_COMPID1_COMPID_MASK     0x20u
#define  MTB_COMPID1_COMPID_SHIFT    0
#define  MTB_COMPID1_COMPID(x)       (((uint32_t)(((uint32_t)(x))<<MTB_COMPID1_COMPID_SHIFT))&MTB_COMPID1_COMPID_MASK)
//   Component ID

#define  MTB_COMPID2_COMPID_MASK     0x20u
#define  MTB_COMPID2_COMPID_SHIFT    0
#define  MTB_COMPID2_COMPID(x)       (((uint32_t)(((uint32_t)(x))<<MTB_COMPID2_COMPID_SHIFT))&MTB_COMPID2_COMPID_MASK)
//   Component ID

#define  MTB_COMPID3_COMPID_MASK     0x20u
#define  MTB_COMPID3_COMPID_SHIFT    0
#define  MTB_COMPID3_COMPID(x)       (((uint32_t)(((uint32_t)(x))<<MTB_COMPID3_COMPID_SHIFT))&MTB_COMPID3_COMPID_MASK)
//   Component ID

#define  MTBDWT_CTRL_DWTCFGCTRL_MASK 0x1Cu
#define  MTBDWT_CTRL_DWTCFGCTRL_SHIFT 0
#define  MTBDWT_CTRL_DWTCFGCTRL(x)   (((uint32_t)(((uint32_t)(x))<<MTBDWT_CTRL_DWTCFGCTRL_SHIFT))&MTBDWT_CTRL_DWTCFGCTRL_MASK)
//   DWT configuration controls

#define  MTBDWT_CTRL_NUMCMP_MASK     0x40000000u
#define  MTBDWT_CTRL_NUMCMP_SHIFT    28
#define  MTBDWT_CTRL_NUMCMP(x)       (((uint32_t)(((uint32_t)(x))<<MTBDWT_CTRL_NUMCMP_SHIFT))&MTBDWT_CTRL_NUMCMP_MASK)
//   Number of comparators

#define  MTBDWT_COMP0_COMP_MASK      0x20u
#define  MTBDWT_COMP0_COMP_SHIFT     0
#define  MTBDWT_COMP0_COMP(x)        (((uint32_t)(((uint32_t)(x))<<MTBDWT_COMP0_COMP_SHIFT))&MTBDWT_COMP0_COMP_MASK)
//   Reference value for comparison

#define  MTBDWT_MASK0_MASK_MASK      0x5u
#define  MTBDWT_MASK0_MASK_SHIFT     0
#define  MTBDWT_MASK0_MASK(x)        (((uint32_t)(((uint32_t)(x))<<MTBDWT_MASK0_MASK_SHIFT))&MTBDWT_MASK0_MASK_MASK)
//   MASK

#define  MTBDWT_COMP1_COMP_MASK      0x20u
#define  MTBDWT_COMP1_COMP_SHIFT     0
#define  MTBDWT_COMP1_COMP(x)        (((uint32_t)(((uint32_t)(x))<<MTBDWT_COMP1_COMP_SHIFT))&MTBDWT_COMP1_COMP_MASK)
//   Reference value for comparison

#define  MTBDWT_MASK1_MASK_MASK      0x5u
#define  MTBDWT_MASK1_MASK_SHIFT     0
#define  MTBDWT_MASK1_MASK(x)        (((uint32_t)(((uint32_t)(x))<<MTBDWT_MASK1_MASK_SHIFT))&MTBDWT_MASK1_MASK_MASK)
//   MASK

#define  MTBDWT_FCT1_FUNCTION_MASK   0x4u
#define  MTBDWT_FCT1_FUNCTION_SHIFT  0
#define  MTBDWT_FCT1_FUNCTION(x)     (((uint32_t)(((uint32_t)(x))<<MTBDWT_FCT1_FUNCTION_SHIFT))&MTBDWT_FCT1_FUNCTION_MASK)
//   Function
//     0b0000 ==> Disabled.
//     0b0100 ==> Instruction fetch.
//     0b0101 ==> Data operand read.
//     0b0110 ==> Data operand write.
//     0b0111 ==> Data operand (read + write).

#define  MTBDWT_FCT1_MATCHED_MASK    0x1000000u
#define  MTBDWT_FCT1_MATCHED_SHIFT   24
//   Comparator match
//     0b0 ==> No match.
//     0b1 ==> Match occurred.

#define  MTBDWT_TBCTRL_ACOMP0_MASK   0x1u
#define  MTBDWT_TBCTRL_ACOMP0_SHIFT  0
//   Action based on Comparator 0 match
//     0b0 ==> Trigger TSTOP based on the assertion of MTBDWT_FUNCTION0[MATCHED].
//     0b1 ==> Trigger TSTART based on the assertion of MTBDWT_FUNCTION0[MATCHED].

#define  MTBDWT_TBCTRL_ACOMP1_MASK   0x2u
#define  MTBDWT_TBCTRL_ACOMP1_SHIFT  1
//   Action based on Comparator 1 match
//     0b0 ==> Trigger TSTOP based on the assertion of MTBDWT_FUNCTION1[MATCHED].
//     0b1 ==> Trigger TSTART based on the assertion of MTBDWT_FUNCTION1[MATCHED].

#define  MTBDWT_TBCTRL_NUMCOMP_MASK  0x40000000u
#define  MTBDWT_TBCTRL_NUMCOMP_SHIFT 28
#define  MTBDWT_TBCTRL_NUMCOMP(x)    (((uint32_t)(((uint32_t)(x))<<MTBDWT_TBCTRL_NUMCOMP_SHIFT))&MTBDWT_TBCTRL_NUMCOMP_MASK)
//   Number of Comparators

#define  MTBDWT_DEVICECFG_DEVICECFG_MASK 0x20u
#define  MTBDWT_DEVICECFG_DEVICECFG_SHIFT 0
#define  MTBDWT_DEVICECFG_DEVICECFG(x) (((uint32_t)(((uint32_t)(x))<<MTBDWT_DEVICECFG_DEVICECFG_SHIFT))&MTBDWT_DEVICECFG_DEVICECFG_MASK)

#define  MTBDWT_DEVICETYPID_DEVICETYPID_MASK 0x20u
#define  MTBDWT_DEVICETYPID_DEVICETYPID_SHIFT 0
#define  MTBDWT_DEVICETYPID_DEVICETYPID(x) (((uint32_t)(((uint32_t)(x))<<MTBDWT_DEVICETYPID_DEVICETYPID_SHIFT))&MTBDWT_DEVICETYPID_DEVICETYPID_MASK)

#define  MTBDWT_PERIPHID4_PERIPHID_MASK 0x20u
#define  MTBDWT_PERIPHID4_PERIPHID_SHIFT 0
#define  MTBDWT_PERIPHID4_PERIPHID(x) (((uint32_t)(((uint32_t)(x))<<MTBDWT_PERIPHID4_PERIPHID_SHIFT))&MTBDWT_PERIPHID4_PERIPHID_MASK)

#define  MTBDWT_PERIPHID5_PERIPHID_MASK 0x20u
#define  MTBDWT_PERIPHID5_PERIPHID_SHIFT 0
#define  MTBDWT_PERIPHID5_PERIPHID(x) (((uint32_t)(((uint32_t)(x))<<MTBDWT_PERIPHID5_PERIPHID_SHIFT))&MTBDWT_PERIPHID5_PERIPHID_MASK)

