iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  MTBDWT_PERIPHID6_PERIPHID_MASK 0x20u
#define  MTBDWT_PERIPHID6_PERIPHID_SHIFT 0
#define  MTBDWT_PERIPHID6_PERIPHID(x) (((uint32_t)(((uint32_t)(x))<<MTBDWT_PERIPHID6_PERIPHID_SHIFT))&MTBDWT_PERIPHID6_PERIPHID_MASK)

#define  MTBDWT_PERIPHID7_PERIPHID_MASK 0x20u
#define  MTBDWT_PERIPHID7_PERIPHID_SHIFT 0
#define  MTBDWT_PERIPHID7_PERIPHID(x) (((uint32_t)(((uint32_t)(x))<<MTBDWT_PERIPHID7_PERIPHID_SHIFT))&MTBDWT_PERIPHID7_PERIPHID_MASK)

#define  MTBDWT_PERIPHID0_PERIPHID_MASK 0x20u
#define  MTBDWT_PERIPHID0_PERIPHID_SHIFT 0
#define  MTBDWT_PERIPHID0_PERIPHID(x) (((uint32_t)(((uint32_t)(x))<<MTBDWT_PERIPHID0_PERIPHID_SHIFT))&MTBDWT_PERIPHID0_PERIPHID_MASK)

#define  MTBDWT_PERIPHID1_PERIPHID_MASK 0x20u
#define  MTBDWT_PERIPHID1_PERIPHID_SHIFT 0
#define  MTBDWT_PERIPHID1_PERIPHID(x) (((uint32_t)(((uint32_t)(x))<<MTBDWT_PERIPHID1_PERIPHID_SHIFT))&MTBDWT_PERIPHID1_PERIPHID_MASK)

#define  MTBDWT_PERIPHID2_PERIPHID_MASK 0x20u
#define  MTBDWT_PERIPHID2_PERIPHID_SHIFT 0
#define  MTBDWT_PERIPHID2_PERIPHID(x) (((uint32_t)(((uint32_t)(x))<<MTBDWT_PERIPHID2_PERIPHID_SHIFT))&MTBDWT_PERIPHID2_PERIPHID_MASK)

#define  MTBDWT_PERIPHID3_PERIPHID_MASK 0x20u
#define  MTBDWT_PERIPHID3_PERIPHID_SHIFT 0
#define  MTBDWT_PERIPHID3_PERIPHID(x) (((uint32_t)(((uint32_t)(x))<<MTBDWT_PERIPHID3_PERIPHID_SHIFT))&MTBDWT_PERIPHID3_PERIPHID_MASK)

#define  MTBDWT_COMPID0_COMPID_MASK  0x20u
#define  MTBDWT_COMPID0_COMPID_SHIFT 0
#define  MTBDWT_COMPID0_COMPID(x)    (((uint32_t)(((uint32_t)(x))<<MTBDWT_COMPID0_COMPID_SHIFT))&MTBDWT_COMPID0_COMPID_MASK)
//   Component ID

#define  MTBDWT_COMPID1_COMPID_MASK  0x20u
#define  MTBDWT_COMPID1_COMPID_SHIFT 0
#define  MTBDWT_COMPID1_COMPID(x)    (((uint32_t)(((uint32_t)(x))<<MTBDWT_COMPID1_COMPID_SHIFT))&MTBDWT_COMPID1_COMPID_MASK)
//   Component ID

#define  MTBDWT_COMPID2_COMPID_MASK  0x20u
#define  MTBDWT_COMPID2_COMPID_SHIFT 0
#define  MTBDWT_COMPID2_COMPID(x)    (((uint32_t)(((uint32_t)(x))<<MTBDWT_COMPID2_COMPID_SHIFT))&MTBDWT_COMPID2_COMPID_MASK)
//   Component ID

#define  MTBDWT_COMPID3_COMPID_MASK  0x20u
#define  MTBDWT_COMPID3_COMPID_SHIFT 0
#define  MTBDWT_COMPID3_COMPID(x)    (((uint32_t)(((uint32_t)(x))<<MTBDWT_COMPID3_COMPID_SHIFT))&MTBDWT_COMPID3_COMPID_MASK)
//   Component ID

#define  OSC_CR_SC16P_MASK           0x1u
#define  OSC_CR_SC16P_SHIFT          0
//   Oscillator 16 pF Capacitor Load Configure
//     0b0 ==> Disable the selection.
//     0b1 ==> Add 16 pF capacitor to the oscillator load.

#define  OSC_CR_SC8P_MASK            0x2u
#define  OSC_CR_SC8P_SHIFT           1
//   Oscillator 8 pF Capacitor Load Configure
//     0b0 ==> Disable the selection.
//     0b1 ==> Add 8 pF capacitor to the oscillator load.

#define  OSC_CR_SC4P_MASK            0x4u
#define  OSC_CR_SC4P_SHIFT           2
//   Oscillator 4 pF Capacitor Load Configure
//     0b0 ==> Disable the selection.
//     0b1 ==> Add 4 pF capacitor to the oscillator load.

#define  OSC_CR_SC2P_MASK            0x8u
#define  OSC_CR_SC2P_SHIFT           3
//   Oscillator 2 pF Capacitor Load Configure
//     0b0 ==> Disable the selection.
//     0b1 ==> Add 2 pF capacitor to the oscillator load.

#define  OSC_CR_EREFSTEN_MASK        0x20u
#define  OSC_CR_EREFSTEN_SHIFT       5
//   External Reference Stop Enable
//     0b0 ==> External reference clock is disabled in Stop mode.
//     0b1 ==> External reference clock stays enabled in Stop mode if ERCLKEN is set before entering Stop mode.

#define  OSC_CR_ERCLKEN_MASK         0x80u
#define  OSC_CR_ERCLKEN_SHIFT        7
//   External Reference Enable
//     0b0 ==> External reference clock is inactive.
//     0b1 ==> External reference clock is enabled.

#define  PIT0_MCR_FRZ_MASK           0x1u
#define  PIT0_MCR_FRZ_SHIFT          0
//   Freeze
//     0b0 ==> Timers continue to run in Debug mode.
//     0b1 ==> Timers are stopped in Debug mode.

#define  PIT0_LDVAL0_TSV_MASK        0x20u
#define  PIT0_LDVAL0_TSV_SHIFT       0
#define  PIT0_LDVAL0_TSV(x)          (((uint32_t)(((uint32_t)(x))<<PIT0_LDVAL0_TSV_SHIFT))&PIT0_LDVAL0_TSV_MASK)
//   Timer Start Value

#define  PIT0_CVAL0_TVL_MASK         0x20u
#define  PIT0_CVAL0_TVL_SHIFT        0
#define  PIT0_CVAL0_TVL(x)           (((uint32_t)(((uint32_t)(x))<<PIT0_CVAL0_TVL_SHIFT))&PIT0_CVAL0_TVL_MASK)
//   Current Timer Value

#define  PIT0_TCTRL0_TEN_MASK        0x1u
#define  PIT0_TCTRL0_TEN_SHIFT       0
//   Timer Enable
//     0b0 ==> Timer n is disabled.
//     0b1 ==> Timer n is enabled.

#define  PIT0_TCTRL0_TIE_MASK        0x2u
#define  PIT0_TCTRL0_TIE_SHIFT       1
//   Timer Interrupt Enable
//     0b0 ==> Interrupt requests from Timer n are disabled.
//     0b1 ==> Interrupt will be requested whenever TIF is set.

#define  PIT0_TCTRL0_CHN_MASK        0x4u
#define  PIT0_TCTRL0_CHN_SHIFT       2
//   Chain Mode
//     0b0 ==> Timer is not chained.
//     0b1 ==> Timer is chained to previous timer. For example, for Channel 2, if this field is set, Timer 2 is chained to Timer 1.

#define  PIT0_TFLG0_TIF_MASK         0x1u
#define  PIT0_TFLG0_TIF_SHIFT        0
//   Timer Interrupt Flag
//     0b0 ==> Timeout has not yet occurred.
//     0b1 ==> Timeout has occurred.

#define  PIT0_LDVAL1_TSV_MASK        0x20u
#define  PIT0_LDVAL1_TSV_SHIFT       0
#define  PIT0_LDVAL1_TSV(x)          (((uint32_t)(((uint32_t)(x))<<PIT0_LDVAL1_TSV_SHIFT))&PIT0_LDVAL1_TSV_MASK)
//   Timer Start Value

#define  PIT0_CVAL1_TVL_MASK         0x20u
#define  PIT0_CVAL1_TVL_SHIFT        0
#define  PIT0_CVAL1_TVL(x)           (((uint32_t)(((uint32_t)(x))<<PIT0_CVAL1_TVL_SHIFT))&PIT0_CVAL1_TVL_MASK)
//   Current Timer Value

#define  PIT0_TCTRL1_TEN_MASK        0x1u
#define  PIT0_TCTRL1_TEN_SHIFT       0
//   Timer Enable
//     0b0 ==> Timer n is disabled.
//     0b1 ==> Timer n is enabled.

#define  PIT0_TCTRL1_TIE_MASK        0x2u
#define  PIT0_TCTRL1_TIE_SHIFT       1
//   Timer Interrupt Enable
//     0b0 ==> Interrupt requests from Timer n are disabled.
//     0b1 ==> Interrupt will be requested whenever TIF is set.

#define  PIT0_TCTRL1_CHN_MASK        0x4u
#define  PIT0_TCTRL1_CHN_SHIFT       2
//   Chain Mode
//     0b0 ==> Timer is not chained.
//     0b1 ==> Timer is chained to previous timer. For example, for Channel 2, if this field is set, Timer 2 is chained to Timer 1.

#define  PIT0_TFLG1_TIF_MASK         0x1u
#define  PIT0_TFLG1_TIF_SHIFT        0
//   Timer Interrupt Flag
//     0b0 ==> Timeout has not yet occurred.
//     0b1 ==> Timeout has occurred.

