iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  PIT0_LDVAL2_TSV_MASK        0x20u
#define  PIT0_LDVAL2_TSV_SHIFT       0
#define  PIT0_LDVAL2_TSV(x)          (((uint32_t)(((uint32_t)(x))<<PIT0_LDVAL2_TSV_SHIFT))&PIT0_LDVAL2_TSV_MASK)
//   Timer Start Value

#define  PIT0_CVAL2_TVL_MASK         0x20u
#define  PIT0_CVAL2_TVL_SHIFT        0
#define  PIT0_CVAL2_TVL(x)           (((uint32_t)(((uint32_t)(x))<<PIT0_CVAL2_TVL_SHIFT))&PIT0_CVAL2_TVL_MASK)
//   Current Timer Value

#define  PIT0_TCTRL2_TEN_MASK        0x1u
#define  PIT0_TCTRL2_TEN_SHIFT       0
//   Timer Enable
//     0b0 ==> Timer n is disabled.
//     0b1 ==> Timer n is enabled.

#define  PIT0_TCTRL2_TIE_MASK        0x2u
#define  PIT0_TCTRL2_TIE_SHIFT       1
//   Timer Interrupt Enable
//     0b0 ==> Interrupt requests from Timer n are disabled.
//     0b1 ==> Interrupt will be requested whenever TIF is set.

#define  PIT0_TCTRL2_CHN_MASK        0x4u
#define  PIT0_TCTRL2_CHN_SHIFT       2
//   Chain Mode
//     0b0 ==> Timer is not chained.
//     0b1 ==> Timer is chained to previous timer. For example, for Channel 2, if this field is set, Timer 2 is chained to Timer 1.

#define  PIT0_TFLG2_TIF_MASK         0x1u
#define  PIT0_TFLG2_TIF_SHIFT        0
//   Timer Interrupt Flag
//     0b0 ==> Timeout has not yet occurred.
//     0b1 ==> Timeout has occurred.

#define  PIT0_LDVAL3_TSV_MASK        0x20u
#define  PIT0_LDVAL3_TSV_SHIFT       0
#define  PIT0_LDVAL3_TSV(x)          (((uint32_t)(((uint32_t)(x))<<PIT0_LDVAL3_TSV_SHIFT))&PIT0_LDVAL3_TSV_MASK)
//   Timer Start Value

#define  PIT0_CVAL3_TVL_MASK         0x20u
#define  PIT0_CVAL3_TVL_SHIFT        0
#define  PIT0_CVAL3_TVL(x)           (((uint32_t)(((uint32_t)(x))<<PIT0_CVAL3_TVL_SHIFT))&PIT0_CVAL3_TVL_MASK)
//   Current Timer Value

#define  PIT0_TCTRL3_TEN_MASK        0x1u
#define  PIT0_TCTRL3_TEN_SHIFT       0
//   Timer Enable
//     0b0 ==> Timer n is disabled.
//     0b1 ==> Timer n is enabled.

#define  PIT0_TCTRL3_TIE_MASK        0x2u
#define  PIT0_TCTRL3_TIE_SHIFT       1
//   Timer Interrupt Enable
//     0b0 ==> Interrupt requests from Timer n are disabled.
//     0b1 ==> Interrupt will be requested whenever TIF is set.

#define  PIT0_TCTRL3_CHN_MASK        0x4u
#define  PIT0_TCTRL3_CHN_SHIFT       2
//   Chain Mode
//     0b0 ==> Timer is not chained.
//     0b1 ==> Timer is chained to previous timer. For example, for Channel 2, if this field is set, Timer 2 is chained to Timer 1.

#define  PIT0_TFLG3_TIF_MASK         0x1u
#define  PIT0_TFLG3_TIF_SHIFT        0
//   Timer Interrupt Flag
//     0b0 ==> Timeout has not yet occurred.
//     0b1 ==> Timeout has occurred.

#define  PIT1_MCR_FRZ_MASK           0x1u
#define  PIT1_MCR_FRZ_SHIFT          0
//   Freeze
//     0b0 ==> Timers continue to run in Debug mode.
//     0b1 ==> Timers are stopped in Debug mode.

#define  PIT1_LDVAL0_TSV_MASK        0x20u
#define  PIT1_LDVAL0_TSV_SHIFT       0
#define  PIT1_LDVAL0_TSV(x)          (((uint32_t)(((uint32_t)(x))<<PIT1_LDVAL0_TSV_SHIFT))&PIT1_LDVAL0_TSV_MASK)
//   Timer Start Value

#define  PIT1_CVAL0_TVL_MASK         0x20u
#define  PIT1_CVAL0_TVL_SHIFT        0
#define  PIT1_CVAL0_TVL(x)           (((uint32_t)(((uint32_t)(x))<<PIT1_CVAL0_TVL_SHIFT))&PIT1_CVAL0_TVL_MASK)
//   Current Timer Value

#define  PIT1_TCTRL0_TEN_MASK        0x1u
#define  PIT1_TCTRL0_TEN_SHIFT       0
//   Timer Enable
//     0b0 ==> Timer n is disabled.
//     0b1 ==> Timer n is enabled.

#define  PIT1_TCTRL0_TIE_MASK        0x2u
#define  PIT1_TCTRL0_TIE_SHIFT       1
//   Timer Interrupt Enable
//     0b0 ==> Interrupt requests from Timer n are disabled.
//     0b1 ==> Interrupt will be requested whenever TIF is set.

#define  PIT1_TCTRL0_CHN_MASK        0x4u
#define  PIT1_TCTRL0_CHN_SHIFT       2
//   Chain Mode
//     0b0 ==> Timer is not chained.
//     0b1 ==> Timer is chained to previous timer. For example, for Channel 2, if this field is set, Timer 2 is chained to Timer 1.

#define  PIT1_TFLG0_TIF_MASK         0x1u
#define  PIT1_TFLG0_TIF_SHIFT        0
//   Timer Interrupt Flag
//     0b0 ==> Timeout has not yet occurred.
//     0b1 ==> Timeout has occurred.

#define  PIT1_LDVAL1_TSV_MASK        0x20u
#define  PIT1_LDVAL1_TSV_SHIFT       0
#define  PIT1_LDVAL1_TSV(x)          (((uint32_t)(((uint32_t)(x))<<PIT1_LDVAL1_TSV_SHIFT))&PIT1_LDVAL1_TSV_MASK)
//   Timer Start Value

#define  PIT1_CVAL1_TVL_MASK         0x20u
#define  PIT1_CVAL1_TVL_SHIFT        0
#define  PIT1_CVAL1_TVL(x)           (((uint32_t)(((uint32_t)(x))<<PIT1_CVAL1_TVL_SHIFT))&PIT1_CVAL1_TVL_MASK)
//   Current Timer Value

#define  PIT1_TCTRL1_TEN_MASK        0x1u
#define  PIT1_TCTRL1_TEN_SHIFT       0
//   Timer Enable
//     0b0 ==> Timer n is disabled.
//     0b1 ==> Timer n is enabled.

#define  PIT1_TCTRL1_TIE_MASK        0x2u
#define  PIT1_TCTRL1_TIE_SHIFT       1
//   Timer Interrupt Enable
//     0b0 ==> Interrupt requests from Timer n are disabled.
//     0b1 ==> Interrupt will be requested whenever TIF is set.

#define  PIT1_TCTRL1_CHN_MASK        0x4u
#define  PIT1_TCTRL1_CHN_SHIFT       2
//   Chain Mode
//     0b0 ==> Timer is not chained.
//     0b1 ==> Timer is chained to previous timer. For example, for Channel 2, if this field is set, Timer 2 is chained to Timer 1.

#define  PIT1_TFLG1_TIF_MASK         0x1u
#define  PIT1_TFLG1_TIF_SHIFT        0
//   Timer Interrupt Flag
//     0b0 ==> Timeout has not yet occurred.
//     0b1 ==> Timeout has occurred.

#define  PIT1_LDVAL2_TSV_MASK        0x20u
#define  PIT1_LDVAL2_TSV_SHIFT       0
#define  PIT1_LDVAL2_TSV(x)          (((uint32_t)(((uint32_t)(x))<<PIT1_LDVAL2_TSV_SHIFT))&PIT1_LDVAL2_TSV_MASK)
//   Timer Start Value

#define  PIT1_CVAL2_TVL_MASK         0x20u
#define  PIT1_CVAL2_TVL_SHIFT        0
#define  PIT1_CVAL2_TVL(x)           (((uint32_t)(((uint32_t)(x))<<PIT1_CVAL2_TVL_SHIFT))&PIT1_CVAL2_TVL_MASK)
//   Current Timer Value

#define  PIT1_TCTRL2_TEN_MASK        0x1u
#define  PIT1_TCTRL2_TEN_SHIFT       0
//   Timer Enable
//     0b0 ==> Timer n is disabled.
//     0b1 ==> Timer n is enabled.

#define  PIT1_TCTRL2_TIE_MASK        0x2u
#define  PIT1_TCTRL2_TIE_SHIFT       1
//   Timer Interrupt Enable
//     0b0 ==> Interrupt requests from Timer n are disabled.
//     0b1 ==> Interrupt will be requested whenever TIF is set.

#define  PIT1_TCTRL2_CHN_MASK        0x4u
#define  PIT1_TCTRL2_CHN_SHIFT       2
//   Chain Mode
//     0b0 ==> Timer is not chained.
//     0b1 ==> Timer is chained to previous timer. For example, for Channel 2, if this field is set, Timer 2 is chained to Timer 1.

