iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  PIT1_TFLG2_TIF_MASK         0x1u
#define  PIT1_TFLG2_TIF_SHIFT        0
//   Timer Interrupt Flag
//     0b0 ==> Timeout has not yet occurred.
//     0b1 ==> Timeout has occurred.

#define  PIT1_LDVAL3_TSV_MASK        0x20u
#define  PIT1_LDVAL3_TSV_SHIFT       0
#define  PIT1_LDVAL3_TSV(x)          (((uint32_t)(((uint32_t)(x))<<PIT1_LDVAL3_TSV_SHIFT))&PIT1_LDVAL3_TSV_MASK)
//   Timer Start Value

#define  PIT1_CVAL3_TVL_MASK         0x20u
#define  PIT1_CVAL3_TVL_SHIFT        0
#define  PIT1_CVAL3_TVL(x)           (((uint32_t)(((uint32_t)(x))<<PIT1_CVAL3_TVL_SHIFT))&PIT1_CVAL3_TVL_MASK)
//   Current Timer Value

#define  PIT1_TCTRL3_TEN_MASK        0x1u
#define  PIT1_TCTRL3_TEN_SHIFT       0
//   Timer Enable
//     0b0 ==> Timer n is disabled.
//     0b1 ==> Timer n is enabled.

#define  PIT1_TCTRL3_TIE_MASK        0x2u
#define  PIT1_TCTRL3_TIE_SHIFT       1
//   Timer Interrupt Enable
//     0b0 ==> Interrupt requests from Timer n are disabled.
//     0b1 ==> Interrupt will be requested whenever TIF is set.

#define  PIT1_TCTRL3_CHN_MASK        0x4u
#define  PIT1_TCTRL3_CHN_SHIFT       2
//   Chain Mode
//     0b0 ==> Timer is not chained.
//     0b1 ==> Timer is chained to previous timer. For example, for Channel 2, if this field is set, Timer 2 is chained to Timer 1.

#define  PIT1_TFLG3_TIF_MASK         0x1u
#define  PIT1_TFLG3_TIF_SHIFT        0
//   Timer Interrupt Flag
//     0b0 ==> Timeout has not yet occurred.
//     0b1 ==> Timeout has occurred.

#define  PMC_LVDSC1_LVDV_MASK        0x2u
#define  PMC_LVDSC1_LVDV_SHIFT       0
#define  PMC_LVDSC1_LVDV(x)          (((uint8_t)(((uint8_t)(x))<<PMC_LVDSC1_LVDV_SHIFT))&PMC_LVDSC1_LVDV_MASK)
//   Low-Voltage Detect Voltage Select
//     0b00 ==> Low trip point selected (V LVD = V LVDL )
//     0b01 ==> High trip point selected (V LVD = V LVDH )
//     0b10 ==> Reserved
//     0b11 ==> Reserved

#define  PMC_LVDSC1_LVDRE_MASK       0x10u
#define  PMC_LVDSC1_LVDRE_SHIFT      4
//   Low-Voltage Detect Reset Enable
//     0b0 ==> LVDF does not generate hardware resets
//     0b1 ==> Force an MCU reset when LVDF = 1

#define  PMC_LVDSC1_LVDIE_MASK       0x20u
#define  PMC_LVDSC1_LVDIE_SHIFT      5
//   Low-Voltage Detect Interrupt Enable
//     0b0 ==> Hardware interrupt disabled (use polling)
//     0b1 ==> Request a hardware interrupt when LVDF = 1

#define  PMC_LVDSC1_LVDACK_MASK      0x40u
#define  PMC_LVDSC1_LVDACK_SHIFT     6
//   Low-Voltage Detect Acknowledge

#define  PMC_LVDSC1_LVDF_MASK        0x80u
#define  PMC_LVDSC1_LVDF_SHIFT       7
//   Low-Voltage Detect Flag
//     0b0 ==> Low-voltage event not detected
//     0b1 ==> Low-voltage event detected

#define  PMC_LVDSC2_LVWV_MASK        0x2u
#define  PMC_LVDSC2_LVWV_SHIFT       0
#define  PMC_LVDSC2_LVWV(x)          (((uint8_t)(((uint8_t)(x))<<PMC_LVDSC2_LVWV_SHIFT))&PMC_LVDSC2_LVWV_MASK)
//   Low-Voltage Warning Voltage Select
//     0b00 ==> Low trip point selected (VLVW = VLVW1)
//     0b01 ==> Mid 1 trip point selected (VLVW = VLVW2)
//     0b10 ==> Mid 2 trip point selected (VLVW = VLVW3)
//     0b11 ==> High trip point selected (VLVW = VLVW4)

#define  PMC_LVDSC2_LVWIE_MASK       0x20u
#define  PMC_LVDSC2_LVWIE_SHIFT      5
//   Low-Voltage Warning Interrupt Enable
//     0b0 ==> Hardware interrupt disabled (use polling)
//     0b1 ==> Request a hardware interrupt when LVWF = 1

#define  PMC_LVDSC2_LVWACK_MASK      0x40u
#define  PMC_LVDSC2_LVWACK_SHIFT     6
//   Low-Voltage Warning Acknowledge

#define  PMC_LVDSC2_LVWF_MASK        0x80u
#define  PMC_LVDSC2_LVWF_SHIFT       7
//   Low-Voltage Warning Flag
//     0b0 ==> Low-voltage warning event not detected
//     0b1 ==> Low-voltage warning event detected

#define  PMC_REGSC_BGBE_MASK         0x1u
#define  PMC_REGSC_BGBE_SHIFT        0
//   Bandgap Buffer Enable
//     0b0 ==> Bandgap buffer not enabled
//     0b1 ==> Bandgap buffer enabled

#define  PMC_REGSC_REGONS_MASK       0x4u
#define  PMC_REGSC_REGONS_SHIFT      2
//   Regulator In Run Regulation Status
//     0b0 ==> Regulator is in stop regulation or in transition to/from it
//     0b1 ==> Regulator is in run regulation

#define  PMC_REGSC_ACKISO_MASK       0x8u
#define  PMC_REGSC_ACKISO_SHIFT      3
//   Acknowledge Isolation
//     0b0 ==> Peripherals and I/O pads are in normal run state
//     0b1 ==> Certain peripherals and I/O pads are in an isolated and latched state

#define  PMC_REGSC_BGEN_MASK         0x10u
#define  PMC_REGSC_BGEN_SHIFT        4
//   Bandgap Enable In VLPx Operation
//     0b0 ==> Bandgap voltage reference is disabled in VLPx , and VLLSx modes
//     0b1 ==> Bandgap voltage reference is enabled in VLPx , and VLLSx modes

#define  RCM_SRS0_WAKEUP_MASK        0x1u
#define  RCM_SRS0_WAKEUP_SHIFT       0
//   Low Leakage Wakeup Reset
//     0b0 ==> Reset not caused by LLWU module wakeup source
//     0b1 ==> Reset caused by LLWU module wakeup source

#define  RCM_SRS0_LVD_MASK           0x2u
#define  RCM_SRS0_LVD_SHIFT          1
//   Low-Voltage Detect Reset
//     0b0 ==> Reset not caused by LVD trip or POR
//     0b1 ==> Reset caused by LVD trip or POR

#define  RCM_SRS0_LOC_MASK           0x4u
#define  RCM_SRS0_LOC_SHIFT          2
//   Loss-of-Clock Reset
//     0b0 ==> Reset not caused by a loss of external clock.
//     0b1 ==> Reset caused by a loss of external clock.

#define  RCM_SRS0_LOL_MASK           0x8u
#define  RCM_SRS0_LOL_SHIFT          3
//   Loss-of-Lock Reset
//     0b0 ==> Reset not caused by a loss of lock in the PLL
//     0b1 ==> Reset caused by a loss of lock in the PLL

#define  RCM_SRS0_WDOG_MASK          0x20u
#define  RCM_SRS0_WDOG_SHIFT         5
//   Watchdog
//     0b0 ==> Reset not caused by watchdog timeout
//     0b1 ==> Reset caused by watchdog timeout

#define  RCM_SRS0_PIN_MASK           0x40u
#define  RCM_SRS0_PIN_SHIFT          6
//   External Reset Pin
//     0b0 ==> Reset not caused by external reset pin
//     0b1 ==> Reset caused by external reset pin

#define  RCM_SRS0_POR_MASK           0x80u
#define  RCM_SRS0_POR_SHIFT          7
//   Power-On Reset
//     0b0 ==> Reset not caused by POR
//     0b1 ==> Reset caused by POR

#define  RCM_SRS1_LOCKUP_MASK        0x2u
#define  RCM_SRS1_LOCKUP_SHIFT       1
//   Core Lockup
//     0b0 ==> Reset not caused by core LOCKUP event
//     0b1 ==> Reset caused by core LOCKUP event

