iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  RCM_SRS1_SW_MASK            0x4u
#define  RCM_SRS1_SW_SHIFT           2
//   Software
//     0b0 ==> Reset not caused by software setting of SYSRESETREQ bit
//     0b1 ==> Reset caused by software setting of SYSRESETREQ bit

#define  RCM_SRS1_MDM_AP_MASK        0x8u
#define  RCM_SRS1_MDM_AP_SHIFT       3
//   MDM-AP System Reset Request
//     0b0 ==> Reset not caused by host debugger system setting of the System Reset Request bit
//     0b1 ==> Reset caused by host debugger system setting of the System Reset Request bit

#define  RCM_SRS1_SACKERR_MASK       0x20u
#define  RCM_SRS1_SACKERR_SHIFT      5
//   Stop Mode Acknowledge Error Reset
//     0b0 ==> Reset not caused by peripheral failure to acknowledge attempt to enter stop mode
//     0b1 ==> Reset caused by peripheral failure to acknowledge attempt to enter stop mode

#define  RCM_RPFC_RSTFLTSRW_MASK     0x2u
#define  RCM_RPFC_RSTFLTSRW_SHIFT    0
#define  RCM_RPFC_RSTFLTSRW(x)       (((uint8_t)(((uint8_t)(x))<<RCM_RPFC_RSTFLTSRW_SHIFT))&RCM_RPFC_RSTFLTSRW_MASK)
//   Reset Pin Filter Select in Run and Wait Modes
//     0b00 ==> All filtering disabled
//     0b01 ==> Bus clock filter enabled for normal operation
//     0b10 ==> LPO clock filter enabled for normal operation
//     0b11 ==> Reserved

#define  RCM_RPFC_RSTFLTSS_MASK      0x4u
#define  RCM_RPFC_RSTFLTSS_SHIFT     2
//   Reset Pin Filter Select in Stop Mode
//     0b0 ==> All filtering disabled
//     0b1 ==> LPO clock filter enabled

#define  RCM_RPFW_RSTFLTSEL_MASK     0x5u
#define  RCM_RPFW_RSTFLTSEL_SHIFT    0
#define  RCM_RPFW_RSTFLTSEL(x)       (((uint8_t)(((uint8_t)(x))<<RCM_RPFW_RSTFLTSEL_SHIFT))&RCM_RPFW_RSTFLTSEL_MASK)
//   Reset Pin Filter Bus Clock Select
//     0b00000 ==> Bus clock filter count is 1
//     0b00001 ==> Bus clock filter count is 2
//     0b00010 ==> Bus clock filter count is 3
//     0b00011 ==> Bus clock filter count is 4
//     0b00100 ==> Bus clock filter count is 5
//     0b00101 ==> Bus clock filter count is 6
//     0b00110 ==> Bus clock filter count is 7
//     0b00111 ==> Bus clock filter count is 8
//     0b01000 ==> Bus clock filter count is 9
//     0b01001 ==> Bus clock filter count is 10
//     0b01010 ==> Bus clock filter count is 11
//     0b01011 ==> Bus clock filter count is 12
//     0b01100 ==> Bus clock filter count is 13
//     0b01101 ==> Bus clock filter count is 14
//     0b01110 ==> Bus clock filter count is 15
//     0b01111 ==> Bus clock filter count is 16
//     0b10000 ==> Bus clock filter count is 17
//     0b10001 ==> Bus clock filter count is 18
//     0b10010 ==> Bus clock filter count is 19
//     0b10011 ==> Bus clock filter count is 20
//     0b10100 ==> Bus clock filter count is 21
//     0b10101 ==> Bus clock filter count is 22
//     0b10110 ==> Bus clock filter count is 23
//     0b10111 ==> Bus clock filter count is 24
//     0b11000 ==> Bus clock filter count is 25
//     0b11001 ==> Bus clock filter count is 26
//     0b11010 ==> Bus clock filter count is 27
//     0b11011 ==> Bus clock filter count is 28
//     0b11100 ==> Bus clock filter count is 29
//     0b11101 ==> Bus clock filter count is 30
//     0b11110 ==> Bus clock filter count is 31
//     0b11111 ==> Bus clock filter count is 32

#define  RNG_CR_GO_MASK              0x1u
#define  RNG_CR_GO_SHIFT             0
//     0b0 ==> RNGA Output Register is not loaded with random data.
//     0b1 ==> RNGA Output Register is loaded with random data.

#define  RNG_CR_HA_MASK              0x2u
#define  RNG_CR_HA_SHIFT             1
//   High Assurance
//     0b0 ==> Notification of security violations is enabled.
//     0b1 ==> Notification of security violations is masked.

#define  RNG_CR_INTM_MASK            0x4u
#define  RNG_CR_INTM_SHIFT           2
//   Interrupt Mask
//     0b0 ==> Interrupt is enabled.
//     0b1 ==> Interrupt is masked.

#define  RNG_CR_CLRI_MASK            0x8u
#define  RNG_CR_CLRI_SHIFT           3
//   Clear Interrupt
//     0b0 ==> Do not clear the interrupt.
//     0b1 ==> Clear the interrupt.

#define  RNG_CR_SLP_MASK             0x10u
#define  RNG_CR_SLP_SHIFT            4
//   Sleep
//     0b0 ==> RNGA is not in Sleep mode.
//     0b1 ==> RNGA is in Sleep mode.

#define  RNG_SR_SECV_MASK            0x1u
#define  RNG_SR_SECV_SHIFT           0
//   Security Violation
//     0b0 ==> No security violations have occured or the High Assurance bit (HA) in the RNGA Control Register is not set.
//     0b1 ==> A security violation has occurred.

#define  RNG_SR_LRS_MASK             0x2u
#define  RNG_SR_LRS_SHIFT            1
//   Last Read Status
//     0b0 ==> Last read was performed while the RNGA Output Register was not empty.
//     0b1 ==> Last read was performed while the RNGA Output Register was empty (underflow condition).

#define  RNG_SR_ORU_MASK             0x4u
#define  RNG_SR_ORU_SHIFT            2
//   Output Register Underflow
//     0b0 ==> The RNGA Output Register has not been read while empty since last read of the RNGA Status Register.
//     0b1 ==> The RNGA Output Register has been read while empty since last read of the RNGA Status Register.

#define  RNG_SR_ERRI_MASK            0x8u
#define  RNG_SR_ERRI_SHIFT           3
//   Error Interrupt
//     0b0 ==> The RNGA Output Register has not been read while empty.
//     0b1 ==> The RNGA Output Register has been read while empty.

#define  RNG_SR_SLP_MASK             0x10u
#define  RNG_SR_SLP_SHIFT            4
//   Sleep
//     0b0 ==> The RNGA is not in Sleep mode.
//     0b1 ==> The RNGA is in Sleep mode.

#define  RNG_SR_OREG_LVL_MASK        0x800u
#define  RNG_SR_OREG_LVL_SHIFT       8
#define  RNG_SR_OREG_LVL(x)          (((uint32_t)(((uint32_t)(x))<<RNG_SR_OREG_LVL_SHIFT))&RNG_SR_OREG_LVL_MASK)
//   Output Register Level

#define  RNG_SR_OREG_SIZE_MASK       0x80000u
#define  RNG_SR_OREG_SIZE_SHIFT      16
#define  RNG_SR_OREG_SIZE(x)         (((uint32_t)(((uint32_t)(x))<<RNG_SR_OREG_SIZE_SHIFT))&RNG_SR_OREG_SIZE_MASK)
//   Output Register Size

#define  RNG_ER_EXT_ENT_MASK         0x20u
#define  RNG_ER_EXT_ENT_SHIFT        0
#define  RNG_ER_EXT_ENT(x)           (((uint32_t)(((uint32_t)(x))<<RNG_ER_EXT_ENT_SHIFT))&RNG_ER_EXT_ENT_MASK)
//   External Entropy

#define  RNG_OR_RANDOUT_MASK         0x20u
#define  RNG_OR_RANDOUT_SHIFT        0
#define  RNG_OR_RANDOUT(x)           (((uint32_t)(((uint32_t)(x))<<RNG_OR_RANDOUT_SHIFT))&RNG_OR_RANDOUT_MASK)
//   Random Output

