iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  ROM_ENTRY0_ENTRY_MASK       0x20u
#define  ROM_ENTRY0_ENTRY_SHIFT      0
#define  ROM_ENTRY0_ENTRY(x)         (((uint32_t)(((uint32_t)(x))<<ROM_ENTRY0_ENTRY_SHIFT))&ROM_ENTRY0_ENTRY_MASK)
//   ENTRY

#define  ROM_ENTRY1_ENTRY_MASK       0x20u
#define  ROM_ENTRY1_ENTRY_SHIFT      0
#define  ROM_ENTRY1_ENTRY(x)         (((uint32_t)(((uint32_t)(x))<<ROM_ENTRY1_ENTRY_SHIFT))&ROM_ENTRY1_ENTRY_MASK)
//   ENTRY

#define  ROM_ENTRY2_ENTRY_MASK       0x20u
#define  ROM_ENTRY2_ENTRY_SHIFT      0
#define  ROM_ENTRY2_ENTRY(x)         (((uint32_t)(((uint32_t)(x))<<ROM_ENTRY2_ENTRY_SHIFT))&ROM_ENTRY2_ENTRY_MASK)
//   ENTRY

#define  ROM_TABLEMARK_MARK_MASK     0x20u
#define  ROM_TABLEMARK_MARK_SHIFT    0
#define  ROM_TABLEMARK_MARK(x)       (((uint32_t)(((uint32_t)(x))<<ROM_TABLEMARK_MARK_SHIFT))&ROM_TABLEMARK_MARK_MASK)

#define  ROM_PERIPHID4_PERIPHID_MASK 0x20u
#define  ROM_PERIPHID4_PERIPHID_SHIFT 0
#define  ROM_PERIPHID4_PERIPHID(x)   (((uint32_t)(((uint32_t)(x))<<ROM_PERIPHID4_PERIPHID_SHIFT))&ROM_PERIPHID4_PERIPHID_MASK)

#define  ROM_SYSACCESS_SYSACCESS_MASK 0x20u
#define  ROM_SYSACCESS_SYSACCESS_SHIFT 0
#define  ROM_SYSACCESS_SYSACCESS(x)  (((uint32_t)(((uint32_t)(x))<<ROM_SYSACCESS_SYSACCESS_SHIFT))&ROM_SYSACCESS_SYSACCESS_MASK)

#define  ROM_PERIPHID5_PERIPHID_MASK 0x20u
#define  ROM_PERIPHID5_PERIPHID_SHIFT 0
#define  ROM_PERIPHID5_PERIPHID(x)   (((uint32_t)(((uint32_t)(x))<<ROM_PERIPHID5_PERIPHID_SHIFT))&ROM_PERIPHID5_PERIPHID_MASK)

#define  ROM_PERIPHID6_PERIPHID_MASK 0x20u
#define  ROM_PERIPHID6_PERIPHID_SHIFT 0
#define  ROM_PERIPHID6_PERIPHID(x)   (((uint32_t)(((uint32_t)(x))<<ROM_PERIPHID6_PERIPHID_SHIFT))&ROM_PERIPHID6_PERIPHID_MASK)

#define  ROM_PERIPHID7_PERIPHID_MASK 0x20u
#define  ROM_PERIPHID7_PERIPHID_SHIFT 0
#define  ROM_PERIPHID7_PERIPHID(x)   (((uint32_t)(((uint32_t)(x))<<ROM_PERIPHID7_PERIPHID_SHIFT))&ROM_PERIPHID7_PERIPHID_MASK)

#define  ROM_PERIPHID0_PERIPHID_MASK 0x20u
#define  ROM_PERIPHID0_PERIPHID_SHIFT 0
#define  ROM_PERIPHID0_PERIPHID(x)   (((uint32_t)(((uint32_t)(x))<<ROM_PERIPHID0_PERIPHID_SHIFT))&ROM_PERIPHID0_PERIPHID_MASK)

#define  ROM_PERIPHID1_PERIPHID_MASK 0x20u
#define  ROM_PERIPHID1_PERIPHID_SHIFT 0
#define  ROM_PERIPHID1_PERIPHID(x)   (((uint32_t)(((uint32_t)(x))<<ROM_PERIPHID1_PERIPHID_SHIFT))&ROM_PERIPHID1_PERIPHID_MASK)

#define  ROM_PERIPHID2_PERIPHID_MASK 0x20u
#define  ROM_PERIPHID2_PERIPHID_SHIFT 0
#define  ROM_PERIPHID2_PERIPHID(x)   (((uint32_t)(((uint32_t)(x))<<ROM_PERIPHID2_PERIPHID_SHIFT))&ROM_PERIPHID2_PERIPHID_MASK)

#define  ROM_PERIPHID3_PERIPHID_MASK 0x20u
#define  ROM_PERIPHID3_PERIPHID_SHIFT 0
#define  ROM_PERIPHID3_PERIPHID(x)   (((uint32_t)(((uint32_t)(x))<<ROM_PERIPHID3_PERIPHID_SHIFT))&ROM_PERIPHID3_PERIPHID_MASK)

#define  ROM_COMPID0_COMPID_MASK     0x20u
#define  ROM_COMPID0_COMPID_SHIFT    0
#define  ROM_COMPID0_COMPID(x)       (((uint32_t)(((uint32_t)(x))<<ROM_COMPID0_COMPID_SHIFT))&ROM_COMPID0_COMPID_MASK)
//   Component ID

#define  ROM_COMPID1_COMPID_MASK     0x20u
#define  ROM_COMPID1_COMPID_SHIFT    0
#define  ROM_COMPID1_COMPID(x)       (((uint32_t)(((uint32_t)(x))<<ROM_COMPID1_COMPID_SHIFT))&ROM_COMPID1_COMPID_MASK)
//   Component ID

#define  ROM_COMPID2_COMPID_MASK     0x20u
#define  ROM_COMPID2_COMPID_SHIFT    0
#define  ROM_COMPID2_COMPID(x)       (((uint32_t)(((uint32_t)(x))<<ROM_COMPID2_COMPID_SHIFT))&ROM_COMPID2_COMPID_MASK)
//   Component ID

#define  ROM_COMPID3_COMPID_MASK     0x20u
#define  ROM_COMPID3_COMPID_SHIFT    0
#define  ROM_COMPID3_COMPID(x)       (((uint32_t)(((uint32_t)(x))<<ROM_COMPID3_COMPID_SHIFT))&ROM_COMPID3_COMPID_MASK)
//   Component ID

#define  RTC_YEARMON_MON_CNT_MASK    0x4u
#define  RTC_YEARMON_MON_CNT_SHIFT   0
#define  RTC_YEARMON_MON_CNT(x)      (((uint16_t)(((uint16_t)(x))<<RTC_YEARMON_MON_CNT_SHIFT))&RTC_YEARMON_MON_CNT_MASK)
//     0b0 ==> Illegal Value
//     0b1 ==> January
//     0b10 ==> October
//     0b11 ==> November

#define  RTC_YEARMON_YROFST_MASK     0x800u
#define  RTC_YEARMON_YROFST_SHIFT    8
#define  RTC_YEARMON_YROFST(x)       (((uint16_t)(((uint16_t)(x))<<RTC_YEARMON_YROFST_SHIFT))&RTC_YEARMON_YROFST_MASK)
//   Year Offset Count Value

#define  RTC_DAYS_DAY_CNT_MASK       0x5u
#define  RTC_DAYS_DAY_CNT_SHIFT      0
#define  RTC_DAYS_DAY_CNT(x)         (((uint16_t)(((uint16_t)(x))<<RTC_DAYS_DAY_CNT_SHIFT))&RTC_DAYS_DAY_CNT_MASK)
//   Days Counter Value.

#define  RTC_DAYS_DOW_MASK           0x300u
#define  RTC_DAYS_DOW_SHIFT          8
#define  RTC_DAYS_DOW(x)             (((uint16_t)(((uint16_t)(x))<<RTC_DAYS_DOW_SHIFT))&RTC_DAYS_DOW_MASK)
//   Day of Week Counter Value.
//     0b0 ==> Sunday
//     0b1 ==> Monday

#define  RTC_HOURMIN_MIN_CNT_MASK    0x6u
#define  RTC_HOURMIN_MIN_CNT_SHIFT   0
#define  RTC_HOURMIN_MIN_CNT(x)      (((uint16_t)(((uint16_t)(x))<<RTC_HOURMIN_MIN_CNT_SHIFT))&RTC_HOURMIN_MIN_CNT_MASK)
//   Minutes Counter Value.

#define  RTC_HOURMIN_HOUR_CNT_MASK   0x500u
#define  RTC_HOURMIN_HOUR_CNT_SHIFT  8
#define  RTC_HOURMIN_HOUR_CNT(x)     (((uint16_t)(((uint16_t)(x))<<RTC_HOURMIN_HOUR_CNT_SHIFT))&RTC_HOURMIN_HOUR_CNT_MASK)
//   Hours Counter Value.

#define  RTC_SECONDS_SEC_CNT_MASK    0x6u
#define  RTC_SECONDS_SEC_CNT_SHIFT   0
#define  RTC_SECONDS_SEC_CNT(x)      (((uint16_t)(((uint16_t)(x))<<RTC_SECONDS_SEC_CNT_SHIFT))&RTC_SECONDS_SEC_CNT_MASK)
//   Seconds Counter Value.

#define  RTC_ALM_YEARMON_ALM_MON_MASK 0x4u
#define  RTC_ALM_YEARMON_ALM_MON_SHIFT 0
#define  RTC_ALM_YEARMON_ALM_MON(x)  (((uint16_t)(((uint16_t)(x))<<RTC_ALM_YEARMON_ALM_MON_SHIFT))&RTC_ALM_YEARMON_ALM_MON_MASK)
//   Months Value for Alarm.

#define  RTC_ALM_YEARMON_ALM_YEAR_MASK 0x800u
#define  RTC_ALM_YEARMON_ALM_YEAR_SHIFT 8
#define  RTC_ALM_YEARMON_ALM_YEAR(x) (((uint16_t)(((uint16_t)(x))<<RTC_ALM_YEARMON_ALM_YEAR_SHIFT))&RTC_ALM_YEARMON_ALM_YEAR_MASK)
//   Year Value for Alarm.

#define  RTC_ALM_DAYS_ALM_DAY_MASK   0x5u
#define  RTC_ALM_DAYS_ALM_DAY_SHIFT  0
#define  RTC_ALM_DAYS_ALM_DAY(x)     (((uint16_t)(((uint16_t)(x))<<RTC_ALM_DAYS_ALM_DAY_SHIFT))&RTC_ALM_DAYS_ALM_DAY_MASK)
//   Days Value for Alarm.

#define  RTC_ALM_HOURMIN_ALM_MIN_MASK 0x6u
#define  RTC_ALM_HOURMIN_ALM_MIN_SHIFT 0
#define  RTC_ALM_HOURMIN_ALM_MIN(x)  (((uint16_t)(((uint16_t)(x))<<RTC_ALM_HOURMIN_ALM_MIN_SHIFT))&RTC_ALM_HOURMIN_ALM_MIN_MASK)
//   Minutes Value for Alarm.

#define  RTC_ALM_HOURMIN_ALM_HOUR_MASK 0x500u
#define  RTC_ALM_HOURMIN_ALM_HOUR_SHIFT 8
#define  RTC_ALM_HOURMIN_ALM_HOUR(x) (((uint16_t)(((uint16_t)(x))<<RTC_ALM_HOURMIN_ALM_HOUR_SHIFT))&RTC_ALM_HOURMIN_ALM_HOUR_MASK)
//   Hours Value for Alarm.

