iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  RTC_ALM_SECONDS_ALM_SEC_MASK 0x6u
#define  RTC_ALM_SECONDS_ALM_SEC_SHIFT 0
#define  RTC_ALM_SECONDS_ALM_SEC(x)  (((uint16_t)(((uint16_t)(x))<<RTC_ALM_SECONDS_ALM_SEC_SHIFT))&RTC_ALM_SECONDS_ALM_SEC_MASK)

#define  RTC_ALM_SECONDS_DEC_SEC_MASK 0x100u
#define  RTC_ALM_SECONDS_DEC_SEC_SHIFT 8
//   Decrement Seconds Counter by 1.

#define  RTC_ALM_SECONDS_INC_SEC_MASK 0x200u
#define  RTC_ALM_SECONDS_INC_SEC_SHIFT 9
//   Increment Seconds Counter by 1.

#define  RTC_CTRL_FINEEN_MASK        0x1u
#define  RTC_CTRL_FINEEN_SHIFT       0
//   Fine compensation enable bit
//     0b1 ==> Fine compensation is enabled.
//     0b0 ==> Fine compensation is disabled

#define  RTC_CTRL_COMP_EN_MASK       0x2u
#define  RTC_CTRL_COMP_EN_SHIFT      1

#define  RTC_CTRL_ALM_MATCH_MASK     0x8u
#define  RTC_CTRL_ALM_MATCH_SHIFT    2
#define  RTC_CTRL_ALM_MATCH(x)       (((uint16_t)(((uint16_t)(x))<<RTC_CTRL_ALM_MATCH_SHIFT))&RTC_CTRL_ALM_MATCH_MASK)
//   Alarm Match bits.
//     0b00 ==> Only Seconds, Minutes, and Hours matched.
//     0b01 ==> Only Seconds, Minutes, Hours, and Days matched.
//     0b10 ==> Only Seconds, Minutes, Hours, Days, and Months matched.

#define  RTC_CTRL_TIMER_STB_MASK_MASK 0x10u
#define  RTC_CTRL_TIMER_STB_MASK_SHIFT 4
//   Sampling timer clocks mask
//     0b1 ==> Sampling clocks are gated in standby mode
//     0b0 ==> Sampling clocks are not gated when in standby mode

#define  RTC_CTRL_EXTRN_CLK_EN_MASK  0x20u
#define  RTC_CTRL_EXTRN_CLK_EN_SHIFT 5
//   External 1Hz clock enable signal
//     0b1 ==> External 1Hz clock is enabled for the calendaring and counters clock.
//     0b0 ==> External 1Hz clock is disabled for the calendaring and counters clock.

#define  RTC_CTRL_DST_EN_MASK        0x40u
#define  RTC_CTRL_DST_EN_SHIFT       6
//   Daylight Saving Enable.
//     0b0 ==> Disabled. Daylight saving changes are not applied. Daylight saving registers can be modified.
//     0b1 ==> Enabled. Daylight saving changes are applied.

#define  RTC_CTRL_SWR_MASK           0x100u
#define  RTC_CTRL_SWR_SHIFT          8
//   Software Reset bit.
//     0b0 ==> Software Reset cleared.
//     0b1 ==> Software Reset asserted.

#define  RTC_STATUS_INVAL_BIT_MASK   0x1u
#define  RTC_STATUS_INVAL_BIT_SHIFT  0
//   Invalidate CPU read/write access bit.
//     0b0 ==> Time /Date Counters can be read/written. Time /Date is valid.
//     0b1 ==> Time /Date Counter values are changing or Time /Date is invalid and cannot be read or written.

#define  RTC_STATUS_CPU_LOW_VOLT_MASK 0x4u
#define  RTC_STATUS_CPU_LOW_VOLT_SHIFT 2
//   CPU Low Voltage Warning status bit.
//     0b0 ==> CPU in Normal Operating Voltage.
//     0b1 ==> CPU Voltage is below Normal Operating Voltage. RTC Registers in read-only mode.

#define  RTC_STATUS_RST_SRC_MASK     0x8u
#define  RTC_STATUS_RST_SRC_SHIFT    3
//   Reset Source bit.
//     0b0 ==> Part was reset due to Standby Mode Exit (that is when VDD is powered up and VBAT was not powered down at all).
//     0b1 ==> Part was reset due to Power-On Reset (that is Power On Reset when both VBAT and VDD are powered up).

#define  RTC_STATUS_CMP_INT_MASK     0x20u
#define  RTC_STATUS_CMP_INT_SHIFT    5
//   Compensation Interval bit.

#define  RTC_STATUS_BUS_ERR_MASK     0x100u
#define  RTC_STATUS_BUS_ERR_SHIFT    8
//   Bus Error bit.
//     0b0 ==> Read and Write accesses are normal.
//     0b1 ==> Read or Write accesses occurred when INVAL_BIT was asserted.

#define  RTC_STATUS_CMP_DONE_MASK    0x800u
#define  RTC_STATUS_CMP_DONE_SHIFT   11
//   Compensation Done bit.
//     0b0 ==> Compensation busy or not enabled.
//     0b1 ==> Compensation completed.

#define  RTC_ISR_TAMPER_IS_MASK      0x1u
#define  RTC_ISR_TAMPER_IS_SHIFT     0
//   Tamper Interrupt Status bit.
//     0b0 ==> Interrupt is de-asserted.
//     0b1 ==> Interrupt is asserted (Default on reset) .

#define  RTC_ISR_ALM_IS_MASK         0x4u
#define  RTC_ISR_ALM_IS_SHIFT        2
//   Alarm Interrupt Status bit.
//     0b0 ==> Interrupt is de-asserted.
//     0b1 ==> Interrupt is asserted.

#define  RTC_ISR_DAY_IS_MASK         0x8u
#define  RTC_ISR_DAY_IS_SHIFT        3
//   Days Interrupt Status bit.
//     0b0 ==> Interrupt is de-asserted.
//     0b1 ==> Interrupt is asserted.

#define  RTC_ISR_HOUR_IS_MASK        0x10u
#define  RTC_ISR_HOUR_IS_SHIFT       4
//   Hours Interrupt Status bit.
//     0b0 ==> Interrupt is de-asserted.
//     0b1 ==> Interrupt is asserted.

#define  RTC_ISR_MIN_IS_MASK         0x20u
#define  RTC_ISR_MIN_IS_SHIFT        5
//   Minutes Interrupt Status bit.
//     0b0 ==> Interrupt is de-asserted.
//     0b1 ==> Interrupt is asserted.

#define  RTC_ISR_IS_1Hz_MASK         0x40u
#define  RTC_ISR_IS_1Hz_SHIFT        6
//   1 Hz Interval Interrupt Status bit.
//     0b0 ==> Interrupt is de-asserted.
//     0b1 ==> Interrupt is asserted.

#define  RTC_ISR_IS_2Hz_MASK         0x80u
#define  RTC_ISR_IS_2Hz_SHIFT        7
//   2 Hz Interval Interrupt Status bit.
//     0b0 ==> Interrupt is de-asserted.
//     0b1 ==> Interrupt is asserted.

#define  RTC_ISR_IS_4Hz_MASK         0x100u
#define  RTC_ISR_IS_4Hz_SHIFT        8
//   4 Hz Interval Interrupt Status bit.
//     0b0 ==> Interrupt is de-asserted.
//     0b1 ==> Interrupt is asserted.

#define  RTC_ISR_IS_8Hz_MASK         0x200u
#define  RTC_ISR_IS_8Hz_SHIFT        9
//   8 Hz Interval Interrupt Status bit.
//     0b0 ==> Interrupt is de-asserted.
//     0b1 ==> Interrupt is asserted.

#define  RTC_ISR_IS_16Hz_MASK        0x400u
#define  RTC_ISR_IS_16Hz_SHIFT       10
//   16 Hz Interval Interrupt Status bit.
//     0b0 ==> Interrupt is de-asserted.
//     0b1 ==> Interrupt is asserted.

#define  RTC_ISR_IS_32Hz_MASK        0x800u
#define  RTC_ISR_IS_32Hz_SHIFT       11
//   32 Hz Interval Interrupt Status bit.
//     0b0 ==> Interrupt is de-asserted.
//     0b1 ==> Interrupt is asserted.

#define  RTC_ISR_IS_64Hz_MASK        0x1000u
#define  RTC_ISR_IS_64Hz_SHIFT       12
//   64 Hz Interval Interrupt Status bit.
//     0b0 ==> Interrupt is de-asserted.
//     0b1 ==> Interrupt is asserted.

