iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  RTC_ISR_IS_128Hz_MASK       0x2000u
#define  RTC_ISR_IS_128Hz_SHIFT      13
//   128 Hz Interval Interrupt Status bit.
//     0b0 ==> Interrupt is de-asserted.
//     0b1 ==> Interrupt is asserted.

#define  RTC_ISR_IS_256Hz_MASK       0x4000u
#define  RTC_ISR_IS_256Hz_SHIFT      14
//   256 Hz Interval Interrupt Status bit.
//     0b0 ==> Interrupt is de-asserted.
//     0b1 ==> Interrupt is asserted.

#define  RTC_ISR_IS_512Hz_MASK       0x8000u
#define  RTC_ISR_IS_512Hz_SHIFT      15
//   512 Hz Interval Interrupt Status bit.
//     0b0 ==> Interrupt is de-asserted.
//     0b1 ==> Interrupt is asserted.

#define  RTC_IER_TAMPER_IE_MASK      0x1u
#define  RTC_IER_TAMPER_IE_SHIFT     0
//   Tamper Interrupt Enable bit.
//     0b0 ==> Interrupt is disabled.
//     0b1 ==> Interrupt is enabled (Default on reset).

#define  RTC_IER_ALARM_IE_MASK       0x4u
#define  RTC_IER_ALARM_IE_SHIFT      2
//   Alarm Interrupt Enable bit.
//     0b0 ==> Interrupt is disabled.
//     0b1 ==> Interrupt is enabled.

#define  RTC_IER_DAYS_IE_MASK        0x8u
#define  RTC_IER_DAYS_IE_SHIFT       3
//   Days Interrupt Enable bit.
//     0b0 ==> Interrupt is disabled.
//     0b1 ==> Interrupt is enabled.

#define  RTC_IER_HOURS_IE_MASK       0x10u
#define  RTC_IER_HOURS_IE_SHIFT      4
//   Hours Interrupt Enable bit.
//     0b0 ==> Interrupt is disabled.
//     0b1 ==> Interrupt is enabled.

#define  RTC_IER_MIN_IE_MASK         0x20u
#define  RTC_IER_MIN_IE_SHIFT        5
//   Minutes Interrupt Enable bit.
//     0b0 ==> Interrupt is disabled.
//     0b1 ==> Interrupt is enabled.

#define  RTC_IER_IE_1Hz_MASK         0x40u
#define  RTC_IER_IE_1Hz_SHIFT        6
//   1 Hz Interval Interrupt Enable bit.
//     0b0 ==> Interrupt is disabled.
//     0b1 ==> Interrupt is enabled.

#define  RTC_IER_IE_2Hz_MASK         0x80u
#define  RTC_IER_IE_2Hz_SHIFT        7
//   2 Hz Interval Interrupt Enable bit.
//     0b0 ==> Interrupt is disabled.
//     0b1 ==> Interrupt is enabled.

#define  RTC_IER_IE_4Hz_MASK         0x100u
#define  RTC_IER_IE_4Hz_SHIFT        8
//   4 Hz Interval Interrupt Enable bit.
//     0b0 ==> Interrupt is disabled.
//     0b1 ==> Interrupt is enabled.

#define  RTC_IER_IE_8Hz_MASK         0x200u
#define  RTC_IER_IE_8Hz_SHIFT        9
//   8 Hz Interval Interrupt Enable bit.
//     0b0 ==> Interrupt is disabled.
//     0b1 ==> Interrupt is enabled.

#define  RTC_IER_IE_16Hz_MASK        0x400u
#define  RTC_IER_IE_16Hz_SHIFT       10
//   16 Hz Interval Interrupt Enable bit.
//     0b0 ==> Interrupt is disabled.
//     0b1 ==> Interrupt is enabled.

#define  RTC_IER_IE_32Hz_MASK        0x800u
#define  RTC_IER_IE_32Hz_SHIFT       11
//   32 Hz Interval Interrupt Enable bit.
//     0b0 ==> Interrupt is disabled.
//     0b1 ==> Interrupt is enabled.

#define  RTC_IER_IE_64Hz_MASK        0x1000u
#define  RTC_IER_IE_64Hz_SHIFT       12
//   64 Hz Interval Interrupt Enable bit.
//     0b0 ==> Interrupt is disabled.
//     0b1 ==> Interrupt is enabled.

#define  RTC_IER_IE_128Hz_MASK       0x2000u
#define  RTC_IER_IE_128Hz_SHIFT      13
//   128 Hz Interval Interrupt Enable bit.
//     0b0 ==> Interrupt is disabled.
//     0b1 ==> Interrupt is enabled.

#define  RTC_IER_IE_256Hz_MASK       0x4000u
#define  RTC_IER_IE_256Hz_SHIFT      14
//   256 Hz Interval Interrupt Enable bit.
//     0b0 ==> Interrupt is disabled.
//     0b1 ==> Interrupt is enabled.

#define  RTC_IER_IE_512Hz_MASK       0x8000u
#define  RTC_IER_IE_512Hz_SHIFT      15
//   512 Hz Interval Interrupt Enable bit.
//     0b0 ==> Interrupt is disabled.
//     0b1 ==> Interrupt is enabled.

#define  RTC_GP_DATA_REG_GP_DATA_REG_MASK 0x10u
#define  RTC_GP_DATA_REG_GP_DATA_REG_SHIFT 0
#define  RTC_GP_DATA_REG_GP_DATA_REG(x) (((uint16_t)(((uint16_t)(x))<<RTC_GP_DATA_REG_GP_DATA_REG_SHIFT))&RTC_GP_DATA_REG_GP_DATA_REG_MASK)

#define  RTC_DST_HOUR_DST_END_HOUR_MASK 0x5u
#define  RTC_DST_HOUR_DST_END_HOUR_SHIFT 0
#define  RTC_DST_HOUR_DST_END_HOUR(x) (((uint16_t)(((uint16_t)(x))<<RTC_DST_HOUR_DST_END_HOUR_SHIFT))&RTC_DST_HOUR_DST_END_HOUR_MASK)
//   Daylight Saving Time (DST) Hours End Value.

#define  RTC_DST_HOUR_DST_START_HOUR_MASK 0x500u
#define  RTC_DST_HOUR_DST_START_HOUR_SHIFT 8
#define  RTC_DST_HOUR_DST_START_HOUR(x) (((uint16_t)(((uint16_t)(x))<<RTC_DST_HOUR_DST_START_HOUR_SHIFT))&RTC_DST_HOUR_DST_START_HOUR_MASK)
//   Daylight Saving Time (DST) Hours Start Value.

#define  RTC_DST_MONTH_DST_END_MONTH_MASK 0x4u
#define  RTC_DST_MONTH_DST_END_MONTH_SHIFT 0
#define  RTC_DST_MONTH_DST_END_MONTH(x) (((uint16_t)(((uint16_t)(x))<<RTC_DST_MONTH_DST_END_MONTH_SHIFT))&RTC_DST_MONTH_DST_END_MONTH_MASK)
//   Daylight Saving Time (DST) Month End Value.

#define  RTC_DST_MONTH_DST_START_MONTH_MASK 0x400u
#define  RTC_DST_MONTH_DST_START_MONTH_SHIFT 8
#define  RTC_DST_MONTH_DST_START_MONTH(x) (((uint16_t)(((uint16_t)(x))<<RTC_DST_MONTH_DST_START_MONTH_SHIFT))&RTC_DST_MONTH_DST_START_MONTH_MASK)
//   Daylight Saving Time (DST) Month Start Value.

#define  RTC_DST_DAY_DST_END_DAY_MASK 0x5u
#define  RTC_DST_DAY_DST_END_DAY_SHIFT 0
#define  RTC_DST_DAY_DST_END_DAY(x)  (((uint16_t)(((uint16_t)(x))<<RTC_DST_DAY_DST_END_DAY_SHIFT))&RTC_DST_DAY_DST_END_DAY_MASK)
//   Daylight Saving Time (DST) Day End Value.

#define  RTC_DST_DAY_DST_START_DAY_MASK 0x500u
#define  RTC_DST_DAY_DST_START_DAY_SHIFT 8
#define  RTC_DST_DAY_DST_START_DAY(x) (((uint16_t)(((uint16_t)(x))<<RTC_DST_DAY_DST_START_DAY_SHIFT))&RTC_DST_DAY_DST_START_DAY_MASK)
//   Daylight Saving Time (DST) Start Day Value.

#define  RTC_COMPEN_COMPEN_VAL_MASK  0x10u
#define  RTC_COMPEN_COMPEN_VAL_SHIFT 0
#define  RTC_COMPEN_COMPEN_VAL(x)    (((uint16_t)(((uint16_t)(x))<<RTC_COMPEN_COMPEN_VAL_SHIFT))&RTC_COMPEN_COMPEN_VAL_MASK)
//   Compensation Value

#define  RTC_TAMPER_DIRECTIONAL_A_P_TAMP_MASK 0x4u
#define  RTC_TAMPER_DIRECTIONAL_A_P_TAMP_SHIFT 0
#define  RTC_TAMPER_DIRECTIONAL_A_P_TAMP(x) (((uint16_t)(((uint16_t)(x))<<RTC_TAMPER_DIRECTIONAL_A_P_TAMP_SHIFT))&RTC_TAMPER_DIRECTIONAL_A_P_TAMP_MASK)

#define  RTC_TAMPER_DIRECTIONAL_I_O_TAMP_MASK 0x400u
#define  RTC_TAMPER_DIRECTIONAL_I_O_TAMP_SHIFT 8
#define  RTC_TAMPER_DIRECTIONAL_I_O_TAMP(x) (((uint16_t)(((uint16_t)(x))<<RTC_TAMPER_DIRECTIONAL_I_O_TAMP_SHIFT))&RTC_TAMPER_DIRECTIONAL_I_O_TAMP_MASK)

#define  RTC_TAMPER_INT_Q_FULL_MASK  0x1u
#define  RTC_TAMPER_INT_Q_FULL_SHIFT 0

#define  RTC_TAMPER_INT_Q_FULL_INT_EN_MASK 0x2u
#define  RTC_TAMPER_INT_Q_FULL_INT_EN_SHIFT 1

#define  RTC_TAMPER_INT_Q_CLEAR_MASK 0x4u
#define  RTC_TAMPER_INT_Q_CLEAR_SHIFT 2

#define  RTC_TAMPER_INT_LFSR_CLK_SEL_MASK 0x300u
#define  RTC_TAMPER_INT_LFSR_CLK_SEL_SHIFT 8
#define  RTC_TAMPER_INT_LFSR_CLK_SEL(x) (((uint16_t)(((uint16_t)(x))<<RTC_TAMPER_INT_LFSR_CLK_SEL_SHIFT))&RTC_TAMPER_INT_LFSR_CLK_SEL_MASK)

#define  RTC_TAMPER_INT_LFSR_DURATION_MASK 0x4000u
#define  RTC_TAMPER_INT_LFSR_DURATION_SHIFT 12
#define  RTC_TAMPER_INT_LFSR_DURATION(x) (((uint16_t)(((uint16_t)(x))<<RTC_TAMPER_INT_LFSR_DURATION_SHIFT))&RTC_TAMPER_INT_LFSR_DURATION_MASK)

#define  RTC_TTSR_YEAR_TS_YROFST_MASK 0x800u
#define  RTC_TTSR_YEAR_TS_YROFST_SHIFT 8
#define  RTC_TTSR_YEAR_TS_YROFST(x)  (((uint16_t)(((uint16_t)(x))<<RTC_TTSR_YEAR_TS_YROFST_SHIFT))&RTC_TTSR_YEAR_TS_YROFST_MASK)
//   Year Value for Tamper Time Stamp

#define  RTC_FILTER01_CFG_FIL_DUR1_MASK 0x4u
#define  RTC_FILTER01_CFG_FIL_DUR1_SHIFT 0
#define  RTC_FILTER01_CFG_FIL_DUR1(x) (((uint16_t)(((uint16_t)(x))<<RTC_FILTER01_CFG_FIL_DUR1_SHIFT))&RTC_FILTER01_CFG_FIL_DUR1_MASK)
//   Tamper Detect Bit 1 Filter Duration
//     0b0 ==> Filtering operation disabled.

