iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  RTC_FILTER01_CFG_CLK_SEL1_MASK 0x30u
#define  RTC_FILTER01_CFG_CLK_SEL1_SHIFT 4
#define  RTC_FILTER01_CFG_CLK_SEL1(x) (((uint16_t)(((uint16_t)(x))<<RTC_FILTER01_CFG_CLK_SEL1_SHIFT))&RTC_FILTER01_CFG_CLK_SEL1_MASK)
//   Tamper Filter 1 Clock Select
//     0b0 ==> Clock to tamper filter 1 is 32.768 kHz (Oscillator clock)
//     0b1 ==> Clock to tamper filter 1 is 512 Hz Tamper filter duration is 2.85ms (i.e. 1.5 clock) to 125ms (64 clocks) in increments of 1.95ms.

#define  RTC_FILTER01_CFG_POL1_MASK  0x80u
#define  RTC_FILTER01_CFG_POL1_SHIFT 7
//   Tamper Detect Input Bit 1 Polarity Control
//     0b0 ==> Tamper detect input bit 1 is active high.
//     0b1 ==> Tamper detect input bit 1 is active low.

#define  RTC_FILTER01_CFG_FIL_DUR0_MASK 0x400u
#define  RTC_FILTER01_CFG_FIL_DUR0_SHIFT 8
#define  RTC_FILTER01_CFG_FIL_DUR0(x) (((uint16_t)(((uint16_t)(x))<<RTC_FILTER01_CFG_FIL_DUR0_SHIFT))&RTC_FILTER01_CFG_FIL_DUR0_MASK)
//   Tamper Detect Bit 0 Filter Duration
//     0b0 ==> Filtering operation disabled.

#define  RTC_FILTER01_CFG_CLK_SEL0_MASK 0x3000u
#define  RTC_FILTER01_CFG_CLK_SEL0_SHIFT 12
#define  RTC_FILTER01_CFG_CLK_SEL0(x) (((uint16_t)(((uint16_t)(x))<<RTC_FILTER01_CFG_CLK_SEL0_SHIFT))&RTC_FILTER01_CFG_CLK_SEL0_MASK)
//   Tamper Filter 0 Clock Select
//     0b0 ==> Clock to tamper filter 0 is 32.768 kHz (Oscillator clock) Tamper filter duration is 45.5us (i.e. 1.5 clock) to 1.95ms (64 clocks) in increments of 30.5us.
//     0b1 ==> Clock to tamper filter 0 is 512 Hz Tamper filter duration is 2.85ms (i.e. 1.5 clock) to 125ms (64 clocks) in increments of 1.95ms.

#define  RTC_FILTER01_CFG_POL0_MASK  0x8000u
#define  RTC_FILTER01_CFG_POL0_SHIFT 15
//   Tamper Detect Input Bit 0 Polarity Control
//     0b0 ==> Tamper detect input bit 0 is active high.
//     0b1 ==> Tamper detect input bit 0 is active low.

#define  RTC_FILTER23_CFG_FIL_DUR3_MASK 0x4u
#define  RTC_FILTER23_CFG_FIL_DUR3_SHIFT 0
#define  RTC_FILTER23_CFG_FIL_DUR3(x) (((uint16_t)(((uint16_t)(x))<<RTC_FILTER23_CFG_FIL_DUR3_SHIFT))&RTC_FILTER23_CFG_FIL_DUR3_MASK)
//   Tamper Detect Bit 3 Filter Duration
//     0b0 ==> Filtering operation disabled.

#define  RTC_FILTER23_CFG_CLK_SEL3_MASK 0x30u
#define  RTC_FILTER23_CFG_CLK_SEL3_SHIFT 4
#define  RTC_FILTER23_CFG_CLK_SEL3(x) (((uint16_t)(((uint16_t)(x))<<RTC_FILTER23_CFG_CLK_SEL3_SHIFT))&RTC_FILTER23_CFG_CLK_SEL3_MASK)
//   Tamper Filter 3 Clock Select
//     0b0 ==> Clock to tamper filter 3 is 32.768 kHz (Oscillator clock) Tamper filter duration is 45.5us (i.e. 1.5 clock) to 1.95ms (64 clocks) in increments of 30.5us.
//     0b1 ==> Clock to tamper filter 3is 512 Hz Tamper filter duration is 2.85ms (i.e. 1.5 clock) to 125ms (64 clocks) in increments of 1.95ms.

#define  RTC_FILTER23_CFG_POL3_MASK  0x80u
#define  RTC_FILTER23_CFG_POL3_SHIFT 7
//   Tamper Detect Input Bit 3 Polarity Control
//     0b0 ==> Tamper detect input bit 3 is active high.
//     0b1 ==> Tamper detect input bit 3 is active low.

#define  RTC_FILTER23_CFG_FIL_DUR2_MASK 0x400u
#define  RTC_FILTER23_CFG_FIL_DUR2_SHIFT 8
#define  RTC_FILTER23_CFG_FIL_DUR2(x) (((uint16_t)(((uint16_t)(x))<<RTC_FILTER23_CFG_FIL_DUR2_SHIFT))&RTC_FILTER23_CFG_FIL_DUR2_MASK)
//   Tamper Detect Bit 2 Filter Duration
//     0b0 ==> Filtering operation disabled.

#define  RTC_FILTER23_CFG_CLK_SEL2_MASK 0x3000u
#define  RTC_FILTER23_CFG_CLK_SEL2_SHIFT 12
#define  RTC_FILTER23_CFG_CLK_SEL2(x) (((uint16_t)(((uint16_t)(x))<<RTC_FILTER23_CFG_CLK_SEL2_SHIFT))&RTC_FILTER23_CFG_CLK_SEL2_MASK)
//   Tamper Filter 2 Clock Select
//     0b0 ==> Clock to tamper filter 2 is 32.768 kHz (Oscillator clock) Tamper filter duration is 45.5us (i.e. 1.5 clock) to 1.95ms (64 clocks) in increments of 30.5us.
//     0b1 ==> Clock to tamper filter 2 is 512 Hz Tamper filter duration is 2.85ms (i.e. 1.5 clock) to 125ms (64 clocks) in increments of 1.95ms.

#define  RTC_FILTER23_CFG_POL2_MASK  0x8000u
#define  RTC_FILTER23_CFG_POL2_SHIFT 15
//   Tamper Detect Input Bit 2 Polarity Control
//     0b0 ==> Tamper detect input bit 2 is active high.
//     0b1 ==> Tamper detect input bit 2 is active low.

#define  RTC_TAMPER_QUEUE_TAMPER_DATA_MASK 0x10u
#define  RTC_TAMPER_QUEUE_TAMPER_DATA_SHIFT 0
#define  RTC_TAMPER_QUEUE_TAMPER_DATA(x) (((uint16_t)(((uint16_t)(x))<<RTC_TAMPER_QUEUE_TAMPER_DATA_SHIFT))&RTC_TAMPER_QUEUE_TAMPER_DATA_MASK)
//   Tamper type stamp and pin number information register

#define  SIM_SOPT1_SRAM_SIZE_MASK    0x4000u
#define  SIM_SOPT1_SRAM_SIZE_SHIFT   12
#define  SIM_SOPT1_SRAM_SIZE(x)      (((uint32_t)(((uint32_t)(x))<<SIM_SOPT1_SRAM_SIZE_SHIFT))&SIM_SOPT1_SRAM_SIZE_MASK)
//   Returns the size of the system RAM
//     0b0101 ==> 16kB System RAM

#define  SIM_SOPT1_OSC32KSEL_MASK    0x80000u
#define  SIM_SOPT1_OSC32KSEL_SHIFT   18
#define  SIM_SOPT1_OSC32KSEL(x)      (((uint32_t)(((uint32_t)(x))<<SIM_SOPT1_OSC32KSEL_SHIFT))&SIM_SOPT1_OSC32KSEL_MASK)
//   32K oscillator clock select
//     0b00 ==> RTC 32KHz
//     0b01 ==> MHz Oscillator 32K Clock
//     0b10 ==> MCG irclk
//     0b11 ==> LPO 1kHz

#define  SIM_SOPT1_CFG_lptimer_ch1_sel_MASK 0x2u
#define  SIM_SOPT1_CFG_lptimer_ch1_sel_SHIFT 0
#define  SIM_SOPT1_CFG_lptimer_ch1_sel(x) (((uint32_t)(((uint32_t)(x))<<SIM_SOPT1_CFG_lptimer_ch1_sel_SHIFT))&SIM_SOPT1_CFG_lptimer_ch1_sel_MASK)
//   LP timer Channel1 Select
//     0b00 ==> = Pad PTE4
//     0b01 ==> = Pad PTF4
//     0b10 ==> = Pad PTG1
//     0b11 ==> = Reserved

#define  SIM_SOPT1_CFG_lptimer_ch2_sel_MASK 0x8u
#define  SIM_SOPT1_CFG_lptimer_ch2_sel_SHIFT 2
#define  SIM_SOPT1_CFG_lptimer_ch2_sel(x) (((uint32_t)(((uint32_t)(x))<<SIM_SOPT1_CFG_lptimer_ch2_sel_SHIFT))&SIM_SOPT1_CFG_lptimer_ch2_sel_MASK)
//   LP timer Channel2 Select
//     0b00 ==> = Pad PTD6
//     0b01 ==> = Pad PTF3
//     0b10 ==> = Pad PTG5
//     0b11 ==> = Reserved

#define  SIM_SOPT1_CFG_lptimer_ch3_sel_MASK 0x20u
#define  SIM_SOPT1_CFG_lptimer_ch3_sel_SHIFT 4
#define  SIM_SOPT1_CFG_lptimer_ch3_sel(x) (((uint32_t)(((uint32_t)(x))<<SIM_SOPT1_CFG_lptimer_ch3_sel_SHIFT))&SIM_SOPT1_CFG_lptimer_ch3_sel_MASK)
//   LP timer Channel3 Select
//     0b00 ==> = Pad PTD5
//     0b01 ==> = Pad PTG0
//     0b10 ==> = Pad PTG6
//     0b11 ==> = Reserved

#define  SIM_SOPT1_CFG_cmpout_lptim_ch_sel_MASK 0x40u
#define  SIM_SOPT1_CFG_cmpout_lptim_ch_sel_SHIFT 6
//   Comparator output selection for LPTIMER channel0
//     0b0 ==> CMP[1] output selected as LPTIMER input[0]
//     0b1 ==> CMP[0] output selected as LPTIMER input[0]

#define  SIM_SOPT1_CFG_RAMSBDIS_MASK 0x100u
#define  SIM_SOPT1_CFG_RAMSBDIS_SHIFT 8
//     0b0 ==> = Source bias of System SRAM enabled during VLPR and VLPW modes.
//     0b1 ==> = Source bias of System SRAM disabled during VLPR and VLPW modes.

#define  SIM_SOPT1_CFG_RAMBPEN_MASK  0x200u
#define  SIM_SOPT1_CFG_RAMBPEN_SHIFT 9
//   RAM Bitline Precharge Enable
//     0b0 ==> = Bitline precharge of system SRAM disabled during VLPR and VLPW modes.
//     0b1 ==> = Bitline precharge of system SRAM enabled during VLPR and VLPW modes.

#define  SIM_CTRL_REG_NMI_DIS_MASK   0x1u
#define  SIM_CTRL_REG_NMI_DIS_SHIFT  0
//   NMI Disable
//     0b0 ==> = NMI enabled
//     0b1 ==> = NMI disabled

