iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  SIM_CTRL_REG_Clkout_sel_MASK 0x60u
#define  SIM_CTRL_REG_Clkout_sel_SHIFT 5
#define  SIM_CTRL_REG_Clkout_sel(x)  (((uint32_t)(((uint32_t)(x))<<SIM_CTRL_REG_Clkout_sel_SHIFT))&SIM_CTRL_REG_Clkout_sel_MASK)
//   Clock out Select
//     0b000 ==> = Disabled
//     0b001 ==> = Gated Core Clk
//     0b010 ==> = Bus/Flash Clk
//     0b011 ==> = LPO clock from PMC (may be removed since this is part of Muxed 32Khz source)
//     0b100 ==> = IRC clock from MCG (may be removed since this is part of Muxed 32Khz source)
//     0b101 ==> Muxed 32Khz source (please refer SOPT1[19:18] for possible options)
//     0b110 ==> Mhz Oscillator external reference clock
//     0b111 ==> PLL clock output from MCG

#define  SIM_CTRL_REG_Trace_clk_sel_MASK 0x1000u
#define  SIM_CTRL_REG_Trace_clk_sel_SHIFT 12
//   Trace clock select
//     0b0 ==> = mcg system output (mcg_out_clk)
//     0b1 ==> = platform free running clock

#define  SIM_SOPT3_VALDIS_MASK       0x100u
#define  SIM_SOPT3_VALDIS_SHIFT      8
//   Self-Time Adjust Disable
//     0b0 ==> Enable self-time adjust of compiled memories.
//     0b1 ==> Disable self-time adjust of compiled memories.

#define  SIM_SOPT3_VALRD_MASK        0x600u
#define  SIM_SOPT3_VALRD_SHIFT       9
#define  SIM_SOPT3_VALRD(x)          (((uint32_t)(((uint32_t)(x))<<SIM_SOPT3_VALRD_SHIFT))&SIM_SOPT3_VALRD_MASK)
//   Read Timing Control Value

#define  SIM_SOPT3_VALWR_MASK        0x3000u
#define  SIM_SOPT3_VALWR_SHIFT       12
#define  SIM_SOPT3_VALWR(x)          (((uint32_t)(((uint32_t)(x))<<SIM_SOPT3_VALWR_SHIFT))&SIM_SOPT3_VALWR_MASK)
//   Write Timing Control Value

#define  SIM_SOPT3_IFR_LCD_EN_MASK   0x8000u
#define  SIM_SOPT3_IFR_LCD_EN_SHIFT  15
//   LCD IFR control

#define  SIM_SDID_PINID_MASK         0x4u
#define  SIM_SDID_PINID_SHIFT        0
#define  SIM_SDID_PINID(x)           (((uint32_t)(((uint32_t)(x))<<SIM_SDID_PINID_SHIFT))&SIM_SDID_PINID_MASK)
//   Pincount identification
//     0b0011 ==> 44-pin
//     0b0100 ==> Reserved
//     0b0101 ==> 64-pin
//     0b0110 ==> Reserved
//     0b0111 ==> Reserved
//     0b1000 ==> 100-pin
//     0b1001 ==> Reserved
//     0b1010 ==> Reserved
//     0b1011 ==> Reserved
//     0b1100 ==> Reserved
//     0b1101 ==> Reserved
//     0b1110 ==> Reserved
//     0b1111 ==> Reserved

#define  SIM_SDID_DIE_ID_MASK        0x40u
#define  SIM_SDID_DIE_ID_SHIFT       4
#define  SIM_SDID_DIE_ID(x)          (((uint32_t)(((uint32_t)(x))<<SIM_SDID_DIE_ID_SHIFT))&SIM_SDID_DIE_ID_MASK)
//     0b0000 ==> First cut Photon Part

#define  SIM_SDID_REV_ID_MASK        0x400u
#define  SIM_SDID_REV_ID_SHIFT       8
#define  SIM_SDID_REV_ID(x)          (((uint32_t)(((uint32_t)(x))<<SIM_SDID_REV_ID_SHIFT))&SIM_SDID_REV_ID_MASK)
//     0b0000 ==> First cut Photon part

#define  SIM_SDID_SRAM_SIZE_MASK     0x4000u
#define  SIM_SDID_SRAM_SIZE_SHIFT    12
#define  SIM_SDID_SRAM_SIZE(x)       (((uint32_t)(((uint32_t)(x))<<SIM_SDID_SRAM_SIZE_SHIFT))&SIM_SDID_SRAM_SIZE_MASK)
//     0b0101 ==> 16kB SRAM

#define  SIM_SDID_ATTR_MASK          0x40000u
#define  SIM_SDID_ATTR_SHIFT         16
#define  SIM_SDID_ATTR(x)            (((uint32_t)(((uint32_t)(x))<<SIM_SDID_ATTR_SHIFT))&SIM_SDID_ATTR_MASK)
//     0b0000 ==> M0+ core

#define  SIM_SDID_SERIES_ID_MASK     0x400000u
#define  SIM_SDID_SERIES_ID_SHIFT    20
#define  SIM_SDID_SERIES_ID(x)       (((uint32_t)(((uint32_t)(x))<<SIM_SDID_SERIES_ID_SHIFT))&SIM_SDID_SERIES_ID_MASK)
//   Kinetis Attribute ID
//     0b0011 ==> Metering Series

#define  SIM_SDID_SUB_FAM_ID_MASK    0x4000000u
#define  SIM_SDID_SUB_FAM_ID_SHIFT   24
#define  SIM_SDID_SUB_FAM_ID(x)      (((uint32_t)(((uint32_t)(x))<<SIM_SDID_SUB_FAM_ID_SHIFT))&SIM_SDID_SUB_FAM_ID_MASK)
//   Kinetis Sub-Family ID
//     0b0010 ==> Photon with 2 AFE enabled
//     0b0011 ==> Photon with 3 AFE enabled
//     0b0100 ==> Photon with 4 AFE enabled

#define  SIM_SDID_FAM_ID_MASK        0x40000000u
#define  SIM_SDID_FAM_ID_SHIFT       28
#define  SIM_SDID_FAM_ID(x)          (((uint32_t)(((uint32_t)(x))<<SIM_SDID_FAM_ID_SHIFT))&SIM_SDID_FAM_ID_MASK)
//   Metering family ID
//     0b0001 ==> Photon without LCD
//     0b0011 ==> Photon with LCD

#define  SIM_SCGC4_EWM_MASK          0x2u
#define  SIM_SCGC4_EWM_SHIFT         1
//   External Watchdog Monitor Clock gate control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC4_MCG_MASK          0x10u
#define  SIM_SCGC4_MCG_SHIFT         4
//   MCG clock gate control.
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC4_OSC_32K_MASK      0x20u
#define  SIM_SCGC4_OSC_32K_SHIFT     5
//   Oscillator (32Khz) Clock gate control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC4_OSC_MASK          0x40u
#define  SIM_SCGC4_OSC_SHIFT         6
//   Oscillator (Mhz) Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC4_IIC0_MASK         0x80u
#define  SIM_SCGC4_IIC0_SHIFT        7
//   IIC0 Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC4_IIC1_MASK         0x100u
#define  SIM_SCGC4_IIC1_SHIFT        8
//   IIC1 Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC4_SCI0_MASK         0x400u
#define  SIM_SCGC4_SCI0_SHIFT        10
//   SCI0 Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC4_SCI1_MASK         0x800u
#define  SIM_SCGC4_SCI1_SHIFT        11
//   SCI1 Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC4_SCI2_MASK         0x1000u
#define  SIM_SCGC4_SCI2_SHIFT        12
//   SCI2 Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC4_SCI3_MASK         0x2000u
#define  SIM_SCGC4_SCI3_SHIFT        13
//   SCI3 Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC4_VREF_MASK         0x8000u
#define  SIM_SCGC4_VREF_SHIFT        15
//   VREF Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

