iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  SIM_SCGC4_HSCMP0_MASK       0x40000u
#define  SIM_SCGC4_HSCMP0_SHIFT      18
//   High Speed Comparator0 Clock Gate Control.
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC4_HSCMP1_MASK       0x80000u
#define  SIM_SCGC4_HSCMP1_SHIFT      19
//   High Speed Comparator1 Clock Gate Control.
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC4_SPI0_MASK         0x200000u
#define  SIM_SCGC4_SPI0_SHIFT        21
//   SPI0 Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC4_SPI1_MASK         0x400000u
#define  SIM_SCGC4_SPI1_SHIFT        22
//   SPI1 Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC4_RCM_MASK          0x8000000u
#define  SIM_SCGC4_RCM_SHIFT         27
//   Reset Controller Module Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC4_LLWU_MASK         0x10000000u
#define  SIM_SCGC4_LLWU_SHIFT        28
//   Low Leakage Wake Up Unit Clock Gate Control.
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC4_PMC_MASK          0x20000000u
#define  SIM_SCGC4_PMC_SHIFT         29
//   Power Mode Controller Clock Gate Control.
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC4_SMC_MASK          0x40000000u
#define  SIM_SCGC4_SMC_SHIFT         30
//   System Mode Controller Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC5_ATX_MASK          0x2u
#define  SIM_SCGC5_ATX_SHIFT         1
//   ATX clock gating control
//     0b0 ==> Disables the clock for the ATX module (default)
//     0b1 ==> Enables the clock for the ATX module

#define  SIM_SCGC5_SGLCD_MASK        0x8u
#define  SIM_SCGC5_SGLCD_SHIFT       3
//   Segmented LCD Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC5_PCTLA_MASK        0x40u
#define  SIM_SCGC5_PCTLA_SHIFT       6
//   PCTLA Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC5_PCTLB_MASK        0x80u
#define  SIM_SCGC5_PCTLB_SHIFT       7
//   PCTLB Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC5_PCTLC_MASK        0x100u
#define  SIM_SCGC5_PCTLC_SHIFT       8
//   PCTLC Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC5_PCTLD_MASK        0x200u
#define  SIM_SCGC5_PCTLD_SHIFT       9
//   PCTLD Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC5_PCTLE_MASK        0x400u
#define  SIM_SCGC5_PCTLE_SHIFT       10
//   PCTLE Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC5_PCTLF_MASK        0x800u
#define  SIM_SCGC5_PCTLF_SHIFT       11
//   PCTLF Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC5_PCTLG_MASK        0x1000u
#define  SIM_SCGC5_PCTLG_SHIFT       12
//   PCTLG Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC5_PCTLH_MASK        0x2000u
#define  SIM_SCGC5_PCTLH_SHIFT       13
//   PCTLH Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC5_PCTLI_MASK        0x4000u
#define  SIM_SCGC5_PCTLI_SHIFT       14
//   PCTLI Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC5_IRTC_MASK         0x10000u
#define  SIM_SCGC5_IRTC_SHIFT        16
//   IRTC Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC5_IRTC_REG_FILE_MASK 0x20000u
#define  SIM_SCGC5_IRTC_REG_FILE_SHIFT 17
//   IRTC_REG_FILE Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC5_WDOG_MASK         0x80000u
#define  SIM_SCGC5_WDOG_SHIFT        19
//   Watchdog Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC5_PXBAR_MASK        0x200000u
#define  SIM_SCGC5_PXBAR_SHIFT       21
//   Peripheral Crossbar Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC5_QTMR0_MASK        0x800000u
#define  SIM_SCGC5_QTMR0_SHIFT       23
//   Quadtimer0 Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC5_QTMR1_MASK        0x1000000u
#define  SIM_SCGC5_QTMR1_SHIFT       24
//   Quadtimer1 Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC5_QTMR2_MASK        0x2000000u
#define  SIM_SCGC5_QTMR2_SHIFT       25
//   Quadtimer2 Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC5_QTMR3_MASK        0x4000000u
#define  SIM_SCGC5_QTMR3_SHIFT       26
//   Quadtimer3 Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC6_FTFA_MASK         0x1u
#define  SIM_SCGC6_FTFA_SHIFT        0
//   FTFA Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC6_DMA_MUX0_MASK     0x2u
#define  SIM_SCGC6_DMA_MUX0_SHIFT    1
//   DMA_MUX0 Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC6_DMA_MUX1_MASK     0x4u
#define  SIM_SCGC6_DMA_MUX1_SHIFT    2
//   DMA_MUX1 Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC6_DMA_MUX2_MASK     0x8u
#define  SIM_SCGC6_DMA_MUX2_SHIFT    3
//   DMA_MUX2 Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC6_DMA_MUX3_MASK     0x10u
#define  SIM_SCGC6_DMA_MUX3_SHIFT    4
//   DMA_MUX3 Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC6_RNGA_MASK         0x200u
#define  SIM_SCGC6_RNGA_SHIFT        9
//   RNGA Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC6_SAR_ADC_MASK      0x800u
#define  SIM_SCGC6_SAR_ADC_SHIFT     11
//   SAR ADC Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC6_PIT0_MASK         0x2000u
#define  SIM_SCGC6_PIT0_SHIFT        13
//   PIT0 Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC6_PIT1_MASK         0x4000u
#define  SIM_SCGC6_PIT1_SHIFT        14
//   PIT1 Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC6_AFE_CH1_MASK      0x10000u
#define  SIM_SCGC6_AFE_CH1_SHIFT     16
//   AFE Channel1 Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC6_AFE_CH2_MASK      0x20000u
#define  SIM_SCGC6_AFE_CH2_SHIFT     17
//   AFE Channel2 Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

