iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  SIM_SCGC6_AFE_CH3_MASK      0x40000u
#define  SIM_SCGC6_AFE_CH3_SHIFT     18
//   AFE Channel3 Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC6_AFE_CH4_MASK      0x80000u
#define  SIM_SCGC6_AFE_CH4_SHIFT     19
//   AFE Channel4 Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC6_PCRC_MASK         0x100000u
#define  SIM_SCGC6_PCRC_SHIFT        20
//   Programmable CRC Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC6_LPTIMER_MASK      0x10000000u
#define  SIM_SCGC6_LPTIMER_SHIFT     28
//   LPTIMER Clock Gate Control
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC6_SIM_DGO_MASK      0x40000000u
#define  SIM_SCGC6_SIM_DGO_SHIFT     30
//   SIM_DGO Clock Gate Control
//     0b1 ==> = Clock is enabled
//     0b0 ==> = Clock is disabled

#define  SIM_SCGC6_SIM_MASK          0x80000000u
#define  SIM_SCGC6_SIM_SHIFT         31
//   SIM Clock Gate Control
//     0b1 ==> = Clock is always enabled to SIM

#define  SIM_SCGC7_MPU_MASK          0x1u
#define  SIM_SCGC7_MPU_SHIFT         0
//   MPU Clock Gate control.
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_SCGC7_DMA_MASK          0x2u
#define  SIM_SCGC7_DMA_SHIFT         1
//   DMA Clock Gate control.
//     0b0 ==> = Clock disabled
//     0b1 ==> = Clock enabled

#define  SIM_CLKDIV1_SYS_CLK_MODE_MASK 0x8000000u
#define  SIM_CLKDIV1_SYS_CLK_MODE_SHIFT 27
//   System Clock Mode
//     0b0 ==> = 1:1:1
//     0b1 ==> = 2:1:1

#define  SIM_CLKDIV1_SYS_DIV_MASK    0x40000000u
#define  SIM_CLKDIV1_SYS_DIV_SHIFT   28
#define  SIM_CLKDIV1_SYS_DIV(x)      (((uint32_t)(((uint32_t)(x))<<SIM_CLKDIV1_SYS_DIV_SHIFT))&SIM_CLKDIV1_SYS_DIV_MASK)
//   System Clock divider
//     0b0000 ==> = Divide by 1
//     0b0001 ==> = Divide by 2
//     0b0010 ==> = Divide by 3
//     0b0011 ==> = Divide by 4 and so on..... If FOPT[0] is set the divider is set to div-by-8 after system reset is deasserted (after completion of system initialization sequence)

#define  SIM_FCFG1_FLASHDIS_MASK     0x1u
#define  SIM_FCFG1_FLASHDIS_SHIFT    0
//   Flash Disable
//     0b0 ==> Flash is enabled
//     0b1 ==> Flash is disabled

#define  SIM_FCFG1_FLASHDOZE_MASK    0x2u
#define  SIM_FCFG1_FLASHDOZE_SHIFT   1
//   Flash Doze
//     0b0 ==> Flash remains enabled during Wait mode
//     0b1 ==> Flash is disabled for the duration of Wait mode

#define  SIM_FCFG1_PFSIZE_MASK       0x4000000u
#define  SIM_FCFG1_PFSIZE_SHIFT      24
#define  SIM_FCFG1_PFSIZE(x)         (((uint32_t)(((uint32_t)(x))<<SIM_FCFG1_PFSIZE_SHIFT))&SIM_FCFG1_PFSIZE_MASK)
//   Program flash size
//     0b0000 ==> 0 KB of program flash memory, 0 KB protection region
//     0b0001 ==> 8 KB of program flash memory, 1 KB protection region
//     0b0011 ==> 16 KB of program flash memory, 1 KB protection region
//     0b0100 ==> 24 KB of program flash memory, 1 KB protection region
//     0b0101 ==> 32 KB of program flash memory, 1 KB protection region
//     0b0110 ==> 48 KB of program flash memory, 2 KB protection region
//     0b0111 ==> 64 KB of program flash memory, 2 KB protection region
//     0b1000 ==> 96 KB of program flash memory, 4 KB protection region
//     0b1001 ==> 128 KB of program flash memory, 4 KB protection region
//     0b1111 ==> (Default)

#define  SIM_FCFG2_MAXADDR_MASK      0x7000000u
#define  SIM_FCFG2_MAXADDR_SHIFT     24
#define  SIM_FCFG2_MAXADDR(x)        (((uint32_t)(((uint32_t)(x))<<SIM_FCFG2_MAXADDR_SHIFT))&SIM_FCFG2_MAXADDR_MASK)
//   Max address block

#define  SIM_UID0_UID_MASK           0x20u
#define  SIM_UID0_UID_SHIFT          0
#define  SIM_UID0_UID(x)             (((uint32_t)(((uint32_t)(x))<<SIM_UID0_UID_SHIFT))&SIM_UID0_UID_MASK)
//   Unique Identification

#define  SIM_UID1_UID_MASK           0x20u
#define  SIM_UID1_UID_SHIFT          0
#define  SIM_UID1_UID(x)             (((uint32_t)(((uint32_t)(x))<<SIM_UID1_UID_SHIFT))&SIM_UID1_UID_MASK)
//   Unique Identification

#define  SIM_UID2_UID_MASK           0x20u
#define  SIM_UID2_UID_SHIFT          0
#define  SIM_UID2_UID(x)             (((uint32_t)(((uint32_t)(x))<<SIM_UID2_UID_SHIFT))&SIM_UID2_UID_MASK)
//   Unique Identification

#define  SIM_UID3_UID_MASK           0x20u
#define  SIM_UID3_UID_SHIFT          0
#define  SIM_UID3_UID(x)             (((uint32_t)(((uint32_t)(x))<<SIM_UID3_UID_SHIFT))&SIM_UID3_UID_MASK)
//   Unique Identification

#define  SIM_MISC_CTL_afe_mod_out_sel_MASK 0x2u
#define  SIM_MISC_CTL_afe_mod_out_sel_SHIFT 0
#define  SIM_MISC_CTL_afe_mod_out_sel(x) (((uint32_t)(((uint32_t)(x))<<SIM_MISC_CTL_afe_mod_out_sel_SHIFT))&SIM_MISC_CTL_afe_mod_out_sel_MASK)
//   AFE Modulator Output Selection
//     0b00 ==> = Sigma Delta Modulator 0 data output
//     0b01 ==> = Sigma Delta Modulator 1 data output
//     0b10 ==> = Sigma Delta Modulator 2 data output
//     0b11 ==> = Sigma Delta Modulator 3 data output

#define  SIM_MISC_CTL_dma_done_sel_MASK 0x8u
#define  SIM_MISC_CTL_dma_done_sel_SHIFT 2
#define  SIM_MISC_CTL_dma_done_sel(x) (((uint32_t)(((uint32_t)(x))<<SIM_MISC_CTL_dma_done_sel_SHIFT))&SIM_MISC_CTL_dma_done_sel_MASK)
//   DMA Done flag select
//     0b00 ==> = DMA0
//     0b01 ==> = DMA1
//     0b10 ==> = DMA2
//     0b11 ==> = DMA3

#define  SIM_MISC_CTL_sci0_irda_sel_MASK 0x100u
#define  SIM_MISC_CTL_sci0_irda_sel_SHIFT 8
//   Selects SCI0 for IRDA operation
//     0b0 ==> = Pad RX input (PTD[0] or PTF[3], as selected in Pinmux control) selected for RX input of SCI0 and SCI0 TX signal is not used for modulation
//     0b1 ==> = SCI0 selected for IRDA modulation. SCI0 TX modulated by PXBAR_OUT[14] and SCI0 RX input connected to PXBAR_OUT[13]

#define  SIM_MISC_CTL_sci1_irda_sel_MASK 0x200u
#define  SIM_MISC_CTL_sci1_irda_sel_SHIFT 9
//   Selects SCI1 for IRDA operation
//     0b0 ==> = Pad RX input (PTD[2] or PTI[0], as selected in Pinmux control) selected for RX input of SCI1 and SCI1 TX signal is not used for modulation
//     0b1 ==> = SCI1 selected for IRDA modulation. SCI1 TX modulated by PXBAR_OUT[14] and SCI1 RX input connected to PXBAR_OUT[13]

#define  SIM_MISC_CTL_sci2_irda_sel_MASK 0x400u
#define  SIM_MISC_CTL_sci2_irda_sel_SHIFT 10
//   Selects SCI2 for IRDA operation
//     0b0 ==> = = Pad RX input PTE[6] selected for RX input of SCI2 and SCI2 TX signal is not used for modulation
//     0b1 ==> = SCI2 selected for IRDA modulation. SCI2 TX modulated by PXBAR_OUT[14] and SCI2 RX input connected to PXBAR_OUT[13].

#define  SIM_MISC_CTL_sci3_irda_sel_MASK 0x800u
#define  SIM_MISC_CTL_sci3_irda_sel_SHIFT 11
//   Selects SCI3 for IRDA operation
//     0b0 ==> = Pad RX input (PTC[3] or PTD[7], as selected in Pinmux control) selected for RX input of SCI3 and SCI3 TX signal is not used for modulation
//     0b1 ==> = SCI3 selected for IRDA modulation. SCI3 TX modulated by PXBAR_OUT[14] and SCI3 RX input connected to PXBAR_OUT[13].

#define  SIM_MISC_CTL_pit_sel_MASK   0x2000u
#define  SIM_MISC_CTL_pit_sel_SHIFT  12
#define  SIM_MISC_CTL_pit_sel(x)     (((uint32_t)(((uint32_t)(x))<<SIM_MISC_CTL_pit_sel_SHIFT))&SIM_MISC_CTL_pit_sel_MASK)
//   PIT Output select
//     0b00 ==> = PIT0 [0] (default)
//     0b01 ==> = PIT0 [1]
//     0b10 ==> = PIT1[0]
//     0b11 ==> = PIT1[1]

#define  SIM_MISC_CTL_EWM_IN_Sel_MASK 0x4000u
#define  SIM_MISC_CTL_EWM_IN_Sel_SHIFT 14
//   External Watchdog Monitor Select
//     0b0 ==> = Input from PAD (PTE[2] or PTE[4] as selected from Pinmux control )
//     0b1 ==> = Peripheral Crossbar (PXBAR) Output[11]

#define  SIM_MISC_CTL_tmr_ch0_sel_MASK 0x10000u
#define  SIM_MISC_CTL_tmr_ch0_sel_SHIFT 16
//   Quadtimer Channel0 Select
//     0b0 ==> = Pad PTF1 or PTD5, depending upon PCTL configuration.
//     0b1 ==> = Peripheral Crossbar (PXBAR) Output[5]

