iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  SIM_MISC_CTL_tmr_ch1_sel_MASK 0x20000u
#define  SIM_MISC_CTL_tmr_ch1_sel_SHIFT 17
//   Quadtimer Channel1 Select
//     0b0 ==> = Pad PTG0 or PTC6, depending upon PCTL configuration.
//     0b1 ==> = Peripheral Crossbar (PXBAR) Output[6]

#define  SIM_MISC_CTL_tmr_ch2_sel_MASK 0x40000u
#define  SIM_MISC_CTL_tmr_ch2_sel_SHIFT 18
//   Quadtimer Channel2 Select
//     0b0 ==> = Pad PTF7 or PTF0, depending upon PCTL configuration.
//     0b1 ==> = Peripheral Crossbar (PXBAR) Output[7]

#define  SIM_MISC_CTL_tmr_ch3_sel_MASK 0x80000u
#define  SIM_MISC_CTL_tmr_ch3_sel_SHIFT 19
//   Quadtimer Channel3 Select
//     0b0 ==> = Pad PTE5 or PTD1, depending upon PCTL configuration.
//     0b1 ==> = Peripheral Crossbar (PXBAR) Output[8]

#define  SIM_MISC_CTL_tmr_clk0_sel_MASK 0x200000u
#define  SIM_MISC_CTL_tmr_clk0_sel_SHIFT 20
#define  SIM_MISC_CTL_tmr_clk0_sel(x) (((uint32_t)(((uint32_t)(x))<<SIM_MISC_CTL_tmr_clk0_sel_SHIFT))&SIM_MISC_CTL_tmr_clk0_sel_MASK)
//   Quadtimer Channel0 Clock Select
//     0b00 ==> = Bus Clock
//     0b01 ==> = Peripheral Crossbar Output [9]
//     0b10 ==> = Peripheral Crossbar Output [10]
//     0b11 ==> = Reserved

#define  SIM_MISC_CTL_tmr_clk1_sel_MASK 0x800000u
#define  SIM_MISC_CTL_tmr_clk1_sel_SHIFT 22
#define  SIM_MISC_CTL_tmr_clk1_sel(x) (((uint32_t)(((uint32_t)(x))<<SIM_MISC_CTL_tmr_clk1_sel_SHIFT))&SIM_MISC_CTL_tmr_clk1_sel_MASK)
//   Quadtimer Channel1 Clock Select
//     0b00 ==> = Bus Clock
//     0b01 ==> = Peripheral Crossbar Output [9]
//     0b10 ==> = Peripheral Crossbar Output [10]
//     0b11 ==> = Reserved

#define  SIM_MISC_CTL_tmr_clk2_sel_MASK 0x2000000u
#define  SIM_MISC_CTL_tmr_clk2_sel_SHIFT 24
#define  SIM_MISC_CTL_tmr_clk2_sel(x) (((uint32_t)(((uint32_t)(x))<<SIM_MISC_CTL_tmr_clk2_sel_SHIFT))&SIM_MISC_CTL_tmr_clk2_sel_MASK)
//   Quadtimer Channel2 Clock Select
//     0b00 ==> = Bus Clock
//     0b01 ==> = Peripheral Crossbar Input [9]
//     0b10 ==> = Peripheral Crossbar Input [10]
//     0b11 ==> = Reserved

#define  SIM_MISC_CTL_tmr_clk3_sel_MASK 0x8000000u
#define  SIM_MISC_CTL_tmr_clk3_sel_SHIFT 26
#define  SIM_MISC_CTL_tmr_clk3_sel(x) (((uint32_t)(((uint32_t)(x))<<SIM_MISC_CTL_tmr_clk3_sel_SHIFT))&SIM_MISC_CTL_tmr_clk3_sel_MASK)
//   Quadtimer Channel3 Clock Select
//     0b00 ==> = Bus Clock
//     0b01 ==> = Peripheral Crossbar Input [9]
//     0b10 ==> = Peripheral Crossbar Input [10]
//     0b11 ==> = Reserved

#define  SIM_MISC_CTL_rtc_ir_clk_sel_MASK 0x10000000u
#define  SIM_MISC_CTL_rtc_ir_clk_sel_SHIFT 28
//   RTC IRC Clock select
//     0b0 ==> = RTC OSC_32K clock selected
//     0b1 ==> = IRC Clock selected

#define  SIM_MISC_CTL_Vref_buffer_cap_sel_MASK 0x20000000u
#define  SIM_MISC_CTL_Vref_buffer_cap_sel_SHIFT 29
//   Operates switch in VrefBuffer to enable the internal 1.2v reference to be driven to VREF pad.
//     0b0 ==> Buffer does not drive PAD
//     0b1 ==> Buffer drives selected voltage (selected by vref_buffer_sel) on pad

#define  SIM_MISC_CTL_Vref_buffer_sel_MASK 0x40000000u
#define  SIM_MISC_CTL_Vref_buffer_sel_SHIFT 30
//   Slects Between Internal 1.2v reference and external reference for SAR and DAC
//     0b0 ==> Internal Reference selected as Buffer Input
//     0b1 ==> External Reference selected as Buffer Input

#define  SIM_MISC_CTL_Vref_buffer_pd_MASK 0x80000000u
#define  SIM_MISC_CTL_Vref_buffer_pd_SHIFT 31
//   Powers down VrefBuffer when set
//     0b0 ==> Buffer Enabled
//     0b1 ==> Buffer Powered Down

#define  SIM_ADC_COMP0_ADC_COMP_VAL0_MASK 0x10u
#define  SIM_ADC_COMP0_ADC_COMP_VAL0_SHIFT 0
#define  SIM_ADC_COMP0_ADC_COMP_VAL0(x) (((uint32_t)(((uint32_t)(x))<<SIM_ADC_COMP0_ADC_COMP_VAL0_SHIFT))&SIM_ADC_COMP0_ADC_COMP_VAL0_MASK)
//   ADC Temperature Compensation Value

#define  SIM_ADC_COMP0_ADC_COMP_VAL1_MASK 0x100000u
#define  SIM_ADC_COMP0_ADC_COMP_VAL1_SHIFT 16
#define  SIM_ADC_COMP0_ADC_COMP_VAL1(x) (((uint32_t)(((uint32_t)(x))<<SIM_ADC_COMP0_ADC_COMP_VAL1_SHIFT))&SIM_ADC_COMP0_ADC_COMP_VAL1_MASK)
//   ADC Temperature Compensation Value

#define  SIM_ADC_COMP1_ADC_COMP_VAL2_MASK 0x10u
#define  SIM_ADC_COMP1_ADC_COMP_VAL2_SHIFT 0
#define  SIM_ADC_COMP1_ADC_COMP_VAL2(x) (((uint32_t)(((uint32_t)(x))<<SIM_ADC_COMP1_ADC_COMP_VAL2_SHIFT))&SIM_ADC_COMP1_ADC_COMP_VAL2_MASK)
//   ADC Temperature Compensation Value

#define  SMC_PMPROT_AVLLS_MASK       0x2u
#define  SMC_PMPROT_AVLLS_SHIFT      1
//   Allow Very-Low-Leakage Stop Mode
//     0b0 ==> Any VLLSx mode is not allowed
//     0b1 ==> Any VLLSx mode is allowed

#define  SMC_PMPROT_AVLP_MASK        0x20u
#define  SMC_PMPROT_AVLP_SHIFT       5
//   Allow Very-Low-Power Modes
//     0b0 ==> VLPR, VLPW and VLPS are not allowed
//     0b1 ==> VLPR, VLPW and VLPS are allowed

#define  SMC_PMCTRL_STOPM_MASK       0x3u
#define  SMC_PMCTRL_STOPM_SHIFT      0
#define  SMC_PMCTRL_STOPM(x)         (((uint8_t)(((uint8_t)(x))<<SMC_PMCTRL_STOPM_SHIFT))&SMC_PMCTRL_STOPM_MASK)
//   Stop Mode Control
//     0b000 ==> Normal Stop (STOP)
//     0b001 ==> Reserved
//     0b010 ==> Very-Low-Power Stop (VLPS)
//     0b011 ==> Reserved
//     0b100 ==> Very-Low-Leakage Stop (VLLSx)
//     0b101 ==> Reserved
//     0b110 ==> Reseved
//     0b111 ==> Reserved

#define  SMC_PMCTRL_STOPA_MASK       0x8u
#define  SMC_PMCTRL_STOPA_SHIFT      3
//   Stop Aborted
//     0b0 ==> The previous stop mode entry was successsful.
//     0b1 ==> The previous stop mode entry was aborted.

#define  SMC_PMCTRL_RUNM_MASK        0x40u
#define  SMC_PMCTRL_RUNM_SHIFT       5
#define  SMC_PMCTRL_RUNM(x)          (((uint8_t)(((uint8_t)(x))<<SMC_PMCTRL_RUNM_SHIFT))&SMC_PMCTRL_RUNM_MASK)
//   Run Mode Control
//     0b00 ==> Normal Run mode (RUN)
//     0b01 ==> Reserved
//     0b10 ==> Very-Low-Power Run mode (VLPR)
//     0b11 ==> Reserved

#define  SMC_STOPCTRL_VLLSM_MASK     0x3u
#define  SMC_STOPCTRL_VLLSM_SHIFT    0
#define  SMC_STOPCTRL_VLLSM(x)       (((uint8_t)(((uint8_t)(x))<<SMC_STOPCTRL_VLLSM_SHIFT))&SMC_STOPCTRL_VLLSM_MASK)
//   VLLS Mode Control.
//     0b000 ==> VLLS0
//     0b001 ==> VLLS1
//     0b010 ==> VLLS2
//     0b011 ==> VLLS3
//     0b100 ==> Reserved
//     0b101 ==> Reserved
//     0b110 ==> Reserved
//     0b111 ==> Reserved

#define  SMC_STOPCTRL_PORPO_MASK     0x20u
#define  SMC_STOPCTRL_PORPO_SHIFT    5
//   POR Power Option
//     0b0 ==> POR detect circuit is enabled in VLLS0
//     0b1 ==> POR detect circuit is disabled in VLLS0

#define  SMC_STOPCTRL_PSTOPO_MASK    0x80u
#define  SMC_STOPCTRL_PSTOPO_SHIFT   6
#define  SMC_STOPCTRL_PSTOPO(x)      (((uint8_t)(((uint8_t)(x))<<SMC_STOPCTRL_PSTOPO_SHIFT))&SMC_STOPCTRL_PSTOPO_MASK)
//   Partial Stop Option
//     0b00 ==> STOP - Normal Stop mode
//     0b01 ==> PSTOP1 - Partial Stop with both system and bus clocks disabled
//     0b10 ==> PSTOP2 - Partial Stop with system clock disabled and bus clock enabled
//     0b11 ==> Reserved

#define  SMC_PMSTAT_PMSTAT_MASK      0x7u
#define  SMC_PMSTAT_PMSTAT_SHIFT     0
#define  SMC_PMSTAT_PMSTAT(x)        (((uint8_t)(((uint8_t)(x))<<SMC_PMSTAT_PMSTAT_SHIFT))&SMC_PMSTAT_PMSTAT_MASK)

#define  SPI0_C1_LSBFE_MASK          0x1u
#define  SPI0_C1_LSBFE_SHIFT         0
//   LSB first (shifter direction)
//     0b0 ==> SPI serial data transfers start with most significant bit
//     0b1 ==> SPI serial data transfers start with least significant bit

#define  SPI0_C1_SSOE_MASK           0x2u
#define  SPI0_C1_SSOE_SHIFT          1
//   Slave select output enable
//     0b0 ==> When MODFEN is 0: In master mode, SS pin function is general-purpose I/O (not SPI). In slave mode, SS pin function is slave select input. When MODFEN is 1: In master mode, SS pin function is SS input for mode fault. In slave mode, SS pin function is slave select input.
//     0b1 ==> When MODFEN is 0: In master mode, SS pin function is general-purpose I/O (not SPI). In slave mode, SS pin function is slave select input. When MODFEN is 1: In master mode, SS pin function is automatic SS output. In slave mode: SS pin function is slave select input.

#define  SPI0_C1_CPHA_MASK           0x4u
#define  SPI0_C1_CPHA_SHIFT          2
//   Clock phase
//     0b0 ==> First edge on SPSCK occurs at the middle of the first cycle of a data transfer
//     0b1 ==> First edge on SPSCK occurs at the start of the first cycle of a data transfer

