iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  SPI0_DL_Bits_MASK           0x8u
#define  SPI0_DL_Bits_SHIFT          0
#define  SPI0_DL_Bits(x)             (((uint8_t)(((uint8_t)(x))<<SPI0_DL_Bits_SHIFT))&SPI0_DL_Bits_MASK)
//   Data (low byte)

#define  SPI0_MH_Bits_MASK           0x8u
#define  SPI0_MH_Bits_SHIFT          0
#define  SPI0_MH_Bits(x)             (((uint8_t)(((uint8_t)(x))<<SPI0_MH_Bits_SHIFT))&SPI0_MH_Bits_MASK)
//   Hardware compare value (high byte)

#define  SPI0_ML_Bits_MASK           0x8u
#define  SPI0_ML_Bits_SHIFT          0
#define  SPI0_ML_Bits(x)             (((uint8_t)(((uint8_t)(x))<<SPI0_ML_Bits_SHIFT))&SPI0_ML_Bits_MASK)
//   Hardware compare value (low byte)

#define  SPI0_C3_FIFOMODE_MASK       0x1u
#define  SPI0_C3_FIFOMODE_SHIFT      0
//   FIFO mode enable
//     0b0 ==> Buffer mode disabled
//     0b1 ==> Data available in the receive data buffer

#define  SPI0_C3_RNFULLIEN_MASK      0x2u
#define  SPI0_C3_RNFULLIEN_SHIFT     1
//   Receive FIFO nearly full interrupt enable
//     0b0 ==> No interrupt upon RNFULLF being set
//     0b1 ==> Enable interrupts upon RNFULLF being set

#define  SPI0_C3_TNEARIEN_MASK       0x4u
#define  SPI0_C3_TNEARIEN_SHIFT      2
//   Transmit FIFO nearly empty interrupt enable
//     0b0 ==> No interrupt upon TNEAREF being set
//     0b1 ==> Enable interrupts upon TNEAREF being set

#define  SPI0_C3_INTCLR_MASK         0x8u
#define  SPI0_C3_INTCLR_SHIFT        3
//   Interrupt clearing mechanism select
//     0b0 ==> These interrupts are cleared when the corresponding flags are cleared depending on the state of the FIFOs
//     0b1 ==> These interrupts are cleared by writing the corresponding bits in the CI register

#define  SPI0_C3_RNFULLF_MARK_MASK   0x10u
#define  SPI0_C3_RNFULLF_MARK_SHIFT  4
//   Receive FIFO nearly full watermark
//     0b0 ==> RNFULLF is set when the receive FIFO has 48 bits or more
//     0b1 ==> RNFULLF is set when the receive FIFO has 32 bits or more

#define  SPI0_C3_TNEAREF_MARK_MASK   0x20u
#define  SPI0_C3_TNEAREF_MARK_SHIFT  5
//   Transmit FIFO nearly empty watermark
//     0b0 ==> TNEAREF is set when the transmit FIFO has 16 bits or less
//     0b1 ==> TNEAREF is set when the transmit FIFO has 32 bits or less

#define  SPI0_CI_SPRFCI_MASK         0x1u
#define  SPI0_CI_SPRFCI_SHIFT        0
//   Receive FIFO full flag clear interrupt

#define  SPI0_CI_SPTEFCI_MASK        0x2u
#define  SPI0_CI_SPTEFCI_SHIFT       1
//   Transmit FIFO empty flag clear interrupt

#define  SPI0_CI_RNFULLFCI_MASK      0x4u
#define  SPI0_CI_RNFULLFCI_SHIFT     2
//   Receive FIFO nearly full flag clear interrupt

#define  SPI0_CI_TNEAREFCI_MASK      0x8u
#define  SPI0_CI_TNEAREFCI_SHIFT     3
//   Transmit FIFO nearly empty flag clear interrupt

#define  SPI0_CI_RXFOF_MASK          0x10u
#define  SPI0_CI_RXFOF_SHIFT         4
//   Receive FIFO overflow flag
//     0b0 ==> Receive FIFO overflow condition has not occurred
//     0b1 ==> Receive FIFO overflow condition occurred

#define  SPI0_CI_TXFOF_MASK          0x20u
#define  SPI0_CI_TXFOF_SHIFT         5
//   Transmit FIFO overflow flag
//     0b0 ==> Transmit FIFO overflow condition has not occurred
//     0b1 ==> Transmit FIFO overflow condition occurred

#define  SPI0_CI_RXFERR_MASK         0x40u
#define  SPI0_CI_RXFERR_SHIFT        6
//   Receive FIFO error flag
//     0b0 ==> No receive FIFO error occurred
//     0b1 ==> A receive FIFO error occurred

#define  SPI0_CI_TXFERR_MASK         0x80u
#define  SPI0_CI_TXFERR_SHIFT        7
//   Transmit FIFO error flag
//     0b0 ==> No transmit FIFO error occurred
//     0b1 ==> A transmit FIFO error occurred

#define  SPI1_C1_LSBFE_MASK          0x1u
#define  SPI1_C1_LSBFE_SHIFT         0
//   LSB first (shifter direction)
//     0b0 ==> SPI serial data transfers start with most significant bit
//     0b1 ==> SPI serial data transfers start with least significant bit

#define  SPI1_C1_SSOE_MASK           0x2u
#define  SPI1_C1_SSOE_SHIFT          1
//   Slave select output enable
//     0b0 ==> When MODFEN is 0: In master mode, SS pin function is general-purpose I/O (not SPI). In slave mode, SS pin function is slave select input. When MODFEN is 1: In master mode, SS pin function is SS input for mode fault. In slave mode, SS pin function is slave select input.
//     0b1 ==> When MODFEN is 0: In master mode, SS pin function is general-purpose I/O (not SPI). In slave mode, SS pin function is slave select input. When MODFEN is 1: In master mode, SS pin function is automatic SS output. In slave mode: SS pin function is slave select input.

#define  SPI1_C1_CPHA_MASK           0x4u
#define  SPI1_C1_CPHA_SHIFT          2
//   Clock phase
//     0b0 ==> First edge on SPSCK occurs at the middle of the first cycle of a data transfer
//     0b1 ==> First edge on SPSCK occurs at the start of the first cycle of a data transfer

#define  SPI1_C1_CPOL_MASK           0x8u
#define  SPI1_C1_CPOL_SHIFT          3
//   Clock polarity
//     0b0 ==> Active-high SPI clock (idles low)
//     0b1 ==> Active-low SPI clock (idles high)

#define  SPI1_C1_MSTR_MASK           0x10u
#define  SPI1_C1_MSTR_SHIFT          4
//   Master/slave mode select
//     0b0 ==> SPI module configured as a slave SPI device
//     0b1 ==> SPI module configured as a master SPI device

#define  SPI1_C1_SPTIE_MASK          0x20u
#define  SPI1_C1_SPTIE_SHIFT         5
//   SPI transmit interrupt enable
//     0b0 ==> Interrupts from SPTEF inhibited (use polling)
//     0b1 ==> When SPTEF is 1, hardware interrupt requested

#define  SPI1_C1_SPE_MASK            0x40u
#define  SPI1_C1_SPE_SHIFT           6
//   SPI system enable
//     0b0 ==> SPI system inactive
//     0b1 ==> SPI system enabled

#define  SPI1_C1_SPIE_MASK           0x80u
#define  SPI1_C1_SPIE_SHIFT          7
//   SPI interrupt enable: for SPRF and MODF (when FIFO is not supported or not enabled) or for read FIFO (when FIFO is supported and enabled)
//     0b0 ==> Interrupts from SPRF and MODF are inhibited-use polling (when FIFOMODE is not present or is 0) or Read FIFO Full Interrupts are disabled (when FIFOMODE is 1)
//     0b1 ==> Request a hardware interrupt when SPRF or MODF is 1 (when FIFOMODE is not present or is 0) or Read FIFO Full Interrupts are enabled (when FIFOMODE is 1)

