iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  SPI1_DL_Bits_MASK           0x8u
#define  SPI1_DL_Bits_SHIFT          0
#define  SPI1_DL_Bits(x)             (((uint8_t)(((uint8_t)(x))<<SPI1_DL_Bits_SHIFT))&SPI1_DL_Bits_MASK)
//   Data (low byte)

#define  SPI1_MH_Bits_MASK           0x8u
#define  SPI1_MH_Bits_SHIFT          0
#define  SPI1_MH_Bits(x)             (((uint8_t)(((uint8_t)(x))<<SPI1_MH_Bits_SHIFT))&SPI1_MH_Bits_MASK)
//   Hardware compare value (high byte)

#define  SPI1_ML_Bits_MASK           0x8u
#define  SPI1_ML_Bits_SHIFT          0
#define  SPI1_ML_Bits(x)             (((uint8_t)(((uint8_t)(x))<<SPI1_ML_Bits_SHIFT))&SPI1_ML_Bits_MASK)
//   Hardware compare value (low byte)

#define  SPI1_C3_FIFOMODE_MASK       0x1u
#define  SPI1_C3_FIFOMODE_SHIFT      0
//   FIFO mode enable
//     0b0 ==> Buffer mode disabled
//     0b1 ==> Data available in the receive data buffer

#define  SPI1_C3_RNFULLIEN_MASK      0x2u
#define  SPI1_C3_RNFULLIEN_SHIFT     1
//   Receive FIFO nearly full interrupt enable
//     0b0 ==> No interrupt upon RNFULLF being set
//     0b1 ==> Enable interrupts upon RNFULLF being set

#define  SPI1_C3_TNEARIEN_MASK       0x4u
#define  SPI1_C3_TNEARIEN_SHIFT      2
//   Transmit FIFO nearly empty interrupt enable
//     0b0 ==> No interrupt upon TNEAREF being set
//     0b1 ==> Enable interrupts upon TNEAREF being set

#define  SPI1_C3_INTCLR_MASK         0x8u
#define  SPI1_C3_INTCLR_SHIFT        3
//   Interrupt clearing mechanism select
//     0b0 ==> These interrupts are cleared when the corresponding flags are cleared depending on the state of the FIFOs
//     0b1 ==> These interrupts are cleared by writing the corresponding bits in the CI register

#define  SPI1_C3_RNFULLF_MARK_MASK   0x10u
#define  SPI1_C3_RNFULLF_MARK_SHIFT  4
//   Receive FIFO nearly full watermark
//     0b0 ==> RNFULLF is set when the receive FIFO has 48 bits or more
//     0b1 ==> RNFULLF is set when the receive FIFO has 32 bits or more

#define  SPI1_C3_TNEAREF_MARK_MASK   0x20u
#define  SPI1_C3_TNEAREF_MARK_SHIFT  5
//   Transmit FIFO nearly empty watermark
//     0b0 ==> TNEAREF is set when the transmit FIFO has 16 bits or less
//     0b1 ==> TNEAREF is set when the transmit FIFO has 32 bits or less

#define  SPI1_CI_SPRFCI_MASK         0x1u
#define  SPI1_CI_SPRFCI_SHIFT        0
//   Receive FIFO full flag clear interrupt

#define  SPI1_CI_SPTEFCI_MASK        0x2u
#define  SPI1_CI_SPTEFCI_SHIFT       1
//   Transmit FIFO empty flag clear interrupt

#define  SPI1_CI_RNFULLFCI_MASK      0x4u
#define  SPI1_CI_RNFULLFCI_SHIFT     2
//   Receive FIFO nearly full flag clear interrupt

#define  SPI1_CI_TNEAREFCI_MASK      0x8u
#define  SPI1_CI_TNEAREFCI_SHIFT     3
//   Transmit FIFO nearly empty flag clear interrupt

#define  SPI1_CI_RXFOF_MASK          0x10u
#define  SPI1_CI_RXFOF_SHIFT         4
//   Receive FIFO overflow flag
//     0b0 ==> Receive FIFO overflow condition has not occurred
//     0b1 ==> Receive FIFO overflow condition occurred

#define  SPI1_CI_TXFOF_MASK          0x20u
#define  SPI1_CI_TXFOF_SHIFT         5
//   Transmit FIFO overflow flag
//     0b0 ==> Transmit FIFO overflow condition has not occurred
//     0b1 ==> Transmit FIFO overflow condition occurred

#define  SPI1_CI_RXFERR_MASK         0x40u
#define  SPI1_CI_RXFERR_SHIFT        6
//   Receive FIFO error flag
//     0b0 ==> No receive FIFO error occurred
//     0b1 ==> A receive FIFO error occurred

#define  SPI1_CI_TXFERR_MASK         0x80u
#define  SPI1_CI_TXFERR_SHIFT        7
//   Transmit FIFO error flag
//     0b0 ==> No transmit FIFO error occurred
//     0b1 ==> A transmit FIFO error occurred

#define  TMR0_0_COMP1_COMPARISON_1_MASK 0x10u
#define  TMR0_0_COMP1_COMPARISON_1_SHIFT 0
#define  TMR0_0_COMP1_COMPARISON_1(x) (((uint16_t)(((uint16_t)(x))<<TMR0_0_COMP1_COMPARISON_1_SHIFT))&TMR0_0_COMP1_COMPARISON_1_MASK)
//   Comparison Value 1

#define  TMR0_0_COMP2_COMPARISON_2_MASK 0x10u
#define  TMR0_0_COMP2_COMPARISON_2_SHIFT 0
#define  TMR0_0_COMP2_COMPARISON_2(x) (((uint16_t)(((uint16_t)(x))<<TMR0_0_COMP2_COMPARISON_2_SHIFT))&TMR0_0_COMP2_COMPARISON_2_MASK)
//   Comparison Value 2

#define  TMR0_0_CAPT_CAPTURE_MASK    0x10u
#define  TMR0_0_CAPT_CAPTURE_SHIFT   0
#define  TMR0_0_CAPT_CAPTURE(x)      (((uint16_t)(((uint16_t)(x))<<TMR0_0_CAPT_CAPTURE_SHIFT))&TMR0_0_CAPT_CAPTURE_MASK)
//   Capture Value

#define  TMR0_0_LOAD_LOAD_MASK       0x10u
#define  TMR0_0_LOAD_LOAD_SHIFT      0
#define  TMR0_0_LOAD_LOAD(x)         (((uint16_t)(((uint16_t)(x))<<TMR0_0_LOAD_LOAD_SHIFT))&TMR0_0_LOAD_LOAD_MASK)
//   Timer Load Register

#define  TMR0_0_HOLD_HOLD_MASK       0x10u
#define  TMR0_0_HOLD_HOLD_SHIFT      0
#define  TMR0_0_HOLD_HOLD(x)         (((uint16_t)(((uint16_t)(x))<<TMR0_0_HOLD_HOLD_SHIFT))&TMR0_0_HOLD_HOLD_MASK)

#define  TMR0_0_CNTR_COUNTER_MASK    0x10u
#define  TMR0_0_CNTR_COUNTER_SHIFT   0
#define  TMR0_0_CNTR_COUNTER(x)      (((uint16_t)(((uint16_t)(x))<<TMR0_0_CNTR_COUNTER_SHIFT))&TMR0_0_CNTR_COUNTER_MASK)

#define  TMR0_0_CTRL_OUTMODE_MASK    0x3u
#define  TMR0_0_CTRL_OUTMODE_SHIFT   0
#define  TMR0_0_CTRL_OUTMODE(x)      (((uint16_t)(((uint16_t)(x))<<TMR0_0_CTRL_OUTMODE_SHIFT))&TMR0_0_CTRL_OUTMODE_MASK)
//   Output Mode
//     0b000 ==> Asserted while counter is active
//     0b001 ==> Clear OFLAG output on successful compare
//     0b010 ==> Set OFLAG output on successful compare
//     0b011 ==> Toggle OFLAG output on successful compare
//     0b100 ==> Toggle OFLAG output using alternating compare registers
//     0b101 ==> Set on compare, cleared on secondary source input edge
//     0b110 ==> Set on compare, cleared on counter rollover
//     0b111 ==> Enable gated clock output while counter is active

#define  TMR0_0_CTRL_COINIT_MASK     0x8u
#define  TMR0_0_CTRL_COINIT_SHIFT    3
//   Co-Channel Initialization
//     0b0 ==> Co-channel counter/timers cannot force a re-initialization of this counter/timer
//     0b1 ==> Co-channel counter/timers may force a re-initialization of this counter/timer

#define  TMR0_0_CTRL_DIR_MASK        0x10u
#define  TMR0_0_CTRL_DIR_SHIFT       4
//   Count Direction
//     0b0 ==> Count up.
//     0b1 ==> Count down.

#define  TMR0_0_CTRL_LENGTH_MASK     0x20u
#define  TMR0_0_CTRL_LENGTH_SHIFT    5
//   Count Length
//     0b0 ==> Roll over.
//     0b1 ==> Count until compare, then re-initialize. If counting up, a successful compare occurs when the counter reaches a COMP1 value. If counting down, a successful compare occurs when the counter reaches a COMP2 value. When output mode $4 is used, alternating values of COMP1 and COMP2 are used to generate successful comparisons. For example, the counter counts until a COMP1 value is reached, re-initializes, counts until COMP2 value is reached, re-initializes, counts until COMP1 value
//             is reached, and so on.

#define  TMR0_0_CTRL_ONCE_MASK       0x40u
#define  TMR0_0_CTRL_ONCE_SHIFT      6
//   Count Once
//     0b0 ==> Count repeatedly.
//     0b1 ==> Count until compare and then stop. If counting up, a successful compare occurs when the counter reaches a COMP1 value. If counting down, a successful compare occurs when the counter reaches a COMP2 value. When output mode $4 is used, the counter re-initializes after reaching the COMP1 value, continues to count to the COMP2 value, and then stops.

#define  TMR0_0_CTRL_SCS_MASK        0x100u
#define  TMR0_0_CTRL_SCS_SHIFT       7
#define  TMR0_0_CTRL_SCS(x)          (((uint16_t)(((uint16_t)(x))<<TMR0_0_CTRL_SCS_SHIFT))&TMR0_0_CTRL_SCS_MASK)
//   Secondary Count Source
//     0b00 ==> Counter 0 input pin
//     0b01 ==> Counter 1 input pin
//     0b10 ==> Counter 2 input pin
//     0b11 ==> Counter 3 input pin

#define  TMR0_0_CTRL_PCS_MASK        0x800u
#define  TMR0_0_CTRL_PCS_SHIFT       9
#define  TMR0_0_CTRL_PCS(x)          (((uint16_t)(((uint16_t)(x))<<TMR0_0_CTRL_PCS_SHIFT))&TMR0_0_CTRL_PCS_MASK)
//   Primary Count Source
//     0b0000 ==> Counter 0 input pin
//     0b0001 ==> Counter 1 input pin
//     0b0010 ==> Counter 2 input pin
//     0b0011 ==> Counter 3 input pin
//     0b0100 ==> Counter 0 output
//     0b0101 ==> Counter 1 output
//     0b0110 ==> Counter 2 output
//     0b0111 ==> Counter 3 output
//     0b1000 ==> IP bus clock divide by 1 prescaler
//     0b1001 ==> IP bus clock divide by 2 prescaler
//     0b1010 ==> IP bus clock divide by 4 prescaler
//     0b1011 ==> IP bus clock divide by 8 prescaler
//     0b1100 ==> IP bus clock divide by 16 prescaler
//     0b1101 ==> IP bus clock divide by 32 prescaler
//     0b1110 ==> IP bus clock divide by 64 prescaler
//     0b1111 ==> IP bus clock divide by 128 prescaler

#define  TMR0_0_CTRL_CM_MASK         0x6000u
#define  TMR0_0_CTRL_CM_SHIFT        13
#define  TMR0_0_CTRL_CM(x)           (((uint16_t)(((uint16_t)(x))<<TMR0_0_CTRL_CM_SHIFT))&TMR0_0_CTRL_CM_MASK)
//   Count Mode
//     0b000 ==> No operation
//     0b001 ==> Count rising edges of primary sourceRising edges are counted only when SCTRL[IPS] = 0. Falling edges are counted when SCTRL[IPS] = 1. If the primary count source is IP bus clock divide by 1, only rising edges are counted regardless of the value of SCTRL[IPS].
//     0b010 ==> Count rising and falling edges of primary sourceIP bus clock divide by 1 cannot be used as a primary count source in edge count mode.
//     0b011 ==> Count rising edges of primary source while secondary input high active
//     0b100 ==> Quadrature count mode, uses primary and secondary sources
//     0b101 ==> Count rising edges of primary source; secondary source specifies directionRising edges are counted only when SCTRL[IPS] = 0. Falling edges are counted when SCTRL[IPS] = 1.
//     0b110 ==> Edge of secondary source triggers primary count until compare
//     0b111 ==> Cascaded counter mode (up/down)The primary count source must be set to one of the counter outputs.

#define  TMR0_0_SCTRL_OEN_MASK       0x1u
#define  TMR0_0_SCTRL_OEN_SHIFT      0
//   Output Enable
//     0b0 ==> The external pin is configured as an input.
//     0b1 ==> The OFLAG output signal is driven on the external pin. Other timer groups using this external pin as their input see the driven value. The polarity of the signal is determined by OPS.

