iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  TMR1_0_CSCTRL_TCF1_MASK     0x10u
#define  TMR1_0_CSCTRL_TCF1_SHIFT    4
//   Timer Compare 1 Interrupt Flag

#define  TMR1_0_CSCTRL_TCF2_MASK     0x20u
#define  TMR1_0_CSCTRL_TCF2_SHIFT    5
//   Timer Compare 2 Interrupt Flag

#define  TMR1_0_CSCTRL_TCF1EN_MASK   0x40u
#define  TMR1_0_CSCTRL_TCF1EN_SHIFT  6
//   Timer Compare 1 Interrupt Enable

#define  TMR1_0_CSCTRL_TCF2EN_MASK   0x80u
#define  TMR1_0_CSCTRL_TCF2EN_SHIFT  7
//   Timer Compare 2 Interrupt Enable

#define  TMR1_0_CSCTRL_UP_MASK       0x200u
#define  TMR1_0_CSCTRL_UP_SHIFT      9
//   Counting Direction Indicator
//     0b0 ==> The last count was in the DOWN direction.
//     0b1 ==> The last count was in the UP direction.

#define  TMR1_0_CSCTRL_TCI_MASK      0x400u
#define  TMR1_0_CSCTRL_TCI_SHIFT     10
//   Triggered Count Initialization Control
//     0b0 ==> Stop counter upon receiving a second trigger event while still counting from the first trigger event.
//     0b1 ==> Reload the counter upon receiving a second trigger event while still counting from the first trigger event.

#define  TMR1_0_CSCTRL_ROC_MASK      0x800u
#define  TMR1_0_CSCTRL_ROC_SHIFT     11
//   Reload on Capture
//     0b0 ==> Do not reload the counter on a capture event.
//     0b1 ==> Reload the counter on a capture event.

#define  TMR1_0_CSCTRL_ALT_LOAD_MASK 0x1000u
#define  TMR1_0_CSCTRL_ALT_LOAD_SHIFT 12
//   Alternative Load Enable
//     0b0 ==> Counter can be re-initialized only with the LOAD register.
//     0b1 ==> Counter can be re-initialized with the LOAD or CMPLD2 registers depending on count direction.

#define  TMR1_0_CSCTRL_FAULT_MASK    0x2000u
#define  TMR1_0_CSCTRL_FAULT_SHIFT   13
//   Fault Enable
//     0b0 ==> Fault function disabled.
//     0b1 ==> Fault function enabled.

#define  TMR1_0_CSCTRL_DBG_EN_MASK   0x8000u
#define  TMR1_0_CSCTRL_DBG_EN_SHIFT  14
#define  TMR1_0_CSCTRL_DBG_EN(x)     (((uint16_t)(((uint16_t)(x))<<TMR1_0_CSCTRL_DBG_EN_SHIFT))&TMR1_0_CSCTRL_DBG_EN_MASK)
//   Debug Actions Enable
//     0b00 ==> Continue with normal operation during debug mode. (default)
//     0b01 ==> Halt TMR counter during debug mode.
//     0b10 ==> Force TMR output to logic 0 (prior to consideration of SCTRL[OPS]).
//     0b11 ==> Both halt counter and force output to 0 during debug mode.

#define  TMR1_0_FILT_FILT_PER_MASK   0x8u
#define  TMR1_0_FILT_FILT_PER_SHIFT  0
#define  TMR1_0_FILT_FILT_PER(x)     (((uint16_t)(((uint16_t)(x))<<TMR1_0_FILT_FILT_PER_SHIFT))&TMR1_0_FILT_FILT_PER_MASK)
//   Input Filter Sample Period

#define  TMR1_0_FILT_FILT_CNT_MASK   0x300u
#define  TMR1_0_FILT_FILT_CNT_SHIFT  8
#define  TMR1_0_FILT_FILT_CNT(x)     (((uint16_t)(((uint16_t)(x))<<TMR1_0_FILT_FILT_CNT_SHIFT))&TMR1_0_FILT_FILT_CNT_MASK)
//   Input Filter Sample Count

#define  TMR1_0_DMA_IEFDE_MASK       0x1u
#define  TMR1_0_DMA_IEFDE_SHIFT      0
//   Input Edge Flag DMA Enable

#define  TMR1_0_DMA_CMPLD1DE_MASK    0x2u
#define  TMR1_0_DMA_CMPLD1DE_SHIFT   1
//   Comparator Preload Register 1 DMA Enable

#define  TMR1_0_DMA_CMPLD2DE_MASK    0x4u
#define  TMR1_0_DMA_CMPLD2DE_SHIFT   2
//   Comparator Preload Register 2 DMA Enable

#define  TMR1_0_ENBL_ENBL_MASK       0x4u
#define  TMR1_0_ENBL_ENBL_SHIFT      0
#define  TMR1_0_ENBL_ENBL(x)         (((uint16_t)(((uint16_t)(x))<<TMR1_0_ENBL_ENBL_SHIFT))&TMR1_0_ENBL_ENBL_MASK)
//   Timer Channel Enable
//     0b0 ==> Timer channel is disabled.
//     0b1 ==> Timer channel is enabled. (default)

#define  TMR1_1_COMP1_COMPARISON_1_MASK 0x10u
#define  TMR1_1_COMP1_COMPARISON_1_SHIFT 0
#define  TMR1_1_COMP1_COMPARISON_1(x) (((uint16_t)(((uint16_t)(x))<<TMR1_1_COMP1_COMPARISON_1_SHIFT))&TMR1_1_COMP1_COMPARISON_1_MASK)
//   Comparison Value 1

#define  TMR1_1_COMP2_COMPARISON_2_MASK 0x10u
#define  TMR1_1_COMP2_COMPARISON_2_SHIFT 0
#define  TMR1_1_COMP2_COMPARISON_2(x) (((uint16_t)(((uint16_t)(x))<<TMR1_1_COMP2_COMPARISON_2_SHIFT))&TMR1_1_COMP2_COMPARISON_2_MASK)
//   Comparison Value 2

#define  TMR1_1_CAPT_CAPTURE_MASK    0x10u
#define  TMR1_1_CAPT_CAPTURE_SHIFT   0
#define  TMR1_1_CAPT_CAPTURE(x)      (((uint16_t)(((uint16_t)(x))<<TMR1_1_CAPT_CAPTURE_SHIFT))&TMR1_1_CAPT_CAPTURE_MASK)
//   Capture Value

#define  TMR1_1_LOAD_LOAD_MASK       0x10u
#define  TMR1_1_LOAD_LOAD_SHIFT      0
#define  TMR1_1_LOAD_LOAD(x)         (((uint16_t)(((uint16_t)(x))<<TMR1_1_LOAD_LOAD_SHIFT))&TMR1_1_LOAD_LOAD_MASK)
//   Timer Load Register

#define  TMR1_1_HOLD_HOLD_MASK       0x10u
#define  TMR1_1_HOLD_HOLD_SHIFT      0
#define  TMR1_1_HOLD_HOLD(x)         (((uint16_t)(((uint16_t)(x))<<TMR1_1_HOLD_HOLD_SHIFT))&TMR1_1_HOLD_HOLD_MASK)

#define  TMR1_1_CNTR_COUNTER_MASK    0x10u
#define  TMR1_1_CNTR_COUNTER_SHIFT   0
#define  TMR1_1_CNTR_COUNTER(x)      (((uint16_t)(((uint16_t)(x))<<TMR1_1_CNTR_COUNTER_SHIFT))&TMR1_1_CNTR_COUNTER_MASK)

#define  TMR1_1_CTRL_OUTMODE_MASK    0x3u
#define  TMR1_1_CTRL_OUTMODE_SHIFT   0
#define  TMR1_1_CTRL_OUTMODE(x)      (((uint16_t)(((uint16_t)(x))<<TMR1_1_CTRL_OUTMODE_SHIFT))&TMR1_1_CTRL_OUTMODE_MASK)
//   Output Mode
//     0b000 ==> Asserted while counter is active
//     0b001 ==> Clear OFLAG output on successful compare
//     0b010 ==> Set OFLAG output on successful compare
//     0b011 ==> Toggle OFLAG output on successful compare
//     0b100 ==> Toggle OFLAG output using alternating compare registers
//     0b101 ==> Set on compare, cleared on secondary source input edge
//     0b110 ==> Set on compare, cleared on counter rollover
//     0b111 ==> Enable gated clock output while counter is active

#define  TMR1_1_CTRL_COINIT_MASK     0x8u
#define  TMR1_1_CTRL_COINIT_SHIFT    3
//   Co-Channel Initialization
//     0b0 ==> Co-channel counter/timers cannot force a re-initialization of this counter/timer
//     0b1 ==> Co-channel counter/timers may force a re-initialization of this counter/timer

#define  TMR1_1_CTRL_DIR_MASK        0x10u
#define  TMR1_1_CTRL_DIR_SHIFT       4
//   Count Direction
//     0b0 ==> Count up.
//     0b1 ==> Count down.

#define  TMR1_1_CTRL_LENGTH_MASK     0x20u
#define  TMR1_1_CTRL_LENGTH_SHIFT    5
//   Count Length
//     0b0 ==> Roll over.
//     0b1 ==> Count until compare, then re-initialize. If counting up, a successful compare occurs when the counter reaches a COMP1 value. If counting down, a successful compare occurs when the counter reaches a COMP2 value. When output mode $4 is used, alternating values of COMP1 and COMP2 are used to generate successful comparisons. For example, the counter counts until a COMP1 value is reached, re-initializes, counts until COMP2 value is reached, re-initializes, counts until COMP1 value
//             is reached, and so on.

#define  TMR1_1_CTRL_ONCE_MASK       0x40u
#define  TMR1_1_CTRL_ONCE_SHIFT      6
//   Count Once
//     0b0 ==> Count repeatedly.
//     0b1 ==> Count until compare and then stop. If counting up, a successful compare occurs when the counter reaches a COMP1 value. If counting down, a successful compare occurs when the counter reaches a COMP2 value. When output mode $4 is used, the counter re-initializes after reaching the COMP1 value, continues to count to the COMP2 value, and then stops.

