iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  TMR1_2_CSCTRL_ROC_MASK      0x800u
#define  TMR1_2_CSCTRL_ROC_SHIFT     11
//   Reload on Capture
//     0b0 ==> Do not reload the counter on a capture event.
//     0b1 ==> Reload the counter on a capture event.

#define  TMR1_2_CSCTRL_ALT_LOAD_MASK 0x1000u
#define  TMR1_2_CSCTRL_ALT_LOAD_SHIFT 12
//   Alternative Load Enable
//     0b0 ==> Counter can be re-initialized only with the LOAD register.
//     0b1 ==> Counter can be re-initialized with the LOAD or CMPLD2 registers depending on count direction.

#define  TMR1_2_CSCTRL_FAULT_MASK    0x2000u
#define  TMR1_2_CSCTRL_FAULT_SHIFT   13
//   Fault Enable
//     0b0 ==> Fault function disabled.
//     0b1 ==> Fault function enabled.

#define  TMR1_2_CSCTRL_DBG_EN_MASK   0x8000u
#define  TMR1_2_CSCTRL_DBG_EN_SHIFT  14
#define  TMR1_2_CSCTRL_DBG_EN(x)     (((uint16_t)(((uint16_t)(x))<<TMR1_2_CSCTRL_DBG_EN_SHIFT))&TMR1_2_CSCTRL_DBG_EN_MASK)
//   Debug Actions Enable
//     0b00 ==> Continue with normal operation during debug mode. (default)
//     0b01 ==> Halt TMR counter during debug mode.
//     0b10 ==> Force TMR output to logic 0 (prior to consideration of SCTRL[OPS]).
//     0b11 ==> Both halt counter and force output to 0 during debug mode.

#define  TMR1_2_FILT_FILT_PER_MASK   0x8u
#define  TMR1_2_FILT_FILT_PER_SHIFT  0
#define  TMR1_2_FILT_FILT_PER(x)     (((uint16_t)(((uint16_t)(x))<<TMR1_2_FILT_FILT_PER_SHIFT))&TMR1_2_FILT_FILT_PER_MASK)
//   Input Filter Sample Period

#define  TMR1_2_FILT_FILT_CNT_MASK   0x300u
#define  TMR1_2_FILT_FILT_CNT_SHIFT  8
#define  TMR1_2_FILT_FILT_CNT(x)     (((uint16_t)(((uint16_t)(x))<<TMR1_2_FILT_FILT_CNT_SHIFT))&TMR1_2_FILT_FILT_CNT_MASK)
//   Input Filter Sample Count

#define  TMR1_2_DMA_IEFDE_MASK       0x1u
#define  TMR1_2_DMA_IEFDE_SHIFT      0
//   Input Edge Flag DMA Enable

#define  TMR1_2_DMA_CMPLD1DE_MASK    0x2u
#define  TMR1_2_DMA_CMPLD1DE_SHIFT   1
//   Comparator Preload Register 1 DMA Enable

#define  TMR1_2_DMA_CMPLD2DE_MASK    0x4u
#define  TMR1_2_DMA_CMPLD2DE_SHIFT   2
//   Comparator Preload Register 2 DMA Enable

#define  TMR1_3_COMP1_COMPARISON_1_MASK 0x10u
#define  TMR1_3_COMP1_COMPARISON_1_SHIFT 0
#define  TMR1_3_COMP1_COMPARISON_1(x) (((uint16_t)(((uint16_t)(x))<<TMR1_3_COMP1_COMPARISON_1_SHIFT))&TMR1_3_COMP1_COMPARISON_1_MASK)
//   Comparison Value 1

#define  TMR1_3_COMP2_COMPARISON_2_MASK 0x10u
#define  TMR1_3_COMP2_COMPARISON_2_SHIFT 0
#define  TMR1_3_COMP2_COMPARISON_2(x) (((uint16_t)(((uint16_t)(x))<<TMR1_3_COMP2_COMPARISON_2_SHIFT))&TMR1_3_COMP2_COMPARISON_2_MASK)
//   Comparison Value 2

#define  TMR1_3_CAPT_CAPTURE_MASK    0x10u
#define  TMR1_3_CAPT_CAPTURE_SHIFT   0
#define  TMR1_3_CAPT_CAPTURE(x)      (((uint16_t)(((uint16_t)(x))<<TMR1_3_CAPT_CAPTURE_SHIFT))&TMR1_3_CAPT_CAPTURE_MASK)
//   Capture Value

#define  TMR1_3_LOAD_LOAD_MASK       0x10u
#define  TMR1_3_LOAD_LOAD_SHIFT      0
#define  TMR1_3_LOAD_LOAD(x)         (((uint16_t)(((uint16_t)(x))<<TMR1_3_LOAD_LOAD_SHIFT))&TMR1_3_LOAD_LOAD_MASK)
//   Timer Load Register

#define  TMR1_3_HOLD_HOLD_MASK       0x10u
#define  TMR1_3_HOLD_HOLD_SHIFT      0
#define  TMR1_3_HOLD_HOLD(x)         (((uint16_t)(((uint16_t)(x))<<TMR1_3_HOLD_HOLD_SHIFT))&TMR1_3_HOLD_HOLD_MASK)

#define  TMR1_3_CNTR_COUNTER_MASK    0x10u
#define  TMR1_3_CNTR_COUNTER_SHIFT   0
#define  TMR1_3_CNTR_COUNTER(x)      (((uint16_t)(((uint16_t)(x))<<TMR1_3_CNTR_COUNTER_SHIFT))&TMR1_3_CNTR_COUNTER_MASK)

#define  TMR1_3_CTRL_OUTMODE_MASK    0x3u
#define  TMR1_3_CTRL_OUTMODE_SHIFT   0
#define  TMR1_3_CTRL_OUTMODE(x)      (((uint16_t)(((uint16_t)(x))<<TMR1_3_CTRL_OUTMODE_SHIFT))&TMR1_3_CTRL_OUTMODE_MASK)
//   Output Mode
//     0b000 ==> Asserted while counter is active
//     0b001 ==> Clear OFLAG output on successful compare
//     0b010 ==> Set OFLAG output on successful compare
//     0b011 ==> Toggle OFLAG output on successful compare
//     0b100 ==> Toggle OFLAG output using alternating compare registers
//     0b101 ==> Set on compare, cleared on secondary source input edge
//     0b110 ==> Set on compare, cleared on counter rollover
//     0b111 ==> Enable gated clock output while counter is active

#define  TMR1_3_CTRL_COINIT_MASK     0x8u
#define  TMR1_3_CTRL_COINIT_SHIFT    3
//   Co-Channel Initialization
//     0b0 ==> Co-channel counter/timers cannot force a re-initialization of this counter/timer
//     0b1 ==> Co-channel counter/timers may force a re-initialization of this counter/timer

#define  TMR1_3_CTRL_DIR_MASK        0x10u
#define  TMR1_3_CTRL_DIR_SHIFT       4
//   Count Direction
//     0b0 ==> Count up.
//     0b1 ==> Count down.

#define  TMR1_3_CTRL_LENGTH_MASK     0x20u
#define  TMR1_3_CTRL_LENGTH_SHIFT    5
//   Count Length
//     0b0 ==> Roll over.
//     0b1 ==> Count until compare, then re-initialize. If counting up, a successful compare occurs when the counter reaches a COMP1 value. If counting down, a successful compare occurs when the counter reaches a COMP2 value. When output mode $4 is used, alternating values of COMP1 and COMP2 are used to generate successful comparisons. For example, the counter counts until a COMP1 value is reached, re-initializes, counts until COMP2 value is reached, re-initializes, counts until COMP1 value
//             is reached, and so on.

#define  TMR1_3_CTRL_ONCE_MASK       0x40u
#define  TMR1_3_CTRL_ONCE_SHIFT      6
//   Count Once
//     0b0 ==> Count repeatedly.
//     0b1 ==> Count until compare and then stop. If counting up, a successful compare occurs when the counter reaches a COMP1 value. If counting down, a successful compare occurs when the counter reaches a COMP2 value. When output mode $4 is used, the counter re-initializes after reaching the COMP1 value, continues to count to the COMP2 value, and then stops.

#define  TMR1_3_CTRL_SCS_MASK        0x100u
#define  TMR1_3_CTRL_SCS_SHIFT       7
#define  TMR1_3_CTRL_SCS(x)          (((uint16_t)(((uint16_t)(x))<<TMR1_3_CTRL_SCS_SHIFT))&TMR1_3_CTRL_SCS_MASK)
//   Secondary Count Source
//     0b00 ==> Counter 0 input pin
//     0b01 ==> Counter 1 input pin
//     0b10 ==> Counter 2 input pin
//     0b11 ==> Counter 3 input pin

#define  TMR1_3_CTRL_PCS_MASK        0x800u
#define  TMR1_3_CTRL_PCS_SHIFT       9
#define  TMR1_3_CTRL_PCS(x)          (((uint16_t)(((uint16_t)(x))<<TMR1_3_CTRL_PCS_SHIFT))&TMR1_3_CTRL_PCS_MASK)
//   Primary Count Source
//     0b0000 ==> Counter 0 input pin
//     0b0001 ==> Counter 1 input pin
//     0b0010 ==> Counter 2 input pin
//     0b0011 ==> Counter 3 input pin
//     0b0100 ==> Counter 0 output
//     0b0101 ==> Counter 1 output
//     0b0110 ==> Counter 2 output
//     0b0111 ==> Counter 3 output
//     0b1000 ==> IP bus clock divide by 1 prescaler
//     0b1001 ==> IP bus clock divide by 2 prescaler
//     0b1010 ==> IP bus clock divide by 4 prescaler
//     0b1011 ==> IP bus clock divide by 8 prescaler
//     0b1100 ==> IP bus clock divide by 16 prescaler
//     0b1101 ==> IP bus clock divide by 32 prescaler
//     0b1110 ==> IP bus clock divide by 64 prescaler
//     0b1111 ==> IP bus clock divide by 128 prescaler

#define  TMR1_3_CTRL_CM_MASK         0x6000u
#define  TMR1_3_CTRL_CM_SHIFT        13
#define  TMR1_3_CTRL_CM(x)           (((uint16_t)(((uint16_t)(x))<<TMR1_3_CTRL_CM_SHIFT))&TMR1_3_CTRL_CM_MASK)
//   Count Mode
//     0b000 ==> No operation
//     0b001 ==> Count rising edges of primary sourceRising edges are counted only when SCTRL[IPS] = 0. Falling edges are counted when SCTRL[IPS] = 1. If the primary count source is IP bus clock divide by 1, only rising edges are counted regardless of the value of SCTRL[IPS].
//     0b010 ==> Count rising and falling edges of primary sourceIP bus clock divide by 1 cannot be used as a primary count source in edge count mode.
//     0b011 ==> Count rising edges of primary source while secondary input high active
//     0b100 ==> Quadrature count mode, uses primary and secondary sources
//     0b101 ==> Count rising edges of primary source; secondary source specifies directionRising edges are counted only when SCTRL[IPS] = 0. Falling edges are counted when SCTRL[IPS] = 1.
//     0b110 ==> Edge of secondary source triggers primary count until compare
//     0b111 ==> Cascaded counter mode (up/down)The primary count source must be set to one of the counter outputs.

