iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  TMR2_0_SCTRL_OPS_MASK       0x2u
#define  TMR2_0_SCTRL_OPS_SHIFT      1
//   Output Polarity Select
//     0b0 ==> True polarity.
//     0b1 ==> Inverted polarity.

#define  TMR2_0_SCTRL_FORCE_MASK     0x4u
#define  TMR2_0_SCTRL_FORCE_SHIFT    2
//   Force OFLAG Output

#define  TMR2_0_SCTRL_VAL_MASK       0x8u
#define  TMR2_0_SCTRL_VAL_SHIFT      3
//   Forced OFLAG Value

#define  TMR2_0_SCTRL_EEOF_MASK      0x10u
#define  TMR2_0_SCTRL_EEOF_SHIFT     4
//   Enable External OFLAG Force

#define  TMR2_0_SCTRL_MSTR_MASK      0x20u
#define  TMR2_0_SCTRL_MSTR_SHIFT     5
//   Master Mode

#define  TMR2_0_SCTRL_CAPTURE_MODE_MASK 0x80u
#define  TMR2_0_SCTRL_CAPTURE_MODE_SHIFT 6
#define  TMR2_0_SCTRL_CAPTURE_MODE(x) (((uint16_t)(((uint16_t)(x))<<TMR2_0_SCTRL_CAPTURE_MODE_SHIFT))&TMR2_0_SCTRL_CAPTURE_MODE_MASK)
//   Input Capture Mode
//     0b00 ==> Capture function is disabled
//     0b01 ==> Load capture register on rising edge (when IPS=0) or falling edge (when IPS=1) of input
//     0b10 ==> Load capture register on falling edge (when IPS=0) or rising edge (when IPS=1) of input
//     0b11 ==> Load capture register on both edges of input

#define  TMR2_0_SCTRL_INPUT_MASK     0x100u
#define  TMR2_0_SCTRL_INPUT_SHIFT    8
//   External Input Signal

#define  TMR2_0_SCTRL_IPS_MASK       0x200u
#define  TMR2_0_SCTRL_IPS_SHIFT      9
//   Input Polarity Select

#define  TMR2_0_SCTRL_IEFIE_MASK     0x400u
#define  TMR2_0_SCTRL_IEFIE_SHIFT    10
//   Input Edge Flag Interrupt Enable

#define  TMR2_0_SCTRL_IEF_MASK       0x800u
#define  TMR2_0_SCTRL_IEF_SHIFT      11
//   Input Edge Flag

#define  TMR2_0_SCTRL_TOFIE_MASK     0x1000u
#define  TMR2_0_SCTRL_TOFIE_SHIFT    12
//   Timer Overflow Flag Interrupt Enable

#define  TMR2_0_SCTRL_TOF_MASK       0x2000u
#define  TMR2_0_SCTRL_TOF_SHIFT      13
//   Timer Overflow Flag

#define  TMR2_0_SCTRL_TCFIE_MASK     0x4000u
#define  TMR2_0_SCTRL_TCFIE_SHIFT    14
//   Timer Compare Flag Interrupt Enable

#define  TMR2_0_SCTRL_TCF_MASK       0x8000u
#define  TMR2_0_SCTRL_TCF_SHIFT      15
//   Timer Compare Flag

#define  TMR2_0_CMPLD1_COMPARATOR_LOAD_1_MASK 0x10u
#define  TMR2_0_CMPLD1_COMPARATOR_LOAD_1_SHIFT 0
#define  TMR2_0_CMPLD1_COMPARATOR_LOAD_1(x) (((uint16_t)(((uint16_t)(x))<<TMR2_0_CMPLD1_COMPARATOR_LOAD_1_SHIFT))&TMR2_0_CMPLD1_COMPARATOR_LOAD_1_MASK)

#define  TMR2_0_CMPLD2_COMPARATOR_LOAD_2_MASK 0x10u
#define  TMR2_0_CMPLD2_COMPARATOR_LOAD_2_SHIFT 0
#define  TMR2_0_CMPLD2_COMPARATOR_LOAD_2(x) (((uint16_t)(((uint16_t)(x))<<TMR2_0_CMPLD2_COMPARATOR_LOAD_2_SHIFT))&TMR2_0_CMPLD2_COMPARATOR_LOAD_2_MASK)

#define  TMR2_0_CSCTRL_CL1_MASK      0x2u
#define  TMR2_0_CSCTRL_CL1_SHIFT     0
#define  TMR2_0_CSCTRL_CL1(x)        (((uint16_t)(((uint16_t)(x))<<TMR2_0_CSCTRL_CL1_SHIFT))&TMR2_0_CSCTRL_CL1_MASK)
//   Compare Load Control 1
//     0b00 ==> Never preload
//     0b01 ==> Load upon successful compare with the value in COMP1
//     0b10 ==> Load upon successful compare with the value in COMP2
//     0b11 ==> Reserved

#define  TMR2_0_CSCTRL_CL2_MASK      0x8u
#define  TMR2_0_CSCTRL_CL2_SHIFT     2
#define  TMR2_0_CSCTRL_CL2(x)        (((uint16_t)(((uint16_t)(x))<<TMR2_0_CSCTRL_CL2_SHIFT))&TMR2_0_CSCTRL_CL2_MASK)
//   Compare Load Control 2
//     0b00 ==> Never preload
//     0b01 ==> Load upon successful compare with the value in COMP1
//     0b10 ==> Load upon successful compare with the value in COMP2
//     0b11 ==> Reserved

#define  TMR2_0_CSCTRL_TCF1_MASK     0x10u
#define  TMR2_0_CSCTRL_TCF1_SHIFT    4
//   Timer Compare 1 Interrupt Flag

#define  TMR2_0_CSCTRL_TCF2_MASK     0x20u
#define  TMR2_0_CSCTRL_TCF2_SHIFT    5
//   Timer Compare 2 Interrupt Flag

#define  TMR2_0_CSCTRL_TCF1EN_MASK   0x40u
#define  TMR2_0_CSCTRL_TCF1EN_SHIFT  6
//   Timer Compare 1 Interrupt Enable

#define  TMR2_0_CSCTRL_TCF2EN_MASK   0x80u
#define  TMR2_0_CSCTRL_TCF2EN_SHIFT  7
//   Timer Compare 2 Interrupt Enable

#define  TMR2_0_CSCTRL_UP_MASK       0x200u
#define  TMR2_0_CSCTRL_UP_SHIFT      9
//   Counting Direction Indicator
//     0b0 ==> The last count was in the DOWN direction.
//     0b1 ==> The last count was in the UP direction.

#define  TMR2_0_CSCTRL_TCI_MASK      0x400u
#define  TMR2_0_CSCTRL_TCI_SHIFT     10
//   Triggered Count Initialization Control
//     0b0 ==> Stop counter upon receiving a second trigger event while still counting from the first trigger event.
//     0b1 ==> Reload the counter upon receiving a second trigger event while still counting from the first trigger event.

#define  TMR2_0_CSCTRL_ROC_MASK      0x800u
#define  TMR2_0_CSCTRL_ROC_SHIFT     11
//   Reload on Capture
//     0b0 ==> Do not reload the counter on a capture event.
//     0b1 ==> Reload the counter on a capture event.

#define  TMR2_0_CSCTRL_ALT_LOAD_MASK 0x1000u
#define  TMR2_0_CSCTRL_ALT_LOAD_SHIFT 12
//   Alternative Load Enable
//     0b0 ==> Counter can be re-initialized only with the LOAD register.
//     0b1 ==> Counter can be re-initialized with the LOAD or CMPLD2 registers depending on count direction.

#define  TMR2_0_CSCTRL_FAULT_MASK    0x2000u
#define  TMR2_0_CSCTRL_FAULT_SHIFT   13
//   Fault Enable
//     0b0 ==> Fault function disabled.
//     0b1 ==> Fault function enabled.

#define  TMR2_0_CSCTRL_DBG_EN_MASK   0x8000u
#define  TMR2_0_CSCTRL_DBG_EN_SHIFT  14
#define  TMR2_0_CSCTRL_DBG_EN(x)     (((uint16_t)(((uint16_t)(x))<<TMR2_0_CSCTRL_DBG_EN_SHIFT))&TMR2_0_CSCTRL_DBG_EN_MASK)
//   Debug Actions Enable
//     0b00 ==> Continue with normal operation during debug mode. (default)
//     0b01 ==> Halt TMR counter during debug mode.
//     0b10 ==> Force TMR output to logic 0 (prior to consideration of SCTRL[OPS]).
//     0b11 ==> Both halt counter and force output to 0 during debug mode.

#define  TMR2_0_FILT_FILT_PER_MASK   0x8u
#define  TMR2_0_FILT_FILT_PER_SHIFT  0
#define  TMR2_0_FILT_FILT_PER(x)     (((uint16_t)(((uint16_t)(x))<<TMR2_0_FILT_FILT_PER_SHIFT))&TMR2_0_FILT_FILT_PER_MASK)
//   Input Filter Sample Period

#define  TMR2_0_FILT_FILT_CNT_MASK   0x300u
#define  TMR2_0_FILT_FILT_CNT_SHIFT  8
#define  TMR2_0_FILT_FILT_CNT(x)     (((uint16_t)(((uint16_t)(x))<<TMR2_0_FILT_FILT_CNT_SHIFT))&TMR2_0_FILT_FILT_CNT_MASK)
//   Input Filter Sample Count

