iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  TMR2_3_CTRL_LENGTH_MASK     0x20u
#define  TMR2_3_CTRL_LENGTH_SHIFT    5
//   Count Length
//     0b0 ==> Roll over.
//     0b1 ==> Count until compare, then re-initialize. If counting up, a successful compare occurs when the counter reaches a COMP1 value. If counting down, a successful compare occurs when the counter reaches a COMP2 value. When output mode $4 is used, alternating values of COMP1 and COMP2 are used to generate successful comparisons. For example, the counter counts until a COMP1 value is reached, re-initializes, counts until COMP2 value is reached, re-initializes, counts until COMP1 value
//             is reached, and so on.

#define  TMR2_3_CTRL_ONCE_MASK       0x40u
#define  TMR2_3_CTRL_ONCE_SHIFT      6
//   Count Once
//     0b0 ==> Count repeatedly.
//     0b1 ==> Count until compare and then stop. If counting up, a successful compare occurs when the counter reaches a COMP1 value. If counting down, a successful compare occurs when the counter reaches a COMP2 value. When output mode $4 is used, the counter re-initializes after reaching the COMP1 value, continues to count to the COMP2 value, and then stops.

#define  TMR2_3_CTRL_SCS_MASK        0x100u
#define  TMR2_3_CTRL_SCS_SHIFT       7
#define  TMR2_3_CTRL_SCS(x)          (((uint16_t)(((uint16_t)(x))<<TMR2_3_CTRL_SCS_SHIFT))&TMR2_3_CTRL_SCS_MASK)
//   Secondary Count Source
//     0b00 ==> Counter 0 input pin
//     0b01 ==> Counter 1 input pin
//     0b10 ==> Counter 2 input pin
//     0b11 ==> Counter 3 input pin

#define  TMR2_3_CTRL_PCS_MASK        0x800u
#define  TMR2_3_CTRL_PCS_SHIFT       9
#define  TMR2_3_CTRL_PCS(x)          (((uint16_t)(((uint16_t)(x))<<TMR2_3_CTRL_PCS_SHIFT))&TMR2_3_CTRL_PCS_MASK)
//   Primary Count Source
//     0b0000 ==> Counter 0 input pin
//     0b0001 ==> Counter 1 input pin
//     0b0010 ==> Counter 2 input pin
//     0b0011 ==> Counter 3 input pin
//     0b0100 ==> Counter 0 output
//     0b0101 ==> Counter 1 output
//     0b0110 ==> Counter 2 output
//     0b0111 ==> Counter 3 output
//     0b1000 ==> IP bus clock divide by 1 prescaler
//     0b1001 ==> IP bus clock divide by 2 prescaler
//     0b1010 ==> IP bus clock divide by 4 prescaler
//     0b1011 ==> IP bus clock divide by 8 prescaler
//     0b1100 ==> IP bus clock divide by 16 prescaler
//     0b1101 ==> IP bus clock divide by 32 prescaler
//     0b1110 ==> IP bus clock divide by 64 prescaler
//     0b1111 ==> IP bus clock divide by 128 prescaler

#define  TMR2_3_CTRL_CM_MASK         0x6000u
#define  TMR2_3_CTRL_CM_SHIFT        13
#define  TMR2_3_CTRL_CM(x)           (((uint16_t)(((uint16_t)(x))<<TMR2_3_CTRL_CM_SHIFT))&TMR2_3_CTRL_CM_MASK)
//   Count Mode
//     0b000 ==> No operation
//     0b001 ==> Count rising edges of primary sourceRising edges are counted only when SCTRL[IPS] = 0. Falling edges are counted when SCTRL[IPS] = 1. If the primary count source is IP bus clock divide by 1, only rising edges are counted regardless of the value of SCTRL[IPS].
//     0b010 ==> Count rising and falling edges of primary sourceIP bus clock divide by 1 cannot be used as a primary count source in edge count mode.
//     0b011 ==> Count rising edges of primary source while secondary input high active
//     0b100 ==> Quadrature count mode, uses primary and secondary sources
//     0b101 ==> Count rising edges of primary source; secondary source specifies directionRising edges are counted only when SCTRL[IPS] = 0. Falling edges are counted when SCTRL[IPS] = 1.
//     0b110 ==> Edge of secondary source triggers primary count until compare
//     0b111 ==> Cascaded counter mode (up/down)The primary count source must be set to one of the counter outputs.

#define  TMR2_3_SCTRL_OEN_MASK       0x1u
#define  TMR2_3_SCTRL_OEN_SHIFT      0
//   Output Enable
//     0b0 ==> The external pin is configured as an input.
//     0b1 ==> The OFLAG output signal is driven on the external pin. Other timer groups using this external pin as their input see the driven value. The polarity of the signal is determined by OPS.

#define  TMR2_3_SCTRL_OPS_MASK       0x2u
#define  TMR2_3_SCTRL_OPS_SHIFT      1
//   Output Polarity Select
//     0b0 ==> True polarity.
//     0b1 ==> Inverted polarity.

#define  TMR2_3_SCTRL_FORCE_MASK     0x4u
#define  TMR2_3_SCTRL_FORCE_SHIFT    2
//   Force OFLAG Output

#define  TMR2_3_SCTRL_VAL_MASK       0x8u
#define  TMR2_3_SCTRL_VAL_SHIFT      3
//   Forced OFLAG Value

#define  TMR2_3_SCTRL_EEOF_MASK      0x10u
#define  TMR2_3_SCTRL_EEOF_SHIFT     4
//   Enable External OFLAG Force

#define  TMR2_3_SCTRL_MSTR_MASK      0x20u
#define  TMR2_3_SCTRL_MSTR_SHIFT     5
//   Master Mode

#define  TMR2_3_SCTRL_CAPTURE_MODE_MASK 0x80u
#define  TMR2_3_SCTRL_CAPTURE_MODE_SHIFT 6
#define  TMR2_3_SCTRL_CAPTURE_MODE(x) (((uint16_t)(((uint16_t)(x))<<TMR2_3_SCTRL_CAPTURE_MODE_SHIFT))&TMR2_3_SCTRL_CAPTURE_MODE_MASK)
//   Input Capture Mode
//     0b00 ==> Capture function is disabled
//     0b01 ==> Load capture register on rising edge (when IPS=0) or falling edge (when IPS=1) of input
//     0b10 ==> Load capture register on falling edge (when IPS=0) or rising edge (when IPS=1) of input
//     0b11 ==> Load capture register on both edges of input

#define  TMR2_3_SCTRL_INPUT_MASK     0x100u
#define  TMR2_3_SCTRL_INPUT_SHIFT    8
//   External Input Signal

#define  TMR2_3_SCTRL_IPS_MASK       0x200u
#define  TMR2_3_SCTRL_IPS_SHIFT      9
//   Input Polarity Select

#define  TMR2_3_SCTRL_IEFIE_MASK     0x400u
#define  TMR2_3_SCTRL_IEFIE_SHIFT    10
//   Input Edge Flag Interrupt Enable

#define  TMR2_3_SCTRL_IEF_MASK       0x800u
#define  TMR2_3_SCTRL_IEF_SHIFT      11
//   Input Edge Flag

#define  TMR2_3_SCTRL_TOFIE_MASK     0x1000u
#define  TMR2_3_SCTRL_TOFIE_SHIFT    12
//   Timer Overflow Flag Interrupt Enable

#define  TMR2_3_SCTRL_TOF_MASK       0x2000u
#define  TMR2_3_SCTRL_TOF_SHIFT      13
//   Timer Overflow Flag

#define  TMR2_3_SCTRL_TCFIE_MASK     0x4000u
#define  TMR2_3_SCTRL_TCFIE_SHIFT    14
//   Timer Compare Flag Interrupt Enable

