iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  TMR3_3_CSCTRL_TCF2_MASK     0x20u
#define  TMR3_3_CSCTRL_TCF2_SHIFT    5
//   Timer Compare 2 Interrupt Flag

#define  TMR3_3_CSCTRL_TCF1EN_MASK   0x40u
#define  TMR3_3_CSCTRL_TCF1EN_SHIFT  6
//   Timer Compare 1 Interrupt Enable

#define  TMR3_3_CSCTRL_TCF2EN_MASK   0x80u
#define  TMR3_3_CSCTRL_TCF2EN_SHIFT  7
//   Timer Compare 2 Interrupt Enable

#define  TMR3_3_CSCTRL_UP_MASK       0x200u
#define  TMR3_3_CSCTRL_UP_SHIFT      9
//   Counting Direction Indicator
//     0b0 ==> The last count was in the DOWN direction.
//     0b1 ==> The last count was in the UP direction.

#define  TMR3_3_CSCTRL_TCI_MASK      0x400u
#define  TMR3_3_CSCTRL_TCI_SHIFT     10
//   Triggered Count Initialization Control
//     0b0 ==> Stop counter upon receiving a second trigger event while still counting from the first trigger event.
//     0b1 ==> Reload the counter upon receiving a second trigger event while still counting from the first trigger event.

#define  TMR3_3_CSCTRL_ROC_MASK      0x800u
#define  TMR3_3_CSCTRL_ROC_SHIFT     11
//   Reload on Capture
//     0b0 ==> Do not reload the counter on a capture event.
//     0b1 ==> Reload the counter on a capture event.

#define  TMR3_3_CSCTRL_ALT_LOAD_MASK 0x1000u
#define  TMR3_3_CSCTRL_ALT_LOAD_SHIFT 12
//   Alternative Load Enable
//     0b0 ==> Counter can be re-initialized only with the LOAD register.
//     0b1 ==> Counter can be re-initialized with the LOAD or CMPLD2 registers depending on count direction.

#define  TMR3_3_CSCTRL_FAULT_MASK    0x2000u
#define  TMR3_3_CSCTRL_FAULT_SHIFT   13
//   Fault Enable
//     0b0 ==> Fault function disabled.
//     0b1 ==> Fault function enabled.

#define  TMR3_3_CSCTRL_DBG_EN_MASK   0x8000u
#define  TMR3_3_CSCTRL_DBG_EN_SHIFT  14
#define  TMR3_3_CSCTRL_DBG_EN(x)     (((uint16_t)(((uint16_t)(x))<<TMR3_3_CSCTRL_DBG_EN_SHIFT))&TMR3_3_CSCTRL_DBG_EN_MASK)
//   Debug Actions Enable
//     0b00 ==> Continue with normal operation during debug mode. (default)
//     0b01 ==> Halt TMR counter during debug mode.
//     0b10 ==> Force TMR output to logic 0 (prior to consideration of SCTRL[OPS]).
//     0b11 ==> Both halt counter and force output to 0 during debug mode.

#define  TMR3_3_FILT_FILT_PER_MASK   0x8u
#define  TMR3_3_FILT_FILT_PER_SHIFT  0
#define  TMR3_3_FILT_FILT_PER(x)     (((uint16_t)(((uint16_t)(x))<<TMR3_3_FILT_FILT_PER_SHIFT))&TMR3_3_FILT_FILT_PER_MASK)
//   Input Filter Sample Period

#define  TMR3_3_FILT_FILT_CNT_MASK   0x300u
#define  TMR3_3_FILT_FILT_CNT_SHIFT  8
#define  TMR3_3_FILT_FILT_CNT(x)     (((uint16_t)(((uint16_t)(x))<<TMR3_3_FILT_FILT_CNT_SHIFT))&TMR3_3_FILT_FILT_CNT_MASK)
//   Input Filter Sample Count

#define  TMR3_3_DMA_IEFDE_MASK       0x1u
#define  TMR3_3_DMA_IEFDE_SHIFT      0
//   Input Edge Flag DMA Enable

#define  TMR3_3_DMA_CMPLD1DE_MASK    0x2u
#define  TMR3_3_DMA_CMPLD1DE_SHIFT   1
//   Comparator Preload Register 1 DMA Enable

#define  TMR3_3_DMA_CMPLD2DE_MASK    0x4u
#define  TMR3_3_DMA_CMPLD2DE_SHIFT   2
//   Comparator Preload Register 2 DMA Enable

#define  UART0_BDH_SBR_MASK          0x5u
#define  UART0_BDH_SBR_SHIFT         0
#define  UART0_BDH_SBR(x)            (((uint8_t)(((uint8_t)(x))<<UART0_BDH_SBR_SHIFT))&UART0_BDH_SBR_MASK)
//   UART Baud Rate Bits

#define  UART0_BDH_RXEDGIE_MASK      0x40u
#define  UART0_BDH_RXEDGIE_SHIFT     6
//   RxD Input Active Edge Interrupt Enable
//     0b0 ==> Hardware interrupts from RXEDGIF disabled using polling.
//     0b1 ==> RXEDGIF interrupt request enabled.

#define  UART0_BDH_LBKDIE_MASK       0x80u
#define  UART0_BDH_LBKDIE_SHIFT      7
//   LIN Break Detect Interrupt Enable
//     0b0 ==> LBKDIF interrupt requests disabled.
//     0b1 ==> LBKDIF interrupt requests enabled.

#define  UART0_BDL_SBR_MASK          0x8u
#define  UART0_BDL_SBR_SHIFT         0
#define  UART0_BDL_SBR(x)            (((uint8_t)(((uint8_t)(x))<<UART0_BDL_SBR_SHIFT))&UART0_BDL_SBR_MASK)
//   UART Baud Rate Bits

#define  UART0_C1_PT_MASK            0x1u
#define  UART0_C1_PT_SHIFT           0
//   Parity Type
//     0b0 ==> Even parity.
//     0b1 ==> Odd parity.

#define  UART0_C1_PE_MASK            0x2u
#define  UART0_C1_PE_SHIFT           1
//   Parity Enable
//     0b0 ==> Parity function disabled.
//     0b1 ==> Parity function enabled.

#define  UART0_C1_ILT_MASK           0x4u
#define  UART0_C1_ILT_SHIFT          2
//   Idle Line Type Select
//     0b0 ==> Idle character bit count starts after start bit.
//     0b1 ==> Idle character bit count starts after stop bit.

#define  UART0_C1_WAKE_MASK          0x8u
#define  UART0_C1_WAKE_SHIFT         3
//   Receiver Wakeup Method Select
//     0b0 ==> Idle line wakeup.
//     0b1 ==> Address mark wakeup.

#define  UART0_C1_M_MASK             0x10u
#define  UART0_C1_M_SHIFT            4
//   9-bit or 8-bit Mode Select
//     0b0 ==> Normal-start + 8 data bits (MSB/LSB first as determined by MSBF) + stop.
//     0b1 ==> Use-start + 9 data bits (MSB/LSB first as determined by MSBF) + stop.

#define  UART0_C1_RSRC_MASK          0x20u
#define  UART0_C1_RSRC_SHIFT         5
//   Receiver Source Select
//     0b0 ==> Selects internal loop back mode. The receiver input is internally connected to transmitter output.
//     0b1 ==> Single wire UART mode where the receiver input is connected to the transmit pin input signal.

#define  UART0_C1_LOOPS_MASK         0x80u
#define  UART0_C1_LOOPS_SHIFT        7
//   Loop Mode Select
//     0b0 ==> Normal operation.
//     0b1 ==> Loop mode where transmitter output is internally connected to receiver input. The receiver input is determined by RSRC.

#define  UART0_C2_SBK_MASK           0x1u
#define  UART0_C2_SBK_SHIFT          0
//   Send Break
//     0b0 ==> Normal transmitter operation.
//     0b1 ==> Queue break characters to be sent.

#define  UART0_C2_RWU_MASK           0x2u
#define  UART0_C2_RWU_SHIFT          1
//   Receiver Wakeup Control
//     0b0 ==> Normal operation.
//     0b1 ==> RWU enables the wakeup function and inhibits further receiver interrupt requests. Normally, hardware wakes the receiver by automatically clearing RWU.

#define  UART0_C2_RE_MASK            0x4u
#define  UART0_C2_RE_SHIFT           2
//   Receiver Enable
//     0b0 ==> Receiver off.
//     0b1 ==> Receiver on.

#define  UART0_C2_TE_MASK            0x8u
#define  UART0_C2_TE_SHIFT           3
//   Transmitter Enable
//     0b0 ==> Transmitter off.
//     0b1 ==> Transmitter on.

#define  UART0_C2_ILIE_MASK          0x10u
#define  UART0_C2_ILIE_SHIFT         4
//   Idle Line Interrupt Enable
//     0b0 ==> IDLE interrupt requests disabled.
//     0b1 ==> IDLE interrupt requests enabled.

#define  UART0_C2_RIE_MASK           0x20u
#define  UART0_C2_RIE_SHIFT          5
//   Receiver Full Interrupt or DMA Transfer Enable
//     0b0 ==> RDRF interrupt and DMA transfer requests disabled.
//     0b1 ==> RDRF interrupt or DMA transfer requests enabled.

#define  UART0_C2_TCIE_MASK          0x40u
#define  UART0_C2_TCIE_SHIFT         6
//   Transmission Complete Interrupt Enable
//     0b0 ==> TC interrupt requests disabled.
//     0b1 ==> TC interrupt requests enabled.

#define  UART0_C2_TIE_MASK           0x80u
#define  UART0_C2_TIE_SHIFT          7
//   Transmitter Interrupt or DMA Transfer Enable.
//     0b0 ==> TDRE interrupt and DMA transfer requests disabled.
//     0b1 ==> TDRE interrupt or DMA transfer requests enabled.

#define  UART0_S1_PF_MASK            0x1u
#define  UART0_S1_PF_SHIFT           0
//   Parity Error Flag
//     0b0 ==> No parity error detected since the last time this flag was cleared. If the receive buffer has a depth greater than 1, then there may be data in the receive buffer what was received with a parity error.
//     0b1 ==> At least one dataword was received with a parity error since the last time this flag was cleared.

#define  UART0_S1_FE_MASK            0x2u
#define  UART0_S1_FE_SHIFT           1
//   Framing Error Flag
//     0b0 ==> No framing error detected.
//     0b1 ==> Framing error.

#define  UART0_S1_NF_MASK            0x4u
#define  UART0_S1_NF_SHIFT           2
//   Noise Flag
//     0b0 ==> No noise detected since the last time this flag was cleared. If the receive buffer has a depth greater than 1 then there may be data in the receiver buffer that was received with noise.
//     0b1 ==> At least one dataword was received with noise detected since the last time the flag was cleared.

#define  UART0_S1_OR_MASK            0x8u
#define  UART0_S1_OR_SHIFT           3
//   Receiver Overrun Flag
//     0b0 ==> No overrun has occurred since the last time the flag was cleared.
//     0b1 ==> Overrun has occurred or the overrun flag has not been cleared since the last overrun occured.

#define  UART0_S1_IDLE_MASK          0x10u
#define  UART0_S1_IDLE_SHIFT         4
//   Idle Line Flag
//     0b0 ==> Receiver input is either active now or has never become active since the IDLE flag was last cleared.
//     0b1 ==> Receiver input has become idle or the flag has not been cleared since it last asserted.

#define  UART0_S1_RDRF_MASK          0x20u
#define  UART0_S1_RDRF_SHIFT         5
//   Receive Data Register Full Flag
//     0b0 ==> The number of datawords in the receive buffer is less than the number indicated by RXWATER.
//     0b1 ==> The number of datawords in the receive buffer is equal to or greater than the number indicated by RXWATER at some point in time since this flag was last cleared.

#define  UART0_S1_TC_MASK            0x40u
#define  UART0_S1_TC_SHIFT           6
//   Transmit Complete Flag
//     0b0 ==> Transmitter active (sending data, a preamble, or a break).
//     0b1 ==> Transmitter idle (transmission activity complete).

#define  UART0_S1_TDRE_MASK          0x80u
#define  UART0_S1_TDRE_SHIFT         7
//   Transmit Data Register Empty Flag
//     0b0 ==> The amount of data in the transmit buffer is greater than the value indicated by TWFIFO[TXWATER].
//     0b1 ==> The amount of data in the transmit buffer is less than or equal to the value indicated by TWFIFO[TXWATER] at some point in time since the flag has been cleared.

