iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  UART0_S2_RAF_MASK           0x1u
#define  UART0_S2_RAF_SHIFT          0
//   Receiver Active Flag
//     0b0 ==> UART receiver idle/inactive waiting for a start bit.
//     0b1 ==> UART receiver active, RxD input not idle.

#define  UART0_S2_LBKDE_MASK         0x2u
#define  UART0_S2_LBKDE_SHIFT        1
//   LIN Break Detection Enable
//     0b0 ==> Break character is detected at one of the following lengths: 10 bit times if C1[M] = 0 11 bit times if C1[M] = 1 and C4[M10] = 0 12 bit times if C1[M] = 1, C4[M10] = 1, and S1[PE] = 1
//     0b1 ==> Break character is detected at length of 11 bit times if C1[M] = 0 or 12 bits time if C1[M] = 1.

#define  UART0_S2_BRK13_MASK         0x4u
#define  UART0_S2_BRK13_SHIFT        2
//   Break Transmit Character Length
//     0b0 ==> Break character is 10, 11, or 12 bits long.
//     0b1 ==> Break character is 13 or 14 bits long.

#define  UART0_S2_RWUID_MASK         0x8u
#define  UART0_S2_RWUID_SHIFT        3
//   Receive Wakeup Idle Detect
//     0b0 ==> S1[IDLE] is not set upon detection of an idle character.
//     0b1 ==> S1[IDLE] is set upon detection of an idle character.

#define  UART0_S2_RXINV_MASK         0x10u
#define  UART0_S2_RXINV_SHIFT        4
//   Receive Data Inversion
//     0b0 ==> Receive data is not inverted.
//     0b1 ==> Receive data is inverted.

#define  UART0_S2_MSBF_MASK          0x20u
#define  UART0_S2_MSBF_SHIFT         5
//   Most Significant Bit First
//     0b0 ==> LSB (bit0) is the first bit that is transmitted following the start bit. Further, the first bit received after the start bit is identified as bit0.
//     0b1 ==> MSB (bit8, bit7 or bit6) is the first bit that is transmitted following the start bit, depending on the setting of C1[M] and C1[PE]. Further, the first bit received after the start bit is identified as bit8, bit7, or bit6, depending on the setting of C1[M] and C1[PE].

#define  UART0_S2_RXEDGIF_MASK       0x40u
#define  UART0_S2_RXEDGIF_SHIFT      6
//   RxD Pin Active Edge Interrupt Flag
//     0b0 ==> No active edge on the receive pin has occurred.
//     0b1 ==> An active edge on the receive pin has occurred.

#define  UART0_S2_LBKDIF_MASK        0x80u
#define  UART0_S2_LBKDIF_SHIFT       7
//   LIN Break Detect Interrupt Flag
//     0b0 ==> No LIN break character detected.
//     0b1 ==> LIN break character detected.

#define  UART0_C3_PEIE_MASK          0x1u
#define  UART0_C3_PEIE_SHIFT         0
//   Parity Error Interrupt Enable
//     0b0 ==> PF interrupt requests are disabled.
//     0b1 ==> PF interrupt requests are enabled.

#define  UART0_C3_FEIE_MASK          0x2u
#define  UART0_C3_FEIE_SHIFT         1
//   Framing Error Interrupt Enable
//     0b0 ==> FE interrupt requests are disabled.
//     0b1 ==> FE interrupt requests are enabled.

#define  UART0_C3_NEIE_MASK          0x4u
#define  UART0_C3_NEIE_SHIFT         2
//   Noise Error Interrupt Enable
//     0b0 ==> NF interrupt requests are disabled.
//     0b1 ==> NF interrupt requests are enabled.

#define  UART0_C3_ORIE_MASK          0x8u
#define  UART0_C3_ORIE_SHIFT         3
//   Overrun Error Interrupt Enable
//     0b0 ==> OR interrupts are disabled.
//     0b1 ==> OR interrupt requests are enabled.

#define  UART0_C3_TXINV_MASK         0x10u
#define  UART0_C3_TXINV_SHIFT        4
//   Transmit Data Inversion.
//     0b0 ==> Transmit data is not inverted.
//     0b1 ==> Transmit data is inverted.

#define  UART0_C3_TXDIR_MASK         0x20u
#define  UART0_C3_TXDIR_SHIFT        5
//   Transmitter Pin Data Direction in Single-Wire mode
//     0b0 ==> TXD pin is an input in single wire mode.
//     0b1 ==> TXD pin is an output in single wire mode.

#define  UART0_C3_T8_MASK            0x40u
#define  UART0_C3_T8_SHIFT           6
//   Transmit Bit 8

#define  UART0_C3_R8_MASK            0x80u
#define  UART0_C3_R8_SHIFT           7
//   Received Bit 8

#define  UART0_D_RT_MASK             0x8u
#define  UART0_D_RT_SHIFT            0
#define  UART0_D_RT(x)               (((uint8_t)(((uint8_t)(x))<<UART0_D_RT_SHIFT))&UART0_D_RT_MASK)

#define  UART0_MA1_MA_MASK           0x8u
#define  UART0_MA1_MA_SHIFT          0
#define  UART0_MA1_MA(x)             (((uint8_t)(((uint8_t)(x))<<UART0_MA1_MA_SHIFT))&UART0_MA1_MA_MASK)
//   Match Address

#define  UART0_MA2_MA_MASK           0x8u
#define  UART0_MA2_MA_SHIFT          0
#define  UART0_MA2_MA(x)             (((uint8_t)(((uint8_t)(x))<<UART0_MA2_MA_SHIFT))&UART0_MA2_MA_MASK)
//   Match Address

#define  UART0_C4_BRFA_MASK          0x5u
#define  UART0_C4_BRFA_SHIFT         0
#define  UART0_C4_BRFA(x)            (((uint8_t)(((uint8_t)(x))<<UART0_C4_BRFA_SHIFT))&UART0_C4_BRFA_MASK)
//   Baud Rate Fine Adjust

#define  UART0_C4_M10_MASK           0x20u
#define  UART0_C4_M10_SHIFT          5
//   10-bit Mode select
//     0b0 ==> The parity bit is the ninth bit in the serial transmission.
//     0b1 ==> The parity bit is the tenth bit in the serial transmission.

#define  UART0_C4_MAEN2_MASK         0x40u
#define  UART0_C4_MAEN2_SHIFT        6
//   Match Address Mode Enable 2
//     0b0 ==> All data received is transferred to the data buffer if MAEN1 is cleared.
//     0b1 ==> All data received with the most significant bit cleared, is discarded. All data received with the most significant bit set, is compared with contents of MA2 register. If no match occurs, the data is discarded. If a match occurs, data is transferred to the data buffer. This field must be cleared when C7816[ISO7816E] is set/enabled.

#define  UART0_C4_MAEN1_MASK         0x80u
#define  UART0_C4_MAEN1_SHIFT        7
//   Match Address Mode Enable 1
//     0b0 ==> All data received is transferred to the data buffer if MAEN2 is cleared.
//     0b1 ==> All data received with the most significant bit cleared, is discarded. All data received with the most significant bit set, is compared with contents of MA1 register. If no match occurs, the data is discarded. If match occurs, data is transferred to the data buffer. This field must be cleared when C7816[ISO7816E] is set/enabled.

