iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  UART0_C5_RDMAS_MASK         0x20u
#define  UART0_C5_RDMAS_SHIFT        5
//   Receiver Full DMA Select
//     0b0 ==> If C2[RIE] and S1[RDRF] are set, the RDFR interrupt request signal is asserted to request an interrupt service.
//     0b1 ==> If C2[RIE] and S1[RDRF] are set, the RDRF DMA request signal is asserted to request a DMA transfer.

#define  UART0_C5_TDMAS_MASK         0x80u
#define  UART0_C5_TDMAS_SHIFT        7
//   Transmitter DMA Select
//     0b0 ==> If C2[TIE] is set and the S1[TDRE] flag is set, the TDRE interrupt request signal is asserted to request interrupt service.
//     0b1 ==> If C2[TIE] is set and the S1[TDRE] flag is set, the TDRE DMA request signal is asserted to request a DMA transfer.

#define  UART0_IR_TNP_MASK           0x2u
#define  UART0_IR_TNP_SHIFT          0
#define  UART0_IR_TNP(x)             (((uint8_t)(((uint8_t)(x))<<UART0_IR_TNP_SHIFT))&UART0_IR_TNP_MASK)
//   Transmitter narrow pulse
//     0b00 ==> 3/16.
//     0b01 ==> 1/16.
//     0b10 ==> 1/32.
//     0b11 ==> 1/4.

#define  UART0_IR_IREN_MASK          0x4u
#define  UART0_IR_IREN_SHIFT         2
//   Infrared enable
//     0b0 ==> IR disabled.
//     0b1 ==> IR enabled.

#define  UART0_C7816_ISO_7816E_MASK  0x1u
#define  UART0_C7816_ISO_7816E_SHIFT 0
//   ISO-7816 Functionality Enabled
//     0b0 ==> ISO-7816 functionality is turned off/not enabled.
//     0b1 ==> ISO-7816 functionality is turned on/enabled.

#define  UART0_C7816_TTYPE_MASK      0x2u
#define  UART0_C7816_TTYPE_SHIFT     1
//   Transfer Type
//     0b0 ==> T = 0 per the ISO-7816 specification.
//     0b1 ==> T = 1 per the ISO-7816 specification.

#define  UART0_C7816_INIT_MASK       0x4u
#define  UART0_C7816_INIT_SHIFT      2
//   Detect Initial Character
//     0b0 ==> Normal operating mode. Receiver does not seek to identify initial character.
//     0b1 ==> Receiver searches for initial character.

#define  UART0_C7816_ANACK_MASK      0x8u
#define  UART0_C7816_ANACK_SHIFT     3
//   Generate NACK on Error
//     0b0 ==> No NACK is automatically generated.
//     0b1 ==> A NACK is automatically generated if a parity error is detected or if an invalid initial character is detected.

#define  UART0_C7816_ONACK_MASK      0x10u
#define  UART0_C7816_ONACK_SHIFT     4
//   Generate NACK on Overflow
//     0b0 ==> The received data does not generate a NACK when the receipt of the data results in an overflow event.
//     0b1 ==> If the receiver buffer overflows, a NACK is automatically sent on a received character.

#define  UART0_IE7816_RXTE_MASK      0x1u
#define  UART0_IE7816_RXTE_SHIFT     0
//   Receive Threshold Exceeded Interrupt Enable
//     0b0 ==> The assertion of IS7816[RXT] does not result in the generation of an interrupt.
//     0b1 ==> The assertion of IS7816[RXT] results in the generation of an interrupt.

#define  UART0_IE7816_TXTE_MASK      0x2u
#define  UART0_IE7816_TXTE_SHIFT     1
//   Transmit Threshold Exceeded Interrupt Enable
//     0b0 ==> The assertion of IS7816[TXT] does not result in the generation of an interrupt.
//     0b1 ==> The assertion of IS7816[TXT] results in the generation of an interrupt.

#define  UART0_IE7816_GTVE_MASK      0x4u
#define  UART0_IE7816_GTVE_SHIFT     2
//   Guard Timer Violated Interrupt Enable
//     0b0 ==> The assertion of IS7816[GTV] does not result in the generation of an interrupt.
//     0b1 ==> The assertion of IS7816[GTV] results in the generation of an interrupt.

#define  UART0_IE7816_INITDE_MASK    0x10u
#define  UART0_IE7816_INITDE_SHIFT   4
//   Initial Character Detected Interrupt Enable
//     0b0 ==> The assertion of IS7816[INITD] does not result in the generation of an interrupt.
//     0b1 ==> The assertion of IS7816[INITD] results in the generation of an interrupt.

#define  UART0_IE7816_BWTE_MASK      0x20u
#define  UART0_IE7816_BWTE_SHIFT     5
//   Block Wait Timer Interrupt Enable
//     0b0 ==> The assertion of IS7816[BWT] does not result in the generation of an interrupt.
//     0b1 ==> The assertion of IS7816[BWT] results in the generation of an interrupt.

#define  UART0_IE7816_CWTE_MASK      0x40u
#define  UART0_IE7816_CWTE_SHIFT     6
//   Character Wait Timer Interrupt Enable
//     0b0 ==> The assertion of IS7816[CWT] does not result in the generation of an interrupt.
//     0b1 ==> The assertion of IS7816[CWT] results in the generation of an interrupt.

#define  UART0_IE7816_WTE_MASK       0x80u
#define  UART0_IE7816_WTE_SHIFT      7
//   Wait Timer Interrupt Enable
//     0b0 ==> The assertion of IS7816[WT] does not result in the generation of an interrupt.
//     0b1 ==> The assertion of IS7816[WT] results in the generation of an interrupt.

#define  UART0_IS7816_RXT_MASK       0x1u
#define  UART0_IS7816_RXT_SHIFT      0
//   Receive Threshold Exceeded Interrupt
//     0b0 ==> The number of consecutive NACKS generated as a result of parity errors and buffer overruns is less than or equal to the value in ET7816[RXTHRESHOLD].
//     0b1 ==> The number of consecutive NACKS generated as a result of parity errors and buffer overruns is greater than the value in ET7816[RXTHRESHOLD].

#define  UART0_IS7816_TXT_MASK       0x2u
#define  UART0_IS7816_TXT_SHIFT      1
//   Transmit Threshold Exceeded Interrupt
//     0b0 ==> The number of retries and corresponding NACKS does not exceed the value in ET7816[TXTHRESHOLD].
//     0b1 ==> The number of retries and corresponding NACKS exceeds the value in ET7816[TXTHRESHOLD].

#define  UART0_IS7816_GTV_MASK       0x4u
#define  UART0_IS7816_GTV_SHIFT      2
//   Guard Timer Violated Interrupt
//     0b0 ==> A guard time (GT, CGT, or BGT) has not been violated.
//     0b1 ==> A guard time (GT, CGT, or BGT) has been violated.

#define  UART0_IS7816_INITD_MASK     0x10u
#define  UART0_IS7816_INITD_SHIFT    4
//   Initial Character Detected Interrupt
//     0b0 ==> A valid initial character has not been received.
//     0b1 ==> A valid initial character has been received.

#define  UART0_IS7816_BWT_MASK       0x20u
#define  UART0_IS7816_BWT_SHIFT      5
//   Block Wait Timer Interrupt
//     0b0 ==> Block wait time (BWT) has not been violated.
//     0b1 ==> Block wait time (BWT) has been violated.

#define  UART0_IS7816_CWT_MASK       0x40u
#define  UART0_IS7816_CWT_SHIFT      6
//   Character Wait Timer Interrupt
//     0b0 ==> Character wait time (CWT) has not been violated.
//     0b1 ==> Character wait time (CWT) has been violated.

#define  UART0_IS7816_WT_MASK        0x80u
#define  UART0_IS7816_WT_SHIFT       7
//   Wait Timer Interrupt
//     0b0 ==> Wait time (WT) has not been violated.
//     0b1 ==> Wait time (WT) has been violated.

#define  UART0_WP7816T0_WI_MASK      0x8u
#define  UART0_WP7816T0_WI_SHIFT     0
#define  UART0_WP7816T0_WI(x)        (((uint8_t)(((uint8_t)(x))<<UART0_WP7816T0_WI_SHIFT))&UART0_WP7816T0_WI_MASK)
//   Wait Timer Interrupt (C7816[TTYPE] = 0)

