iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  UART0_WP7816T1_BWI_MASK     0x4u
#define  UART0_WP7816T1_BWI_SHIFT    0
#define  UART0_WP7816T1_BWI(x)       (((uint8_t)(((uint8_t)(x))<<UART0_WP7816T1_BWI_SHIFT))&UART0_WP7816T1_BWI_MASK)
//   Block Wait Time Integer(C7816[TTYPE] = 1)

#define  UART0_WP7816T1_CWI_MASK     0x40u
#define  UART0_WP7816T1_CWI_SHIFT    4
#define  UART0_WP7816T1_CWI(x)       (((uint8_t)(((uint8_t)(x))<<UART0_WP7816T1_CWI_SHIFT))&UART0_WP7816T1_CWI_MASK)
//   Character Wait Time Integer (C7816[TTYPE] = 1)

#define  UART0_WN7816_GTN_MASK       0x8u
#define  UART0_WN7816_GTN_SHIFT      0
#define  UART0_WN7816_GTN(x)         (((uint8_t)(((uint8_t)(x))<<UART0_WN7816_GTN_SHIFT))&UART0_WN7816_GTN_MASK)
//   Guard Band N

#define  UART0_WF7816_GTFD_MASK      0x8u
#define  UART0_WF7816_GTFD_SHIFT     0
#define  UART0_WF7816_GTFD(x)        (((uint8_t)(((uint8_t)(x))<<UART0_WF7816_GTFD_SHIFT))&UART0_WF7816_GTFD_MASK)
//   FD Multiplier

#define  UART0_ET7816_RXTHRESHOLD_MASK 0x4u
#define  UART0_ET7816_RXTHRESHOLD_SHIFT 0
#define  UART0_ET7816_RXTHRESHOLD(x) (((uint8_t)(((uint8_t)(x))<<UART0_ET7816_RXTHRESHOLD_SHIFT))&UART0_ET7816_RXTHRESHOLD_MASK)
//   Receive NACK Threshold

#define  UART0_ET7816_TXTHRESHOLD_MASK 0x40u
#define  UART0_ET7816_TXTHRESHOLD_SHIFT 4
#define  UART0_ET7816_TXTHRESHOLD(x) (((uint8_t)(((uint8_t)(x))<<UART0_ET7816_TXTHRESHOLD_SHIFT))&UART0_ET7816_TXTHRESHOLD_MASK)
//   Transmit NACK Threshold
//     0b0 ==> TXT asserts on the first NACK that is received.
//     0b1 ==> TXT asserts on the second NACK that is received.

#define  UART0_TL7816_TLEN_MASK      0x8u
#define  UART0_TL7816_TLEN_SHIFT     0
#define  UART0_TL7816_TLEN(x)        (((uint8_t)(((uint8_t)(x))<<UART0_TL7816_TLEN_SHIFT))&UART0_TL7816_TLEN_MASK)
//   Transmit Length

#define  UART0_WB_WBASE_MASK         0x8u
#define  UART0_WB_WBASE_SHIFT        0
#define  UART0_WB_WBASE(x)           (((uint8_t)(((uint8_t)(x))<<UART0_WB_WBASE_SHIFT))&UART0_WB_WBASE_MASK)
//   CEA709.1-B WBASE register

#define  UART1_BDH_SBR_MASK          0x5u
#define  UART1_BDH_SBR_SHIFT         0
#define  UART1_BDH_SBR(x)            (((uint8_t)(((uint8_t)(x))<<UART1_BDH_SBR_SHIFT))&UART1_BDH_SBR_MASK)
//   UART Baud Rate Bits

#define  UART1_BDH_RXEDGIE_MASK      0x40u
#define  UART1_BDH_RXEDGIE_SHIFT     6
//   RxD Input Active Edge Interrupt Enable
//     0b0 ==> Hardware interrupts from RXEDGIF disabled using polling.
//     0b1 ==> RXEDGIF interrupt request enabled.

#define  UART1_BDH_LBKDIE_MASK       0x80u
#define  UART1_BDH_LBKDIE_SHIFT      7
//   LIN Break Detect Interrupt Enable
//     0b0 ==> LBKDIF interrupt requests disabled.
//     0b1 ==> LBKDIF interrupt requests enabled.

#define  UART1_BDL_SBR_MASK          0x8u
#define  UART1_BDL_SBR_SHIFT         0
#define  UART1_BDL_SBR(x)            (((uint8_t)(((uint8_t)(x))<<UART1_BDL_SBR_SHIFT))&UART1_BDL_SBR_MASK)
//   UART Baud Rate Bits

#define  UART1_C1_PT_MASK            0x1u
#define  UART1_C1_PT_SHIFT           0
//   Parity Type
//     0b0 ==> Even parity.
//     0b1 ==> Odd parity.

#define  UART1_C1_PE_MASK            0x2u
#define  UART1_C1_PE_SHIFT           1
//   Parity Enable
//     0b0 ==> Parity function disabled.
//     0b1 ==> Parity function enabled.

#define  UART1_C1_ILT_MASK           0x4u
#define  UART1_C1_ILT_SHIFT          2
//   Idle Line Type Select
//     0b0 ==> Idle character bit count starts after start bit.
//     0b1 ==> Idle character bit count starts after stop bit.

#define  UART1_C1_WAKE_MASK          0x8u
#define  UART1_C1_WAKE_SHIFT         3
//   Receiver Wakeup Method Select
//     0b0 ==> Idle line wakeup.
//     0b1 ==> Address mark wakeup.

#define  UART1_C1_M_MASK             0x10u
#define  UART1_C1_M_SHIFT            4
//   9-bit or 8-bit Mode Select
//     0b0 ==> Normal-start + 8 data bits (MSB/LSB first as determined by MSBF) + stop.
//     0b1 ==> Use-start + 9 data bits (MSB/LSB first as determined by MSBF) + stop.

#define  UART1_C1_RSRC_MASK          0x20u
#define  UART1_C1_RSRC_SHIFT         5
//   Receiver Source Select
//     0b0 ==> Selects internal loop back mode. The receiver input is internally connected to transmitter output.
//     0b1 ==> Single wire UART mode where the receiver input is connected to the transmit pin input signal.

#define  UART1_C1_LOOPS_MASK         0x80u
#define  UART1_C1_LOOPS_SHIFT        7
//   Loop Mode Select
//     0b0 ==> Normal operation.
//     0b1 ==> Loop mode where transmitter output is internally connected to receiver input. The receiver input is determined by RSRC.

#define  UART1_C2_SBK_MASK           0x1u
#define  UART1_C2_SBK_SHIFT          0
//   Send Break
//     0b0 ==> Normal transmitter operation.
//     0b1 ==> Queue break characters to be sent.

#define  UART1_C2_RWU_MASK           0x2u
#define  UART1_C2_RWU_SHIFT          1
//   Receiver Wakeup Control
//     0b0 ==> Normal operation.
//     0b1 ==> RWU enables the wakeup function and inhibits further receiver interrupt requests. Normally, hardware wakes the receiver by automatically clearing RWU.

#define  UART1_C2_RE_MASK            0x4u
#define  UART1_C2_RE_SHIFT           2
//   Receiver Enable
//     0b0 ==> Receiver off.
//     0b1 ==> Receiver on.

#define  UART1_C2_TE_MASK            0x8u
#define  UART1_C2_TE_SHIFT           3
//   Transmitter Enable
//     0b0 ==> Transmitter off.
//     0b1 ==> Transmitter on.

#define  UART1_C2_ILIE_MASK          0x10u
#define  UART1_C2_ILIE_SHIFT         4
//   Idle Line Interrupt Enable
//     0b0 ==> IDLE interrupt requests disabled.
//     0b1 ==> IDLE interrupt requests enabled.

#define  UART1_C2_RIE_MASK           0x20u
#define  UART1_C2_RIE_SHIFT          5
//   Receiver Full Interrupt or DMA Transfer Enable
//     0b0 ==> RDRF interrupt and DMA transfer requests disabled.
//     0b1 ==> RDRF interrupt or DMA transfer requests enabled.

#define  UART1_C2_TCIE_MASK          0x40u
#define  UART1_C2_TCIE_SHIFT         6
//   Transmission Complete Interrupt Enable
//     0b0 ==> TC interrupt requests disabled.
//     0b1 ==> TC interrupt requests enabled.

#define  UART1_C2_TIE_MASK           0x80u
#define  UART1_C2_TIE_SHIFT          7
//   Transmitter Interrupt or DMA Transfer Enable.
//     0b0 ==> TDRE interrupt and DMA transfer requests disabled.
//     0b1 ==> TDRE interrupt or DMA transfer requests enabled.

#define  UART1_S1_PF_MASK            0x1u
#define  UART1_S1_PF_SHIFT           0
//   Parity Error Flag
//     0b0 ==> No parity error detected since the last time this flag was cleared. If the receive buffer has a depth greater than 1, then there may be data in the receive buffer what was received with a parity error.
//     0b1 ==> At least one dataword was received with a parity error since the last time this flag was cleared.

#define  UART1_S1_FE_MASK            0x2u
#define  UART1_S1_FE_SHIFT           1
//   Framing Error Flag
//     0b0 ==> No framing error detected.
//     0b1 ==> Framing error.

#define  UART1_S1_NF_MASK            0x4u
#define  UART1_S1_NF_SHIFT           2
//   Noise Flag
//     0b0 ==> No noise detected since the last time this flag was cleared. If the receive buffer has a depth greater than 1 then there may be data in the receiver buffer that was received with noise.
//     0b1 ==> At least one dataword was received with noise detected since the last time the flag was cleared.

#define  UART1_S1_OR_MASK            0x8u
#define  UART1_S1_OR_SHIFT           3
//   Receiver Overrun Flag
//     0b0 ==> No overrun has occurred since the last time the flag was cleared.
//     0b1 ==> Overrun has occurred or the overrun flag has not been cleared since the last overrun occured.

#define  UART1_S1_IDLE_MASK          0x10u
#define  UART1_S1_IDLE_SHIFT         4
//   Idle Line Flag
//     0b0 ==> Receiver input is either active now or has never become active since the IDLE flag was last cleared.
//     0b1 ==> Receiver input has become idle or the flag has not been cleared since it last asserted.

#define  UART1_S1_RDRF_MASK          0x20u
#define  UART1_S1_RDRF_SHIFT         5
//   Receive Data Register Full Flag
//     0b0 ==> The number of datawords in the receive buffer is less than the number indicated by RXWATER.
//     0b1 ==> The number of datawords in the receive buffer is equal to or greater than the number indicated by RXWATER at some point in time since this flag was last cleared.

#define  UART1_S1_TC_MASK            0x40u
#define  UART1_S1_TC_SHIFT           6
//   Transmit Complete Flag
//     0b0 ==> Transmitter active (sending data, a preamble, or a break).
//     0b1 ==> Transmitter idle (transmission activity complete).

#define  UART1_S1_TDRE_MASK          0x80u
#define  UART1_S1_TDRE_SHIFT         7
//   Transmit Data Register Empty Flag
//     0b0 ==> The amount of data in the transmit buffer is greater than the value indicated by TWFIFO[TXWATER].
//     0b1 ==> The amount of data in the transmit buffer is less than or equal to the value indicated by TWFIFO[TXWATER] at some point in time since the flag has been cleared.

#define  UART1_S2_RAF_MASK           0x1u
#define  UART1_S2_RAF_SHIFT          0
//   Receiver Active Flag
//     0b0 ==> UART receiver idle/inactive waiting for a start bit.
//     0b1 ==> UART receiver active, RxD input not idle.

#define  UART1_S2_LBKDE_MASK         0x2u
#define  UART1_S2_LBKDE_SHIFT        1
//   LIN Break Detection Enable
//     0b0 ==> Break character is detected at one of the following lengths: 10 bit times if C1[M] = 0 11 bit times if C1[M] = 1 and C4[M10] = 0 12 bit times if C1[M] = 1, C4[M10] = 1, and S1[PE] = 1
//     0b1 ==> Break character is detected at length of 11 bit times if C1[M] = 0 or 12 bits time if C1[M] = 1.

#define  UART1_S2_BRK13_MASK         0x4u
#define  UART1_S2_BRK13_SHIFT        2
//   Break Transmit Character Length
//     0b0 ==> Break character is 10, 11, or 12 bits long.
//     0b1 ==> Break character is 13 or 14 bits long.

