iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  UART1_S2_RWUID_MASK         0x8u
#define  UART1_S2_RWUID_SHIFT        3
//   Receive Wakeup Idle Detect
//     0b0 ==> S1[IDLE] is not set upon detection of an idle character.
//     0b1 ==> S1[IDLE] is set upon detection of an idle character.

#define  UART1_S2_RXINV_MASK         0x10u
#define  UART1_S2_RXINV_SHIFT        4
//   Receive Data Inversion
//     0b0 ==> Receive data is not inverted.
//     0b1 ==> Receive data is inverted.

#define  UART1_S2_MSBF_MASK          0x20u
#define  UART1_S2_MSBF_SHIFT         5
//   Most Significant Bit First
//     0b0 ==> LSB (bit0) is the first bit that is transmitted following the start bit. Further, the first bit received after the start bit is identified as bit0.
//     0b1 ==> MSB (bit8, bit7 or bit6) is the first bit that is transmitted following the start bit, depending on the setting of C1[M] and C1[PE]. Further, the first bit received after the start bit is identified as bit8, bit7, or bit6, depending on the setting of C1[M] and C1[PE].

#define  UART1_S2_RXEDGIF_MASK       0x40u
#define  UART1_S2_RXEDGIF_SHIFT      6
//   RxD Pin Active Edge Interrupt Flag
//     0b0 ==> No active edge on the receive pin has occurred.
//     0b1 ==> An active edge on the receive pin has occurred.

#define  UART1_S2_LBKDIF_MASK        0x80u
#define  UART1_S2_LBKDIF_SHIFT       7
//   LIN Break Detect Interrupt Flag
//     0b0 ==> No LIN break character detected.
//     0b1 ==> LIN break character detected.

#define  UART1_C3_PEIE_MASK          0x1u
#define  UART1_C3_PEIE_SHIFT         0
//   Parity Error Interrupt Enable
//     0b0 ==> PF interrupt requests are disabled.
//     0b1 ==> PF interrupt requests are enabled.

#define  UART1_C3_FEIE_MASK          0x2u
#define  UART1_C3_FEIE_SHIFT         1
//   Framing Error Interrupt Enable
//     0b0 ==> FE interrupt requests are disabled.
//     0b1 ==> FE interrupt requests are enabled.

#define  UART1_C3_NEIE_MASK          0x4u
#define  UART1_C3_NEIE_SHIFT         2
//   Noise Error Interrupt Enable
//     0b0 ==> NF interrupt requests are disabled.
//     0b1 ==> NF interrupt requests are enabled.

#define  UART1_C3_ORIE_MASK          0x8u
#define  UART1_C3_ORIE_SHIFT         3
//   Overrun Error Interrupt Enable
//     0b0 ==> OR interrupts are disabled.
//     0b1 ==> OR interrupt requests are enabled.

#define  UART1_C3_TXINV_MASK         0x10u
#define  UART1_C3_TXINV_SHIFT        4
//   Transmit Data Inversion.
//     0b0 ==> Transmit data is not inverted.
//     0b1 ==> Transmit data is inverted.

#define  UART1_C3_TXDIR_MASK         0x20u
#define  UART1_C3_TXDIR_SHIFT        5
//   Transmitter Pin Data Direction in Single-Wire mode
//     0b0 ==> TXD pin is an input in single wire mode.
//     0b1 ==> TXD pin is an output in single wire mode.

#define  UART1_C3_T8_MASK            0x40u
#define  UART1_C3_T8_SHIFT           6
//   Transmit Bit 8

#define  UART1_C3_R8_MASK            0x80u
#define  UART1_C3_R8_SHIFT           7
//   Received Bit 8

#define  UART1_D_RT_MASK             0x8u
#define  UART1_D_RT_SHIFT            0
#define  UART1_D_RT(x)               (((uint8_t)(((uint8_t)(x))<<UART1_D_RT_SHIFT))&UART1_D_RT_MASK)

#define  UART1_MA1_MA_MASK           0x8u
#define  UART1_MA1_MA_SHIFT          0
#define  UART1_MA1_MA(x)             (((uint8_t)(((uint8_t)(x))<<UART1_MA1_MA_SHIFT))&UART1_MA1_MA_MASK)
//   Match Address

#define  UART1_MA2_MA_MASK           0x8u
#define  UART1_MA2_MA_SHIFT          0
#define  UART1_MA2_MA(x)             (((uint8_t)(((uint8_t)(x))<<UART1_MA2_MA_SHIFT))&UART1_MA2_MA_MASK)
//   Match Address

#define  UART1_C4_BRFA_MASK          0x5u
#define  UART1_C4_BRFA_SHIFT         0
#define  UART1_C4_BRFA(x)            (((uint8_t)(((uint8_t)(x))<<UART1_C4_BRFA_SHIFT))&UART1_C4_BRFA_MASK)
//   Baud Rate Fine Adjust

#define  UART1_C4_M10_MASK           0x20u
#define  UART1_C4_M10_SHIFT          5
//   10-bit Mode select
//     0b0 ==> The parity bit is the ninth bit in the serial transmission.
//     0b1 ==> The parity bit is the tenth bit in the serial transmission.

#define  UART1_C4_MAEN2_MASK         0x40u
#define  UART1_C4_MAEN2_SHIFT        6
//   Match Address Mode Enable 2
//     0b0 ==> All data received is transferred to the data buffer if MAEN1 is cleared.
//     0b1 ==> All data received with the most significant bit cleared, is discarded. All data received with the most significant bit set, is compared with contents of MA2 register. If no match occurs, the data is discarded. If a match occurs, data is transferred to the data buffer. This field must be cleared when C7816[ISO7816E] is set/enabled.

#define  UART1_C4_MAEN1_MASK         0x80u
#define  UART1_C4_MAEN1_SHIFT        7
//   Match Address Mode Enable 1
//     0b0 ==> All data received is transferred to the data buffer if MAEN2 is cleared.
//     0b1 ==> All data received with the most significant bit cleared, is discarded. All data received with the most significant bit set, is compared with contents of MA1 register. If no match occurs, the data is discarded. If match occurs, data is transferred to the data buffer. This field must be cleared when C7816[ISO7816E] is set/enabled.

#define  UART1_C5_RDMAS_MASK         0x20u
#define  UART1_C5_RDMAS_SHIFT        5
//   Receiver Full DMA Select
//     0b0 ==> If C2[RIE] and S1[RDRF] are set, the RDFR interrupt request signal is asserted to request an interrupt service.
//     0b1 ==> If C2[RIE] and S1[RDRF] are set, the RDRF DMA request signal is asserted to request a DMA transfer.

#define  UART1_C5_TDMAS_MASK         0x80u
#define  UART1_C5_TDMAS_SHIFT        7
//   Transmitter DMA Select
//     0b0 ==> If C2[TIE] is set and the S1[TDRE] flag is set, the TDRE interrupt request signal is asserted to request interrupt service.
//     0b1 ==> If C2[TIE] is set and the S1[TDRE] flag is set, the TDRE DMA request signal is asserted to request a DMA transfer.

#define  UART1_IR_TNP_MASK           0x2u
#define  UART1_IR_TNP_SHIFT          0
#define  UART1_IR_TNP(x)             (((uint8_t)(((uint8_t)(x))<<UART1_IR_TNP_SHIFT))&UART1_IR_TNP_MASK)
//   Transmitter narrow pulse
//     0b00 ==> 3/16.
//     0b01 ==> 1/16.
//     0b10 ==> 1/32.
//     0b11 ==> 1/4.

#define  UART1_IR_IREN_MASK          0x4u
#define  UART1_IR_IREN_SHIFT         2
//   Infrared enable
//     0b0 ==> IR disabled.
//     0b1 ==> IR enabled.

#define  UART1_C7816_ISO_7816E_MASK  0x1u
#define  UART1_C7816_ISO_7816E_SHIFT 0
//   ISO-7816 Functionality Enabled
//     0b0 ==> ISO-7816 functionality is turned off/not enabled.
//     0b1 ==> ISO-7816 functionality is turned on/enabled.

#define  UART1_C7816_TTYPE_MASK      0x2u
#define  UART1_C7816_TTYPE_SHIFT     1
//   Transfer Type
//     0b0 ==> T = 0 per the ISO-7816 specification.
//     0b1 ==> T = 1 per the ISO-7816 specification.

#define  UART1_C7816_INIT_MASK       0x4u
#define  UART1_C7816_INIT_SHIFT      2
//   Detect Initial Character
//     0b0 ==> Normal operating mode. Receiver does not seek to identify initial character.
//     0b1 ==> Receiver searches for initial character.

#define  UART1_C7816_ANACK_MASK      0x8u
#define  UART1_C7816_ANACK_SHIFT     3
//   Generate NACK on Error
//     0b0 ==> No NACK is automatically generated.
//     0b1 ==> A NACK is automatically generated if a parity error is detected or if an invalid initial character is detected.

#define  UART1_C7816_ONACK_MASK      0x10u
#define  UART1_C7816_ONACK_SHIFT     4
//   Generate NACK on Overflow
//     0b0 ==> The received data does not generate a NACK when the receipt of the data results in an overflow event.
//     0b1 ==> If the receiver buffer overflows, a NACK is automatically sent on a received character.

#define  UART1_IE7816_RXTE_MASK      0x1u
#define  UART1_IE7816_RXTE_SHIFT     0
//   Receive Threshold Exceeded Interrupt Enable
//     0b0 ==> The assertion of IS7816[RXT] does not result in the generation of an interrupt.
//     0b1 ==> The assertion of IS7816[RXT] results in the generation of an interrupt.

#define  UART1_IE7816_TXTE_MASK      0x2u
#define  UART1_IE7816_TXTE_SHIFT     1
//   Transmit Threshold Exceeded Interrupt Enable
//     0b0 ==> The assertion of IS7816[TXT] does not result in the generation of an interrupt.
//     0b1 ==> The assertion of IS7816[TXT] results in the generation of an interrupt.

#define  UART1_IE7816_GTVE_MASK      0x4u
#define  UART1_IE7816_GTVE_SHIFT     2
//   Guard Timer Violated Interrupt Enable
//     0b0 ==> The assertion of IS7816[GTV] does not result in the generation of an interrupt.
//     0b1 ==> The assertion of IS7816[GTV] results in the generation of an interrupt.

