iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  UART1_IE7816_INITDE_MASK    0x10u
#define  UART1_IE7816_INITDE_SHIFT   4
//   Initial Character Detected Interrupt Enable
//     0b0 ==> The assertion of IS7816[INITD] does not result in the generation of an interrupt.
//     0b1 ==> The assertion of IS7816[INITD] results in the generation of an interrupt.

#define  UART1_IE7816_BWTE_MASK      0x20u
#define  UART1_IE7816_BWTE_SHIFT     5
//   Block Wait Timer Interrupt Enable
//     0b0 ==> The assertion of IS7816[BWT] does not result in the generation of an interrupt.
//     0b1 ==> The assertion of IS7816[BWT] results in the generation of an interrupt.

#define  UART1_IE7816_CWTE_MASK      0x40u
#define  UART1_IE7816_CWTE_SHIFT     6
//   Character Wait Timer Interrupt Enable
//     0b0 ==> The assertion of IS7816[CWT] does not result in the generation of an interrupt.
//     0b1 ==> The assertion of IS7816[CWT] results in the generation of an interrupt.

#define  UART1_IE7816_WTE_MASK       0x80u
#define  UART1_IE7816_WTE_SHIFT      7
//   Wait Timer Interrupt Enable
//     0b0 ==> The assertion of IS7816[WT] does not result in the generation of an interrupt.
//     0b1 ==> The assertion of IS7816[WT] results in the generation of an interrupt.

#define  UART1_IS7816_RXT_MASK       0x1u
#define  UART1_IS7816_RXT_SHIFT      0
//   Receive Threshold Exceeded Interrupt
//     0b0 ==> The number of consecutive NACKS generated as a result of parity errors and buffer overruns is less than or equal to the value in ET7816[RXTHRESHOLD].
//     0b1 ==> The number of consecutive NACKS generated as a result of parity errors and buffer overruns is greater than the value in ET7816[RXTHRESHOLD].

#define  UART1_IS7816_TXT_MASK       0x2u
#define  UART1_IS7816_TXT_SHIFT      1
//   Transmit Threshold Exceeded Interrupt
//     0b0 ==> The number of retries and corresponding NACKS does not exceed the value in ET7816[TXTHRESHOLD].
//     0b1 ==> The number of retries and corresponding NACKS exceeds the value in ET7816[TXTHRESHOLD].

#define  UART1_IS7816_GTV_MASK       0x4u
#define  UART1_IS7816_GTV_SHIFT      2
//   Guard Timer Violated Interrupt
//     0b0 ==> A guard time (GT, CGT, or BGT) has not been violated.
//     0b1 ==> A guard time (GT, CGT, or BGT) has been violated.

#define  UART1_IS7816_INITD_MASK     0x10u
#define  UART1_IS7816_INITD_SHIFT    4
//   Initial Character Detected Interrupt
//     0b0 ==> A valid initial character has not been received.
//     0b1 ==> A valid initial character has been received.

#define  UART1_IS7816_BWT_MASK       0x20u
#define  UART1_IS7816_BWT_SHIFT      5
//   Block Wait Timer Interrupt
//     0b0 ==> Block wait time (BWT) has not been violated.
//     0b1 ==> Block wait time (BWT) has been violated.

#define  UART1_IS7816_CWT_MASK       0x40u
#define  UART1_IS7816_CWT_SHIFT      6
//   Character Wait Timer Interrupt
//     0b0 ==> Character wait time (CWT) has not been violated.
//     0b1 ==> Character wait time (CWT) has been violated.

#define  UART1_IS7816_WT_MASK        0x80u
#define  UART1_IS7816_WT_SHIFT       7
//   Wait Timer Interrupt
//     0b0 ==> Wait time (WT) has not been violated.
//     0b1 ==> Wait time (WT) has been violated.

#define  UART1_WP7816T0_WI_MASK      0x8u
#define  UART1_WP7816T0_WI_SHIFT     0
#define  UART1_WP7816T0_WI(x)        (((uint8_t)(((uint8_t)(x))<<UART1_WP7816T0_WI_SHIFT))&UART1_WP7816T0_WI_MASK)
//   Wait Timer Interrupt (C7816[TTYPE] = 0)

#define  UART1_WP7816T1_BWI_MASK     0x4u
#define  UART1_WP7816T1_BWI_SHIFT    0
#define  UART1_WP7816T1_BWI(x)       (((uint8_t)(((uint8_t)(x))<<UART1_WP7816T1_BWI_SHIFT))&UART1_WP7816T1_BWI_MASK)
//   Block Wait Time Integer(C7816[TTYPE] = 1)

#define  UART1_WP7816T1_CWI_MASK     0x40u
#define  UART1_WP7816T1_CWI_SHIFT    4
#define  UART1_WP7816T1_CWI(x)       (((uint8_t)(((uint8_t)(x))<<UART1_WP7816T1_CWI_SHIFT))&UART1_WP7816T1_CWI_MASK)
//   Character Wait Time Integer (C7816[TTYPE] = 1)

#define  UART1_WN7816_GTN_MASK       0x8u
#define  UART1_WN7816_GTN_SHIFT      0
#define  UART1_WN7816_GTN(x)         (((uint8_t)(((uint8_t)(x))<<UART1_WN7816_GTN_SHIFT))&UART1_WN7816_GTN_MASK)
//   Guard Band N

#define  UART1_WF7816_GTFD_MASK      0x8u
#define  UART1_WF7816_GTFD_SHIFT     0
#define  UART1_WF7816_GTFD(x)        (((uint8_t)(((uint8_t)(x))<<UART1_WF7816_GTFD_SHIFT))&UART1_WF7816_GTFD_MASK)
//   FD Multiplier

#define  UART1_ET7816_RXTHRESHOLD_MASK 0x4u
#define  UART1_ET7816_RXTHRESHOLD_SHIFT 0
#define  UART1_ET7816_RXTHRESHOLD(x) (((uint8_t)(((uint8_t)(x))<<UART1_ET7816_RXTHRESHOLD_SHIFT))&UART1_ET7816_RXTHRESHOLD_MASK)
//   Receive NACK Threshold

#define  UART1_ET7816_TXTHRESHOLD_MASK 0x40u
#define  UART1_ET7816_TXTHRESHOLD_SHIFT 4
#define  UART1_ET7816_TXTHRESHOLD(x) (((uint8_t)(((uint8_t)(x))<<UART1_ET7816_TXTHRESHOLD_SHIFT))&UART1_ET7816_TXTHRESHOLD_MASK)
//   Transmit NACK Threshold
//     0b0 ==> TXT asserts on the first NACK that is received.
//     0b1 ==> TXT asserts on the second NACK that is received.

#define  UART1_TL7816_TLEN_MASK      0x8u
#define  UART1_TL7816_TLEN_SHIFT     0
#define  UART1_TL7816_TLEN(x)        (((uint8_t)(((uint8_t)(x))<<UART1_TL7816_TLEN_SHIFT))&UART1_TL7816_TLEN_MASK)
//   Transmit Length

#define  UART1_WB_WBASE_MASK         0x8u
#define  UART1_WB_WBASE_SHIFT        0
#define  UART1_WB_WBASE(x)           (((uint8_t)(((uint8_t)(x))<<UART1_WB_WBASE_SHIFT))&UART1_WB_WBASE_MASK)
//   CEA709.1-B WBASE register

#define  UART2_BDH_SBR_MASK          0x5u
#define  UART2_BDH_SBR_SHIFT         0
#define  UART2_BDH_SBR(x)            (((uint8_t)(((uint8_t)(x))<<UART2_BDH_SBR_SHIFT))&UART2_BDH_SBR_MASK)
//   UART Baud Rate Bits

#define  UART2_BDH_RXEDGIE_MASK      0x40u
#define  UART2_BDH_RXEDGIE_SHIFT     6
//   RxD Input Active Edge Interrupt Enable
//     0b0 ==> Hardware interrupts from RXEDGIF disabled using polling.
//     0b1 ==> RXEDGIF interrupt request enabled.

#define  UART2_BDH_LBKDIE_MASK       0x80u
#define  UART2_BDH_LBKDIE_SHIFT      7
//   LIN Break Detect Interrupt Enable
//     0b0 ==> LBKDIF interrupt requests disabled.
//     0b1 ==> LBKDIF interrupt requests enabled.

#define  UART2_BDL_SBR_MASK          0x8u
#define  UART2_BDL_SBR_SHIFT         0
#define  UART2_BDL_SBR(x)            (((uint8_t)(((uint8_t)(x))<<UART2_BDL_SBR_SHIFT))&UART2_BDL_SBR_MASK)
//   UART Baud Rate Bits

#define  UART2_C1_PT_MASK            0x1u
#define  UART2_C1_PT_SHIFT           0
//   Parity Type
//     0b0 ==> Even parity.
//     0b1 ==> Odd parity.

#define  UART2_C1_PE_MASK            0x2u
#define  UART2_C1_PE_SHIFT           1
//   Parity Enable
//     0b0 ==> Parity function disabled.
//     0b1 ==> Parity function enabled.

#define  UART2_C1_ILT_MASK           0x4u
#define  UART2_C1_ILT_SHIFT          2
//   Idle Line Type Select
//     0b0 ==> Idle character bit count starts after start bit.
//     0b1 ==> Idle character bit count starts after stop bit.

