iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  UART2_WP7816T1_CWI_MASK     0x40u
#define  UART2_WP7816T1_CWI_SHIFT    4
#define  UART2_WP7816T1_CWI(x)       (((uint8_t)(((uint8_t)(x))<<UART2_WP7816T1_CWI_SHIFT))&UART2_WP7816T1_CWI_MASK)
//   Character Wait Time Integer (C7816[TTYPE] = 1)

#define  UART2_WN7816_GTN_MASK       0x8u
#define  UART2_WN7816_GTN_SHIFT      0
#define  UART2_WN7816_GTN(x)         (((uint8_t)(((uint8_t)(x))<<UART2_WN7816_GTN_SHIFT))&UART2_WN7816_GTN_MASK)
//   Guard Band N

#define  UART2_WF7816_GTFD_MASK      0x8u
#define  UART2_WF7816_GTFD_SHIFT     0
#define  UART2_WF7816_GTFD(x)        (((uint8_t)(((uint8_t)(x))<<UART2_WF7816_GTFD_SHIFT))&UART2_WF7816_GTFD_MASK)
//   FD Multiplier

#define  UART2_ET7816_RXTHRESHOLD_MASK 0x4u
#define  UART2_ET7816_RXTHRESHOLD_SHIFT 0
#define  UART2_ET7816_RXTHRESHOLD(x) (((uint8_t)(((uint8_t)(x))<<UART2_ET7816_RXTHRESHOLD_SHIFT))&UART2_ET7816_RXTHRESHOLD_MASK)
//   Receive NACK Threshold

#define  UART2_ET7816_TXTHRESHOLD_MASK 0x40u
#define  UART2_ET7816_TXTHRESHOLD_SHIFT 4
#define  UART2_ET7816_TXTHRESHOLD(x) (((uint8_t)(((uint8_t)(x))<<UART2_ET7816_TXTHRESHOLD_SHIFT))&UART2_ET7816_TXTHRESHOLD_MASK)
//   Transmit NACK Threshold
//     0b0 ==> TXT asserts on the first NACK that is received.
//     0b1 ==> TXT asserts on the second NACK that is received.

#define  UART2_TL7816_TLEN_MASK      0x8u
#define  UART2_TL7816_TLEN_SHIFT     0
#define  UART2_TL7816_TLEN(x)        (((uint8_t)(((uint8_t)(x))<<UART2_TL7816_TLEN_SHIFT))&UART2_TL7816_TLEN_MASK)
//   Transmit Length

#define  UART2_WB_WBASE_MASK         0x8u
#define  UART2_WB_WBASE_SHIFT        0
#define  UART2_WB_WBASE(x)           (((uint8_t)(((uint8_t)(x))<<UART2_WB_WBASE_SHIFT))&UART2_WB_WBASE_MASK)
//   CEA709.1-B WBASE register

#define  UART3_BDH_SBR_MASK          0x5u
#define  UART3_BDH_SBR_SHIFT         0
#define  UART3_BDH_SBR(x)            (((uint8_t)(((uint8_t)(x))<<UART3_BDH_SBR_SHIFT))&UART3_BDH_SBR_MASK)
//   UART Baud Rate Bits

#define  UART3_BDH_RXEDGIE_MASK      0x40u
#define  UART3_BDH_RXEDGIE_SHIFT     6
//   RxD Input Active Edge Interrupt Enable
//     0b0 ==> Hardware interrupts from RXEDGIF disabled using polling.
//     0b1 ==> RXEDGIF interrupt request enabled.

#define  UART3_BDH_LBKDIE_MASK       0x80u
#define  UART3_BDH_LBKDIE_SHIFT      7
//   LIN Break Detect Interrupt Enable
//     0b0 ==> LBKDIF interrupt requests disabled.
//     0b1 ==> LBKDIF interrupt requests enabled.

#define  UART3_BDL_SBR_MASK          0x8u
#define  UART3_BDL_SBR_SHIFT         0
#define  UART3_BDL_SBR(x)            (((uint8_t)(((uint8_t)(x))<<UART3_BDL_SBR_SHIFT))&UART3_BDL_SBR_MASK)
//   UART Baud Rate Bits

#define  UART3_C1_PT_MASK            0x1u
#define  UART3_C1_PT_SHIFT           0
//   Parity Type
//     0b0 ==> Even parity.
//     0b1 ==> Odd parity.

#define  UART3_C1_PE_MASK            0x2u
#define  UART3_C1_PE_SHIFT           1
//   Parity Enable
//     0b0 ==> Parity function disabled.
//     0b1 ==> Parity function enabled.

#define  UART3_C1_ILT_MASK           0x4u
#define  UART3_C1_ILT_SHIFT          2
//   Idle Line Type Select
//     0b0 ==> Idle character bit count starts after start bit.
//     0b1 ==> Idle character bit count starts after stop bit.

#define  UART3_C1_WAKE_MASK          0x8u
#define  UART3_C1_WAKE_SHIFT         3
//   Receiver Wakeup Method Select
//     0b0 ==> Idle line wakeup.
//     0b1 ==> Address mark wakeup.

#define  UART3_C1_M_MASK             0x10u
#define  UART3_C1_M_SHIFT            4
//   9-bit or 8-bit Mode Select
//     0b0 ==> Normal-start + 8 data bits (MSB/LSB first as determined by MSBF) + stop.
//     0b1 ==> Use-start + 9 data bits (MSB/LSB first as determined by MSBF) + stop.

#define  UART3_C1_RSRC_MASK          0x20u
#define  UART3_C1_RSRC_SHIFT         5
//   Receiver Source Select
//     0b0 ==> Selects internal loop back mode. The receiver input is internally connected to transmitter output.
//     0b1 ==> Single wire UART mode where the receiver input is connected to the transmit pin input signal.

#define  UART3_C1_LOOPS_MASK         0x80u
#define  UART3_C1_LOOPS_SHIFT        7
//   Loop Mode Select
//     0b0 ==> Normal operation.
//     0b1 ==> Loop mode where transmitter output is internally connected to receiver input. The receiver input is determined by RSRC.

#define  UART3_C2_SBK_MASK           0x1u
#define  UART3_C2_SBK_SHIFT          0
//   Send Break
//     0b0 ==> Normal transmitter operation.
//     0b1 ==> Queue break characters to be sent.

#define  UART3_C2_RWU_MASK           0x2u
#define  UART3_C2_RWU_SHIFT          1
//   Receiver Wakeup Control
//     0b0 ==> Normal operation.
//     0b1 ==> RWU enables the wakeup function and inhibits further receiver interrupt requests. Normally, hardware wakes the receiver by automatically clearing RWU.

#define  UART3_C2_RE_MASK            0x4u
#define  UART3_C2_RE_SHIFT           2
//   Receiver Enable
//     0b0 ==> Receiver off.
//     0b1 ==> Receiver on.

#define  UART3_C2_TE_MASK            0x8u
#define  UART3_C2_TE_SHIFT           3
//   Transmitter Enable
//     0b0 ==> Transmitter off.
//     0b1 ==> Transmitter on.

#define  UART3_C2_ILIE_MASK          0x10u
#define  UART3_C2_ILIE_SHIFT         4
//   Idle Line Interrupt Enable
//     0b0 ==> IDLE interrupt requests disabled.
//     0b1 ==> IDLE interrupt requests enabled.

#define  UART3_C2_RIE_MASK           0x20u
#define  UART3_C2_RIE_SHIFT          5
//   Receiver Full Interrupt or DMA Transfer Enable
//     0b0 ==> RDRF interrupt and DMA transfer requests disabled.
//     0b1 ==> RDRF interrupt or DMA transfer requests enabled.

#define  UART3_C2_TCIE_MASK          0x40u
#define  UART3_C2_TCIE_SHIFT         6
//   Transmission Complete Interrupt Enable
//     0b0 ==> TC interrupt requests disabled.
//     0b1 ==> TC interrupt requests enabled.

#define  UART3_C2_TIE_MASK           0x80u
#define  UART3_C2_TIE_SHIFT          7
//   Transmitter Interrupt or DMA Transfer Enable.
//     0b0 ==> TDRE interrupt and DMA transfer requests disabled.
//     0b1 ==> TDRE interrupt or DMA transfer requests enabled.

#define  UART3_S1_PF_MASK            0x1u
#define  UART3_S1_PF_SHIFT           0
//   Parity Error Flag
//     0b0 ==> No parity error detected since the last time this flag was cleared. If the receive buffer has a depth greater than 1, then there may be data in the receive buffer what was received with a parity error.
//     0b1 ==> At least one dataword was received with a parity error since the last time this flag was cleared.

