iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  UART3_WP7816T1_CWI_MASK     0x40u
#define  UART3_WP7816T1_CWI_SHIFT    4
#define  UART3_WP7816T1_CWI(x)       (((uint8_t)(((uint8_t)(x))<<UART3_WP7816T1_CWI_SHIFT))&UART3_WP7816T1_CWI_MASK)
//   Character Wait Time Integer (C7816[TTYPE] = 1)

#define  UART3_WN7816_GTN_MASK       0x8u
#define  UART3_WN7816_GTN_SHIFT      0
#define  UART3_WN7816_GTN(x)         (((uint8_t)(((uint8_t)(x))<<UART3_WN7816_GTN_SHIFT))&UART3_WN7816_GTN_MASK)
//   Guard Band N

#define  UART3_WF7816_GTFD_MASK      0x8u
#define  UART3_WF7816_GTFD_SHIFT     0
#define  UART3_WF7816_GTFD(x)        (((uint8_t)(((uint8_t)(x))<<UART3_WF7816_GTFD_SHIFT))&UART3_WF7816_GTFD_MASK)
//   FD Multiplier

#define  UART3_ET7816_RXTHRESHOLD_MASK 0x4u
#define  UART3_ET7816_RXTHRESHOLD_SHIFT 0
#define  UART3_ET7816_RXTHRESHOLD(x) (((uint8_t)(((uint8_t)(x))<<UART3_ET7816_RXTHRESHOLD_SHIFT))&UART3_ET7816_RXTHRESHOLD_MASK)
//   Receive NACK Threshold

#define  UART3_ET7816_TXTHRESHOLD_MASK 0x40u
#define  UART3_ET7816_TXTHRESHOLD_SHIFT 4
#define  UART3_ET7816_TXTHRESHOLD(x) (((uint8_t)(((uint8_t)(x))<<UART3_ET7816_TXTHRESHOLD_SHIFT))&UART3_ET7816_TXTHRESHOLD_MASK)
//   Transmit NACK Threshold
//     0b0 ==> TXT asserts on the first NACK that is received.
//     0b1 ==> TXT asserts on the second NACK that is received.

#define  UART3_TL7816_TLEN_MASK      0x8u
#define  UART3_TL7816_TLEN_SHIFT     0
#define  UART3_TL7816_TLEN(x)        (((uint8_t)(((uint8_t)(x))<<UART3_TL7816_TLEN_SHIFT))&UART3_TL7816_TLEN_MASK)
//   Transmit Length

#define  UART3_WB_WBASE_MASK         0x8u
#define  UART3_WB_WBASE_SHIFT        0
#define  UART3_WB_WBASE(x)           (((uint8_t)(((uint8_t)(x))<<UART3_WB_WBASE_SHIFT))&UART3_WB_WBASE_MASK)
//   CEA709.1-B WBASE register

#define  VREF_VREFH_TRM_TRIM_MASK    0x6u
#define  VREF_VREFH_TRM_TRIM_SHIFT   0
#define  VREF_VREFH_TRM_TRIM(x)      (((uint8_t)(((uint8_t)(x))<<VREF_VREFH_TRM_TRIM_SHIFT))&VREF_VREFH_TRM_TRIM_MASK)
//   Trim bits
//     0b000000 ==> Min
//     0b111111 ==> Max

#define  VREF_VREFH_TRM_CHOPEN_MASK  0x40u
#define  VREF_VREFH_TRM_CHOPEN_SHIFT 6
//   Chop oscillator enable. When set, internal chopping operation is enabled and the internal analog offset will be minimized.
//     0b0 ==> Chop oscillator is disabled.
//     0b1 ==> Chop oscillator is enabled.

#define  VREF_VREFH_SC_MODE_LV_MASK  0x2u
#define  VREF_VREFH_SC_MODE_LV_SHIFT 0
#define  VREF_VREFH_SC_MODE_LV(x)    (((uint8_t)(((uint8_t)(x))<<VREF_VREFH_SC_MODE_LV_SHIFT))&VREF_VREFH_SC_MODE_LV_MASK)
//   Buffer Mode selection
//     0b00 ==> Bandgap on only, for stabilization and startup
//     0b01 ==> High power buffer mode enabled
//     0b10 ==> Low-power buffer mode enabled
//     0b11 ==> Reserved

#define  VREF_VREFH_SC_VREFST_MASK   0x4u
#define  VREF_VREFH_SC_VREFST_SHIFT  2
//   Internal Voltage Reference stable
//     0b0 ==> The module is disabled or not stable.
//     0b1 ==> The module is stable.

#define  VREF_VREFH_SC_ICOMPEN_MASK  0x20u
#define  VREF_VREFH_SC_ICOMPEN_SHIFT 5
//   Second order curvature compensation enable
//     0b0 ==> Disabled
//     0b1 ==> Enabled

#define  VREF_VREFH_SC_REGEN_MASK    0x40u
#define  VREF_VREFH_SC_REGEN_SHIFT   6
//   Regulator enable
//     0b0 ==> Internal 1.75 V regulator is disabled.
//     0b1 ==> Internal 1.75 V regulator is enabled.

#define  VREF_VREFH_SC_VREFEN_MASK   0x80u
#define  VREF_VREFH_SC_VREFEN_SHIFT  7
//   Internal Voltage Reference enable
//     0b0 ==> The module is disabled.
//     0b1 ==> The module is enabled.

#define  VREF_VREFL_TRM_VREFL_TRIM_MASK 0x3u
#define  VREF_VREFL_TRM_VREFL_TRIM_SHIFT 0
#define  VREF_VREFL_TRM_VREFL_TRIM(x) (((uint8_t)(((uint8_t)(x))<<VREF_VREFL_TRM_VREFL_TRIM_SHIFT))&VREF_VREFL_TRM_VREFL_TRIM_MASK)

#define  VREF_VREFL_TRM_VREFL_EN_MASK 0x8u
#define  VREF_VREFL_TRM_VREFL_EN_SHIFT 3
//     0b0 ==> Disable
//     0b1 ==> Enable

#define  VREF_VREFL_TRM_VREFL_SEL_MASK 0x10u
#define  VREF_VREFL_TRM_VREFL_SEL_SHIFT 4
//     0b0 ==> Internal reference
//     0b1 ==> External reference

#define  WDOG_STCTRLH_WDOGEN_MASK    0x1u
#define  WDOG_STCTRLH_WDOGEN_SHIFT   0
//     0b0 ==> WDOG is disabled.
//     0b1 ==> WDOG is enabled.

#define  WDOG_STCTRLH_CLKSRC_MASK    0x2u
#define  WDOG_STCTRLH_CLKSRC_SHIFT   1
//     0b0 ==> WDOG clock sourced from LPO (also known as the RC oscillator).
//     0b1 ==> WDOG clock sourced from alternate clock source.

#define  WDOG_STCTRLH_IRQRSTEN_MASK  0x4u
#define  WDOG_STCTRLH_IRQRSTEN_SHIFT 2
//     0b0 ==> WDOG time-out generates reset only.
//     0b1 ==> WDOG time-out initially generates an interrupt. After WCT, it generates a reset.

#define  WDOG_STCTRLH_WINEN_MASK     0x8u
#define  WDOG_STCTRLH_WINEN_SHIFT    3
//     0b0 ==> Windowing mode is disabled.
//     0b1 ==> Windowing mode is enabled.

#define  WDOG_STCTRLH_ALLOWUPDATE_MASK 0x10u
#define  WDOG_STCTRLH_ALLOWUPDATE_SHIFT 4
//     0b0 ==> No further updates allowed to WDOG write-once registers.
//     0b1 ==> WDOG write-once registers can be unlocked for updating.

#define  WDOG_STCTRLH_DBGEN_MASK     0x20u
#define  WDOG_STCTRLH_DBGEN_SHIFT    5
//     0b0 ==> WDOG is disabled in CPU Debug mode.
//     0b1 ==> WDOG is enabled in CPU Debug mode.

#define  WDOG_STCTRLH_STOPEN_MASK    0x40u
#define  WDOG_STCTRLH_STOPEN_SHIFT   6
//     0b0 ==> WDOG is disabled in CPU Stop mode.
//     0b1 ==> WDOG is enabled in CPU Stop mode.

#define  WDOG_STCTRLH_WAITEN_MASK    0x80u
#define  WDOG_STCTRLH_WAITEN_SHIFT   7
//     0b0 ==> WDOG is disabled in CPU Wait mode.
//     0b1 ==> WDOG is enabled in CPU Wait mode.

#define  WDOG_STCTRLH_STNDBYEN_MASK  0x100u
#define  WDOG_STCTRLH_STNDBYEN_SHIFT 8
//     0b0 ==> WDOG is disabled in system Standby mode.
//     0b1 ==> WDOG is enabled in system Standby mode.

#define  WDOG_STCTRLH_TESTWDOG_MASK  0x400u
#define  WDOG_STCTRLH_TESTWDOG_SHIFT 10

#define  WDOG_STCTRLH_TESTSEL_MASK   0x800u
#define  WDOG_STCTRLH_TESTSEL_SHIFT  11
//     0b0 ==> Quick test. The timer runs in normal operation. You can load a small time-out value to do a quick test.
//     0b1 ==> Byte test. Puts the timer in the byte test mode where individual bytes of the timer are enabled for operation and are compared for time-out against the corresponding byte of the programmed time-out value. Select the byte through BYTESEL[1:0] for testing.

#define  WDOG_STCTRLH_BYTESEL_MASK   0x2000u
#define  WDOG_STCTRLH_BYTESEL_SHIFT  12
#define  WDOG_STCTRLH_BYTESEL(x)     (((uint16_t)(((uint16_t)(x))<<WDOG_STCTRLH_BYTESEL_SHIFT))&WDOG_STCTRLH_BYTESEL_MASK)
//     0b00 ==> Byte 0 selected
//     0b01 ==> Byte 1 selected
//     0b10 ==> Byte 2 selected
//     0b11 ==> Byte 3 selected

