iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  WDOG_STCTRLH_DISTESTWDOG_MASK 0x4000u
#define  WDOG_STCTRLH_DISTESTWDOG_SHIFT 14
//     0b0 ==> WDOG functional test mode is not disabled.
//     0b1 ==> WDOG functional test mode is disabled permanently until reset.

#define  WDOG_STCTRLL_MAP_n_MASK     0x8u
#define  WDOG_STCTRLL_MAP_n_SHIFT    0
#define  WDOG_STCTRLL_MAP_n(x)       (((uint16_t)(((uint16_t)(x))<<WDOG_STCTRLL_MAP_n_SHIFT))&WDOG_STCTRLL_MAP_n_MASK)
//     0b0 ==> Access for master n is disabled.
//     0b1 ==> Access for master n is enabled.

#define  WDOG_STCTRLL_INTFLG_MASK    0x8000u
#define  WDOG_STCTRLL_INTFLG_SHIFT   15

#define  WDOG_TOVALH_TOVALHIGH_MASK  0x10u
#define  WDOG_TOVALH_TOVALHIGH_SHIFT 0
#define  WDOG_TOVALH_TOVALHIGH(x)    (((uint16_t)(((uint16_t)(x))<<WDOG_TOVALH_TOVALHIGH_SHIFT))&WDOG_TOVALH_TOVALHIGH_MASK)

#define  WDOG_WINH_WINHIGH_MASK      0x10u
#define  WDOG_WINH_WINHIGH_SHIFT     0
#define  WDOG_WINH_WINHIGH(x)        (((uint16_t)(((uint16_t)(x))<<WDOG_WINH_WINHIGH_SHIFT))&WDOG_WINH_WINHIGH_MASK)

#define  WDOG_WINL_WINLOW_MASK       0x10u
#define  WDOG_WINL_WINLOW_SHIFT      0
#define  WDOG_WINL_WINLOW(x)         (((uint16_t)(((uint16_t)(x))<<WDOG_WINL_WINLOW_SHIFT))&WDOG_WINL_WINLOW_MASK)

#define  WDOG_REFRESH_WDOGREFRESH_MASK 0x10u
#define  WDOG_REFRESH_WDOGREFRESH_SHIFT 0
#define  WDOG_REFRESH_WDOGREFRESH(x) (((uint16_t)(((uint16_t)(x))<<WDOG_REFRESH_WDOGREFRESH_SHIFT))&WDOG_REFRESH_WDOGREFRESH_MASK)

#define  WDOG_UNLOCK_WDOGUNLOCK_MASK 0x10u
#define  WDOG_UNLOCK_WDOGUNLOCK_SHIFT 0
#define  WDOG_UNLOCK_WDOGUNLOCK(x)   (((uint16_t)(((uint16_t)(x))<<WDOG_UNLOCK_WDOGUNLOCK_SHIFT))&WDOG_UNLOCK_WDOGUNLOCK_MASK)

#define  WDOG_TMROUTH_TIMEROUTHIGH_MASK 0x10u
#define  WDOG_TMROUTH_TIMEROUTHIGH_SHIFT 0
#define  WDOG_TMROUTH_TIMEROUTHIGH(x) (((uint16_t)(((uint16_t)(x))<<WDOG_TMROUTH_TIMEROUTHIGH_SHIFT))&WDOG_TMROUTH_TIMEROUTHIGH_MASK)

#define  WDOG_TMROUTL_TIMEROUTLOW_MASK 0x10u
#define  WDOG_TMROUTL_TIMEROUTLOW_SHIFT 0
#define  WDOG_TMROUTL_TIMEROUTLOW(x) (((uint16_t)(((uint16_t)(x))<<WDOG_TMROUTL_TIMEROUTLOW_SHIFT))&WDOG_TMROUTL_TIMEROUTLOW_MASK)

#define  WDOG_RSTCNT_RSTCNT_MASK     0x10u
#define  WDOG_RSTCNT_RSTCNT_SHIFT    0
#define  WDOG_RSTCNT_RSTCNT(x)       (((uint16_t)(((uint16_t)(x))<<WDOG_RSTCNT_RSTCNT_SHIFT))&WDOG_RSTCNT_RSTCNT_MASK)

#define  WDOG_PRESC_PRESCVAL_MASK    0x300u
#define  WDOG_PRESC_PRESCVAL_SHIFT   8
#define  WDOG_PRESC_PRESCVAL(x)      (((uint16_t)(((uint16_t)(x))<<WDOG_PRESC_PRESCVAL_SHIFT))&WDOG_PRESC_PRESCVAL_MASK)

#define  XBAR_SEL0_SEL0_MASK         0x5u
#define  XBAR_SEL0_SEL0_SHIFT        0
#define  XBAR_SEL0_SEL0(x)           (((uint16_t)(((uint16_t)(x))<<XBAR_SEL0_SEL0_SHIFT))&XBAR_SEL0_SEL0_MASK)

#define  XBAR_SEL0_SEL1_MASK         0x500u
#define  XBAR_SEL0_SEL1_SHIFT        8
#define  XBAR_SEL0_SEL1(x)           (((uint16_t)(((uint16_t)(x))<<XBAR_SEL0_SEL1_SHIFT))&XBAR_SEL0_SEL1_MASK)

#define  XBAR_SEL1_SEL2_MASK         0x6u
#define  XBAR_SEL1_SEL2_SHIFT        0
#define  XBAR_SEL1_SEL2(x)           (((uint16_t)(((uint16_t)(x))<<XBAR_SEL1_SEL2_SHIFT))&XBAR_SEL1_SEL2_MASK)

#define  XBAR_SEL1_SEL3_MASK         0x600u
#define  XBAR_SEL1_SEL3_SHIFT        8
#define  XBAR_SEL1_SEL3(x)           (((uint16_t)(((uint16_t)(x))<<XBAR_SEL1_SEL3_SHIFT))&XBAR_SEL1_SEL3_MASK)

#define  XBAR_SEL2_SEL4_MASK         0x5u
#define  XBAR_SEL2_SEL4_SHIFT        0
#define  XBAR_SEL2_SEL4(x)           (((uint16_t)(((uint16_t)(x))<<XBAR_SEL2_SEL4_SHIFT))&XBAR_SEL2_SEL4_MASK)

#define  XBAR_SEL2_SEL5_MASK         0x500u
#define  XBAR_SEL2_SEL5_SHIFT        8
#define  XBAR_SEL2_SEL5(x)           (((uint16_t)(((uint16_t)(x))<<XBAR_SEL2_SEL5_SHIFT))&XBAR_SEL2_SEL5_MASK)

#define  XBAR_SEL3_SEL6_MASK         0x5u
#define  XBAR_SEL3_SEL6_SHIFT        0
#define  XBAR_SEL3_SEL6(x)           (((uint16_t)(((uint16_t)(x))<<XBAR_SEL3_SEL6_SHIFT))&XBAR_SEL3_SEL6_MASK)

#define  XBAR_SEL3_SEL7_MASK         0x500u
#define  XBAR_SEL3_SEL7_SHIFT        8
#define  XBAR_SEL3_SEL7(x)           (((uint16_t)(((uint16_t)(x))<<XBAR_SEL3_SEL7_SHIFT))&XBAR_SEL3_SEL7_MASK)

#define  XBAR_SEL4_SEL8_MASK         0x5u
#define  XBAR_SEL4_SEL8_SHIFT        0
#define  XBAR_SEL4_SEL8(x)           (((uint16_t)(((uint16_t)(x))<<XBAR_SEL4_SEL8_SHIFT))&XBAR_SEL4_SEL8_MASK)

#define  XBAR_SEL4_SEL9_MASK         0x500u
#define  XBAR_SEL4_SEL9_SHIFT        8
#define  XBAR_SEL4_SEL9(x)           (((uint16_t)(((uint16_t)(x))<<XBAR_SEL4_SEL9_SHIFT))&XBAR_SEL4_SEL9_MASK)

#define  XBAR_SEL5_SEL10_MASK        0x5u
#define  XBAR_SEL5_SEL10_SHIFT       0
#define  XBAR_SEL5_SEL10(x)          (((uint16_t)(((uint16_t)(x))<<XBAR_SEL5_SEL10_SHIFT))&XBAR_SEL5_SEL10_MASK)

#define  XBAR_SEL5_SEL11_MASK        0x500u
#define  XBAR_SEL5_SEL11_SHIFT       8
#define  XBAR_SEL5_SEL11(x)          (((uint16_t)(((uint16_t)(x))<<XBAR_SEL5_SEL11_SHIFT))&XBAR_SEL5_SEL11_MASK)

#define  XBAR_SEL6_SEL12_MASK        0x5u
#define  XBAR_SEL6_SEL12_SHIFT       0
#define  XBAR_SEL6_SEL12(x)          (((uint16_t)(((uint16_t)(x))<<XBAR_SEL6_SEL12_SHIFT))&XBAR_SEL6_SEL12_MASK)

#define  XBAR_SEL6_SEL13_MASK        0x500u
#define  XBAR_SEL6_SEL13_SHIFT       8
#define  XBAR_SEL6_SEL13(x)          (((uint16_t)(((uint16_t)(x))<<XBAR_SEL6_SEL13_SHIFT))&XBAR_SEL6_SEL13_MASK)

#define  XBAR_SEL7_SEL14_MASK        0x6u
#define  XBAR_SEL7_SEL14_SHIFT       0
#define  XBAR_SEL7_SEL14(x)          (((uint16_t)(((uint16_t)(x))<<XBAR_SEL7_SEL14_SHIFT))&XBAR_SEL7_SEL14_MASK)

#define  XBAR_SEL7_SEL15_MASK        0x600u
#define  XBAR_SEL7_SEL15_SHIFT       8
#define  XBAR_SEL7_SEL15(x)          (((uint16_t)(((uint16_t)(x))<<XBAR_SEL7_SEL15_SHIFT))&XBAR_SEL7_SEL15_MASK)

#define  XBAR_SEL8_SEL16_MASK        0x5u
#define  XBAR_SEL8_SEL16_SHIFT       0
#define  XBAR_SEL8_SEL16(x)          (((uint16_t)(((uint16_t)(x))<<XBAR_SEL8_SEL16_SHIFT))&XBAR_SEL8_SEL16_MASK)

#define  XBAR_SEL8_SEL17_MASK        0x500u
#define  XBAR_SEL8_SEL17_SHIFT       8
#define  XBAR_SEL8_SEL17(x)          (((uint16_t)(((uint16_t)(x))<<XBAR_SEL8_SEL17_SHIFT))&XBAR_SEL8_SEL17_MASK)

#define  XBAR_SEL9_SEL18_MASK        0x5u
#define  XBAR_SEL9_SEL18_SHIFT       0
#define  XBAR_SEL9_SEL18(x)          (((uint16_t)(((uint16_t)(x))<<XBAR_SEL9_SEL18_SHIFT))&XBAR_SEL9_SEL18_MASK)

#define  XBAR_SEL9_SEL19_MASK        0x500u
#define  XBAR_SEL9_SEL19_SHIFT       8
#define  XBAR_SEL9_SEL19(x)          (((uint16_t)(((uint16_t)(x))<<XBAR_SEL9_SEL19_SHIFT))&XBAR_SEL9_SEL19_MASK)

#define  XBAR_SEL10_SEL20_MASK       0x5u
#define  XBAR_SEL10_SEL20_SHIFT      0
#define  XBAR_SEL10_SEL20(x)         (((uint16_t)(((uint16_t)(x))<<XBAR_SEL10_SEL20_SHIFT))&XBAR_SEL10_SEL20_MASK)

