iarsystems/ewarm-nxp-example-projects/Kinetis/FRDM-KL25Z/src/cpu/headers/MKM34Z128LL5.h
#define  XBAR_SEL10_SEL21_MASK       0x500u
#define  XBAR_SEL10_SEL21_SHIFT      8
#define  XBAR_SEL10_SEL21(x)         (((uint16_t)(((uint16_t)(x))<<XBAR_SEL10_SEL21_SHIFT))&XBAR_SEL10_SEL21_MASK)

#define  XBAR_SEL11_SEL22_MASK       0x5u
#define  XBAR_SEL11_SEL22_SHIFT      0
#define  XBAR_SEL11_SEL22(x)         (((uint16_t)(((uint16_t)(x))<<XBAR_SEL11_SEL22_SHIFT))&XBAR_SEL11_SEL22_MASK)

#define  XBAR_SEL11_SEL23_MASK       0x500u
#define  XBAR_SEL11_SEL23_SHIFT      8
#define  XBAR_SEL11_SEL23(x)         (((uint16_t)(((uint16_t)(x))<<XBAR_SEL11_SEL23_SHIFT))&XBAR_SEL11_SEL23_MASK)

#define  XBAR_SEL12_SEL24_MASK       0x5u
#define  XBAR_SEL12_SEL24_SHIFT      0
#define  XBAR_SEL12_SEL24(x)         (((uint16_t)(((uint16_t)(x))<<XBAR_SEL12_SEL24_SHIFT))&XBAR_SEL12_SEL24_MASK)

#define  XBAR_CTRL0_DEN0_MASK        0x1u
#define  XBAR_CTRL0_DEN0_SHIFT       0
//   DMA Enable for XBAR_OUT0
//     0b0 ==> DMA disabled
//     0b1 ==> DMA enabled

#define  XBAR_CTRL0_IEN0_MASK        0x2u
#define  XBAR_CTRL0_IEN0_SHIFT       1
//   Interrupt Enable for XBAR_OUT0
//     0b0 ==> Interrupt disabled
//     0b1 ==> Interrupt enabled

#define  XBAR_CTRL0_EDGE0_MASK       0x8u
#define  XBAR_CTRL0_EDGE0_SHIFT      2
#define  XBAR_CTRL0_EDGE0(x)         (((uint16_t)(((uint16_t)(x))<<XBAR_CTRL0_EDGE0_SHIFT))&XBAR_CTRL0_EDGE0_MASK)
//   Active edge for edge detection on XBAR_OUT0
//     0b00 ==> STS0 never asserts
//     0b01 ==> STS0 asserts on rising edges of XBAR_OUT0
//     0b10 ==> STS0 asserts on falling edges of XBAR_OUT0
//     0b11 ==> STS0 asserts on rising and falling edges of XBAR_OUT0

#define  XBAR_CTRL0_STS0_MASK        0x10u
#define  XBAR_CTRL0_STS0_SHIFT       4
//   Edge detection status for XBAR_OUT0
//     0b0 ==> Active edge not yet detected on XBAR_OUT0
//     0b1 ==> Active edge detected on XBAR_OUT0


//////////////////////////////////////////////////////////////////////////////////////
// Backward compatibility.

// No backward compatibility issues.
